[Killed] BlockStatement
GamePlaying/GameEventsMonitor/GameEventsMonitorFooter/GameEventsMonitorFooter.vue:44:58
   goToPreviousGameEvent();
 }
 
-async function handleNextGameEventClick(): Promise<void> {
-  await goToNextGameEvent();
-}
+async function handleNextGameEventClick(): Promise<void> {}
 </script>
killedBy: Game Events Monitor Footer Component Skip Current Event button should skip current game event when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
