[Killed] ConditionalExpression
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:72:88
 
 const currentGameEventText = computed<string | undefined>(() => props.texts[currentIndex.value]);
 
-const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0 && makingGamePlayStatus.value !== "pending");
+const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0 && true);
 
 const canGoToNextGameEventText = computed<boolean>(() => makingGamePlayStatus.value !== "pending");
killedBy: Game Event Texts Manager Component Previous Game Event Text button should be disabled when making game play status is pending.
statusReason: expected undefined to be '' // Object.is equality

[Killed] EqualityOperator
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:72:62
 
 const currentGameEventText = computed<string | undefined>(() => props.texts[currentIndex.value]);
 
-const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0 && makingGamePlayStatus.value !== "pending");
+const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value <= 0 && makingGamePlayStatus.value !== "pending");
 
 const canGoToNextGameEventText = computed<boolean>(() => makingGamePlayStatus.value !== "pending");
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] ConditionalExpression
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:74:58
 
 const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0 && makingGamePlayStatus.value !== "pending");
 
-const canGoToNextGameEventText = computed<boolean>(() => makingGamePlayStatus.value !== "pending");
+const canGoToNextGameEventText = computed<boolean>(() => true);
 
 const previousGameEventTextTooltip = computed<string>(() => {
killedBy: Game Event Texts Manager Component Next Game Event Text button should be disabled when making game play status is pending.
statusReason: expected undefined to be '' // Object.is equality

[Killed] ArrowFunction
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:74:52
 
 const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0 && makingGamePlayStatus.value !== "pending");
 
-const canGoToNextGameEventText = computed<boolean>(() => makingGamePlayStatus.value !== "pending");
+const canGoToNextGameEventText = computed<boolean>(() => undefined);
 
 const previousGameEventTextTooltip = computed<string>(() => {
killedBy: Game Event Texts Manager Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Texts Manager Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:77:7
 const canGoToNextGameEventText = computed<boolean>(() => makingGamePlayStatus.value !== "pending");
 
 const previousGameEventTextTooltip = computed<string>(() => {
-  if (canGoToPreviousGameEventText.value) {
+  if (false) {
     return t("shared.actions.back");
   }
killedBy: Game Event Texts Manager Component Previous Game Event Text button should have tooltip when can go to previous game event.
statusReason: expected '' to be 'shared.actions.back' // Object.is equality

[Killed] BlockStatement
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:83:47
   return "";
 });
 
-async function nextEventText(): Promise<void> {
-  currentIndex.value++;
-  if (currentGameEventText.value === undefined) {
-    await goToNextGameEvent();
-  }
-}
+async function nextEventText(): Promise<void> {}
 
 function previousGameEventText(): void {
killedBy: Game Event Texts Manager Component Previous Game Event Text button should be enabled when can go to previous game event.
statusReason: expected '' to be undefined

[Killed] UpdateOperator
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:84:3
 });
 
 async function nextEventText(): Promise<void> {
-  currentIndex.value++;
+  currentIndex.value--;
   if (currentGameEventText.value === undefined) {
     await goToNextGameEvent();
killedBy: Game Event Texts Manager Component Previous Game Event Text button should be enabled when can go to previous game event.
statusReason: expected '' to be undefined
