[Killed] ArrowFunction
stores/game/game-event/useGameEventsStore.ts:14:60
 
   const gameStore = useGameStore();
 
-  const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
+  const currentGameEvent = computed<GameEvent | undefined>(() => undefined);
   const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0 && gameStore.makingGamePlayStatus !== "pending");
   const canGoToNextGameEvent = computed<boolean>(() => gameStore.makingGamePlayStatus !== "pending");
killedBy: Game Events Monitor Current Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Events Monitor Current Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:15:95
   const gameStore = useGameStore();
 
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
-  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0 && gameStore.makingGamePlayStatus !== "pending");
+  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0 && true);
   const canGoToNextGameEvent = computed<boolean>(() => gameStore.makingGamePlayStatus !== "pending");
 
killedBy: Game Events Store canGoToPreviousGameEvent should return false when making game play status is pending.
statusReason: expected true to be falsy

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:15:60
   const gameStore = useGameStore();
 
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
-  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0 && gameStore.makingGamePlayStatus !== "pending");
+  const canGoToPreviousGameEvent = computed<boolean>(() => false);
   const canGoToNextGameEvent = computed<boolean>(() => gameStore.makingGamePlayStatus !== "pending");
 
killedBy: Game Events Store canGoToPreviousGameEvent should return true when can go to previous game event.
statusReason: expected false to be truthy

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:16:56
 
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
   const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0 && gameStore.makingGamePlayStatus !== "pending");
-  const canGoToNextGameEvent = computed<boolean>(() => gameStore.makingGamePlayStatus !== "pending");
+  const canGoToNextGameEvent = computed<boolean>(() => false);
 
   function resetGameEvents(): void {
killedBy: Game Events Store should have initial state when created.
statusReason: expected false to be truthy

[Killed] EqualityOperator
stores/game/game-event/useGameEventsStore.ts:16:56
 
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
   const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0 && gameStore.makingGamePlayStatus !== "pending");
-  const canGoToNextGameEvent = computed<boolean>(() => gameStore.makingGamePlayStatus !== "pending");
+  const canGoToNextGameEvent = computed<boolean>(() => gameStore.makingGamePlayStatus === "pending");
 
   function resetGameEvents(): void {
killedBy: Game Events Store should have initial state when created.
statusReason: expected false to be truthy

[Killed] LogicalOperator
stores/game/game-event/useGameEventsStore.ts:35:9
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     }
-    if (game.phase.tick === 1 && game.phase.name !== "twilight") {
+    if (game.phase.tick === 1 || game.phase.name !== "twilight") {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate game starts and turn …'
statusReason: expected [ _GameEvent{ …(2) }, …(2) ] to strictly equal [ _GameEvent{ …(2) }, …(1) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:35:34
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     }
-    if (game.phase.tick === 1 && game.phase.name !== "twilight") {
+    if (game.phase.tick === 1 && true) {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should turn starts event without game…'
statusReason: expected [ _GameEvent{ …(2) }, …(1) ] to strictly equal [ _GameEvent{ …(2) } ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:38:9
     if (game.phase.tick === 1 && game.phase.name !== "twilight") {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
-    if (game.currentPlay?.action === "bury-dead-bodies") {
+    if (false) {
       gameEvents.value.push(...getDeadPlayerGameEvents(game));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate player dies event whe…'
statusReason: expected [ _GameEvent{ …(2) }, …(1) ] to strictly equal [ _GameEvent{ …(2) }, …(3) ]

[Killed] EqualityOperator
stores/game/game-event/useGameEventsStore.ts:38:9
     if (game.phase.tick === 1 && game.phase.name !== "twilight") {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
-    if (game.currentPlay?.action === "bury-dead-bodies") {
+    if (game.currentPlay?.action !== "bury-dead-bodies") {
       gameEvents.value.push(...getDeadPlayerGameEvents(game));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate turn starts event whe…'
statusReason: expected [ _GameEvent{ …(2) }, …(2) ] to strictly equal [ _GameEvent{ …(2) } ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:44:53
     gameEvents.value.push(GameEvent.create({ type: "game-turn-starts" }));
   }
 
-  async function goToNextGameEvent(): Promise<void> {
-    const { mustCurrentGamePlayBeSkipped } = useCurrentGamePlay(ref(gameStore.game));
-    const nextGameEvent = gameEvents.value[currentGameEventIndex.value + 1];
-    if (gameEvents.value.length > currentGameEventIndex.value + 1 && nextGameEvent.type === "game-turn-starts" && mustCurrentGamePlayBeSkipped.value) {
-      await gameStore.skipGamePlay();
-
-      return;
-    }
-    currentGameEventIndex.value += 1;
-  }
+  async function goToNextGameEvent(): Promise<void> {}
 
   function goToPreviousGameEvent(): void {
killedBy: Game Events Store goToNextGameEvent should go to the next game event when called.
statusReason: expected _GameEvent{ type: 'game-starts', …(1) } to strictly equal _GameEvent{ …(2) }

[Killed] ArithmeticOperator
stores/game/game-event/useGameEventsStore.ts:46:44
 
   async function goToNextGameEvent(): Promise<void> {
     const { mustCurrentGamePlayBeSkipped } = useCurrentGamePlay(ref(gameStore.game));
-    const nextGameEvent = gameEvents.value[currentGameEventIndex.value + 1];
+    const nextGameEvent = gameEvents.value[currentGameEventIndex.value - 1];
     if (gameEvents.value.length > currentGameEventIndex.value + 1 && nextGameEvent.type === "game-turn-starts" && mustCurrentGamePlayBeSkipped.value) {
       await gameStore.skipGamePlay();
killedBy: Game Events Store resetGameEvents should reset game events when called.
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ArithmeticOperator
stores/game/game-event/useGameEventsStore.ts:47:35
   async function goToNextGameEvent(): Promise<void> {
     const { mustCurrentGamePlayBeSkipped } = useCurrentGamePlay(ref(gameStore.game));
     const nextGameEvent = gameEvents.value[currentGameEventIndex.value + 1];
-    if (gameEvents.value.length > currentGameEventIndex.value + 1 && nextGameEvent.type === "game-turn-starts" && mustCurrentGamePlayBeSkipped.value) {
+    if (gameEvents.value.length > currentGameEventIndex.value - 1 && nextGameEvent.type === "game-turn-starts" && mustCurrentGamePlayBeSkipped.value) {
       await gameStore.skipGamePlay();
 
killedBy: Game Events Store goToNextGameEvent should go to the next game event when the next current game event is undefined.
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
stores/game/game-event/useGameEventsStore.ts:47:9
   async function goToNextGameEvent(): Promise<void> {
     const { mustCurrentGamePlayBeSkipped } = useCurrentGamePlay(ref(gameStore.game));
     const nextGameEvent = gameEvents.value[currentGameEventIndex.value + 1];
-    if (gameEvents.value.length > currentGameEventIndex.value + 1 && nextGameEvent.type === "game-turn-starts" && mustCurrentGamePlayBeSkipped.value) {
+    if (gameEvents.value.length > currentGameEventIndex.value + 1 || nextGameEvent.type === "game-turn-starts" && mustCurrentGamePlayBeSkipped.value) {
       await gameStore.skipGamePlay();
 
killedBy: Game Events Store goToNextGameEvent should go to the next game event when the next current game event is undefined.
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] AssignmentOperator
stores/game/game-event/useGameEventsStore.ts:52:5
 
       return;
     }
-    currentGameEventIndex.value += 1;
+    currentGameEventIndex.value -= 1;
   }
 
killedBy: Game Events Store goToNextGameEvent should go to the next game event when called.
statusReason: expected undefined to strictly equal _GameEvent{ …(2) }
