[Killed] BlockStatement
stores/game/useGameStore.ts:66:48
     makingGamePlayStatus.value = "success";
   }
 
-  async function skipGamePlay(): Promise<void> {
-    return makeGamePlay({});
-  }
+  async function skipGamePlay(): Promise<void> {}
   return {
     game,
killedBy: Game Store skipGamePlay should skip game play when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
