[Killed] BlockStatement
GamePlaying/GameEventsMonitor/GameEventsMonitorCurrentEvent/GameEventsMonitorCurrentEvent.vue:35:103
 const gameEventsStore = useGameEventsStore();
 const { currentGameEvent, currentGameEventIndex } = storeToRefs(gameEventsStore);
 
-const currentGameEventTypeComponent = computed<GameEventsMonitorEventTypeComponent | undefined>(() => {
-  const currentGameEventTypeComponents: Record<GameEventType, GameEventsMonitorEventTypeComponent> = {
-    "game-starts": GameStartsEvent,
-    "game-phase-starts": GamePhaseStartsEvent,
-    "game-turn-starts": GameTurnStartsEvent,
-    "player-dies": GamePlayerDiesEvent,
-  };
-  if (!currentGameEvent.value) {
-    return undefined;
-  }
-  return currentGameEventTypeComponents[currentGameEvent.value.type];
-});
+const currentGameEventTypeComponent = computed<GameEventsMonitorEventTypeComponent | undefined>(() => {});
 </script>
killedBy: Game Events Monitor Current Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Events Monitor Current Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
GamePlaying/GameEventsMonitor/GameEventsMonitorCurrentEvent/GameEventsMonitorCurrentEvent.vue:36:102
 const { currentGameEvent, currentGameEventIndex } = storeToRefs(gameEventsStore);
 
 const currentGameEventTypeComponent = computed<GameEventsMonitorEventTypeComponent | undefined>(() => {
-  const currentGameEventTypeComponents: Record<GameEventType, GameEventsMonitorEventTypeComponent> = {
-    "game-starts": GameStartsEvent,
-    "game-phase-starts": GamePhaseStartsEvent,
-    "game-turn-starts": GameTurnStartsEvent,
-    "player-dies": GamePlayerDiesEvent,
-  };
+  const currentGameEventTypeComponents: Record<GameEventType, GameEventsMonitorEventTypeComponent> = {};
   if (!currentGameEvent.value) {
     return undefined;
killedBy: Game Events Monitor Current Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Events Monitor Current Event Component > should match snapshot when rendered. 1` mismatched
