[Killed] BooleanLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:38:49
 
 const { t } = useI18n();
 
-const isPhaseTransitionTriggered = ref<boolean>(false);
+const isPhaseTransitionTriggered = ref<boolean>(true);
 
 const displayedPhase = computed<GamePhaseName>(() => {
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:40:54
 
 const isPhaseTransitionTriggered = ref<boolean>(false);
 
-const displayedPhase = computed<GamePhaseName>(() => {
-  if (isPhaseTransitionTriggered.value) {
-    return game.value.phase.name;
-  }
-  return game.value.phase.name === "day" ? "night" : "day";
-});
+const displayedPhase = computed<GamePhaseName>(() => {});
 
 const displayedPhaseLottieComponent = computed<typeof GameDayPhaseLottie | typeof GameNightPhaseLottie>(() => {
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:41:41
 const isPhaseTransitionTriggered = ref<boolean>(false);
 
 const displayedPhase = computed<GamePhaseName>(() => {
-  if (isPhaseTransitionTriggered.value) {
-    return game.value.phase.name;
-  }
+  if (isPhaseTransitionTriggered.value) {}
   return game.value.phase.name === "day" ? "night" : "day";
 });
killedBy: Game Phase Starts Event Component Phase transition Day to Night Transition should transition to night lottie when new game phase is night.
statusReason: expected false to be truthy

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:41:7
 const isPhaseTransitionTriggered = ref<boolean>(false);
 
 const displayedPhase = computed<GamePhaseName>(() => {
-  if (isPhaseTransitionTriggered.value) {
+  if (false) {
     return game.value.phase.name;
   }
killedBy: Game Phase Starts Event Component Phase transition Day to Night Transition should transition to night lottie when new game phase is night.
statusReason: expected false to be truthy

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:44:10
   if (isPhaseTransitionTriggered.value) {
     return game.value.phase.name;
   }
-  return game.value.phase.name === "day" ? "night" : "day";
+  return true ? "night" : "day";
 });
 
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] EqualityOperator
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:44:10
   if (isPhaseTransitionTriggered.value) {
     return game.value.phase.name;
   }
-  return game.value.phase.name === "day" ? "night" : "day";
+  return game.value.phase.name !== "day" ? "night" : "day";
 });
 
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:47:111
   return game.value.phase.name === "day" ? "night" : "day";
 });
 
-const displayedPhaseLottieComponent = computed<typeof GameDayPhaseLottie | typeof GameNightPhaseLottie>(() => {
-  if (displayedPhase.value === "day") {
-    return GameDayPhaseLottie;
-  }
-  return GameNightPhaseLottie;
-});
+const displayedPhaseLottieComponent = computed<typeof GameDayPhaseLottie | typeof GameNightPhaseLottie>(() => {});
 
 const displayedPhaseLottieSize = computed<string>(() => {
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:48:7
 });
 
 const displayedPhaseLottieComponent = computed<typeof GameDayPhaseLottie | typeof GameNightPhaseLottie>(() => {
-  if (displayedPhase.value === "day") {
+  if (false) {
     return GameDayPhaseLottie;
   }
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:48:39
 });
 
 const displayedPhaseLottieComponent = computed<typeof GameDayPhaseLottie | typeof GameNightPhaseLottie>(() => {
-  if (displayedPhase.value === "day") {
-    return GameDayPhaseLottie;
-  }
+  if (displayedPhase.value === "day") {}
   return GameNightPhaseLottie;
 });
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:54:57
   return GameNightPhaseLottie;
 });
 
-const displayedPhaseLottieSize = computed<string>(() => {
-  if (displayedPhase.value === "day") {
-    return "250px";
-  }
-  return "200px";
-});
+const displayedPhaseLottieSize = computed<string>(() => {});
 
 const gamePhaseStartsEventTexts = computed<string[]>(() => {
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:55:7
 });
 
 const displayedPhaseLottieSize = computed<string>(() => {
-  if (displayedPhase.value === "day") {
+  if (false) {
     return "250px";
   }
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:55:39
 });
 
 const displayedPhaseLottieSize = computed<string>(() => {
-  if (displayedPhase.value === "day") {
-    return "250px";
-  }
+  if (displayedPhase.value === "day") {}
   return "200px";
 });
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for night falling.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for night falling. 1` mismatched

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:58:10
   if (displayedPhase.value === "day") {
     return "250px";
   }
-  return "200px";
+  return "";
 });
 
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for day rising.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for day rising. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:61:60
   return "200px";
 });
 
-const gamePhaseStartsEventTexts = computed<string[]>(() => {
-  if (game.value.phase.name === "day") {
-    return [t("components.GamePhaseStartsEvent.dayRises")];
-  }
-  return [t("components.GamePhaseStartsEvent.nightFalls")];
-});
+const gamePhaseStartsEventTexts = computed<string[]>(() => {});
 
 function triggerPhaseTransition(): void {
killedBy: Game Phase Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:62:7
 });
 
 const gamePhaseStartsEventTexts = computed<string[]>(() => {
-  if (game.value.phase.name === "day") {
+  if (false) {
     return [t("components.GamePhaseStartsEvent.dayRises")];
   }
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for day rising.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for day rising. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:62:40
 });
 
 const gamePhaseStartsEventTexts = computed<string[]>(() => {
-  if (game.value.phase.name === "day") {
-    return [t("components.GamePhaseStartsEvent.dayRises")];
-  }
+  if (game.value.phase.name === "day") {}
   return [t("components.GamePhaseStartsEvent.nightFalls")];
 });
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for day rising.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for day rising. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:63:12
 
 const gamePhaseStartsEventTexts = computed<string[]>(() => {
   if (game.value.phase.name === "day") {
-    return [t("components.GamePhaseStartsEvent.dayRises")];
+    return [];
   }
   return [t("components.GamePhaseStartsEvent.nightFalls")];
killedBy: Game Phase Starts Event Component should match snapshot without shallow rendering when rendered for day rising.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot without shallow rendering when rendered for day rising. 1` mismatched

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:65:13
   if (game.value.phase.name === "day") {
     return [t("components.GamePhaseStartsEvent.dayRises")];
   }
-  return [t("components.GamePhaseStartsEvent.nightFalls")];
+  return [t("")];
 });
 
killedBy: Game Phase Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Phase Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:68:41
   return [t("components.GamePhaseStartsEvent.nightFalls")];
 });
 
-function triggerPhaseTransition(): void {
-  isPhaseTransitionTriggered.value = true;
-}
+function triggerPhaseTransition(): void {}
 
 function triggerPhaseTransitionTimeout(): void {
killedBy: Game Phase Starts Event Component Phase transition Day to Night Transition should transition to night lottie when new game phase is night.
statusReason: expected false to be truthy

[Killed] BooleanLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:69:38
 });
 
 function triggerPhaseTransition(): void {
-  isPhaseTransitionTriggered.value = true;
+  isPhaseTransitionTriggered.value = false;
 }
 
killedBy: Game Phase Starts Event Component Phase transition Day to Night Transition should transition to night lottie when new game phase is night.
statusReason: expected false to be truthy

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePhaseStartsEvent/GamePhaseStartsEvent.vue:72:48
   isPhaseTransitionTriggered.value = true;
 }
 
-function triggerPhaseTransitionTimeout(): void {
-  const timeoutInMs = 1000;
-
-  window.setTimeout(triggerPhaseTransition, timeoutInMs);
-}
+function triggerPhaseTransitionTimeout(): void {}
 
 triggerPhaseTransitionTimeout();
killedBy: Game Phase Starts Event Component Phase transition should set timeout to transition phase when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
