[Killed] ArrowFunction
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:33:51
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const areRolesRevealedOnDeath = computed<boolean>(() => game.value.options.roles.areRevealedOnDeath);
+const areRolesRevealedOnDeath = computed<boolean>(() => undefined);
 
 const deadPlayer = computed<Player | undefined>(() => props.event.players?.[0]);
killedBy: Game Player Dies Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Player Dies Event Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:35:55
 
 const areRolesRevealedOnDeath = computed<boolean>(() => game.value.options.roles.areRevealedOnDeath);
 
-const deadPlayer = computed<Player | undefined>(() => props.event.players?.[0]);
+const deadPlayer = computed<Player | undefined>(() => props.event.players[0]);
 
 const gamePlayerDiesEventTexts = computed<string[]>(() => {
killedBy: Game Player Dies Event Component Player Dies Event Texts should pass can't find dead player texts when there are not players defined in event.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:35:49
 
 const areRolesRevealedOnDeath = computed<boolean>(() => game.value.options.roles.areRevealedOnDeath);
 
-const deadPlayer = computed<Player | undefined>(() => props.event.players?.[0]);
+const deadPlayer = computed<Player | undefined>(() => undefined);
 
 const gamePlayerDiesEventTexts = computed<string[]>(() => {
killedBy: Game Player Dies Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Player Dies Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:37:59
 
 const deadPlayer = computed<Player | undefined>(() => props.event.players?.[0]);
 
-const gamePlayerDiesEventTexts = computed<string[]>(() => {
-  if (!deadPlayer.value) {
-    return [t("components.GamePlayerDiesEvent.cantFindDeadPlayer")];
-  }
-  const roleRevealTKey = areRolesRevealedOnDeath.value ? "components.GamePlayerDiesEvent.playerCanRevealRole" : "components.GamePlayerDiesEvent.playerDoesntRevealRole";
-
-  return [
-    t("components.GamePlayerDiesEvent.playerDies", { playerName: deadPlayer.value.name }),
-    t(roleRevealTKey),
-  ];
-});
+const gamePlayerDiesEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Player Dies Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Player Dies Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:38:26
 const deadPlayer = computed<Player | undefined>(() => props.event.players?.[0]);
 
 const gamePlayerDiesEventTexts = computed<string[]>(() => {
-  if (!deadPlayer.value) {
-    return [t("components.GamePlayerDiesEvent.cantFindDeadPlayer")];
-  }
+  if (!deadPlayer.value) {}
   const roleRevealTKey = areRolesRevealedOnDeath.value ? "components.GamePlayerDiesEvent.playerCanRevealRole" : "components.GamePlayerDiesEvent.playerDoesntRevealRole";
 
killedBy: Game Player Dies Event Component Player Dies Event Texts should pass can't find dead player texts when player is not found in event.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:38:7
 const deadPlayer = computed<Player | undefined>(() => props.event.players?.[0]);
 
 const gamePlayerDiesEventTexts = computed<string[]>(() => {
-  if (!deadPlayer.value) {
+  if (false) {
     return [t("components.GamePlayerDiesEvent.cantFindDeadPlayer")];
   }
killedBy: Game Player Dies Event Component Player Dies Event Texts should pass can't find dead player texts when player is not found in event.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:39:15
 
 const gamePlayerDiesEventTexts = computed<string[]>(() => {
   if (!deadPlayer.value) {
-    return [t("components.GamePlayerDiesEvent.cantFindDeadPlayer")];
+    return [t("")];
   }
   const roleRevealTKey = areRolesRevealedOnDeath.value ? "components.GamePlayerDiesEvent.playerCanRevealRole" : "components.GamePlayerDiesEvent.playerDoesntRevealRole";
killedBy: Game Player Dies Event Component Player Dies Event Texts should pass can't find dead player texts when player is not found in event.
statusReason: expected '' to be 'components.GamePlayerDiesEvent.cantFi…' // Object.is equality

[Killed] ObjectLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GamePlayerDiesEvent/GamePlayerDiesEvent.vue:44:52
   const roleRevealTKey = areRolesRevealedOnDeath.value ? "components.GamePlayerDiesEvent.playerCanRevealRole" : "components.GamePlayerDiesEvent.playerDoesntRevealRole";
 
   return [
-    t("components.GamePlayerDiesEvent.playerDies", { playerName: deadPlayer.value.name }),
+    t("components.GamePlayerDiesEvent.playerDies", {}),
     t(roleRevealTKey),
   ];
killedBy: Game Player Dies Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Player Dies Event Component > should match snapshot when rendered. 1` mismatched
