[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:36:57
   return currentPlay?.action === "elect-sheriff";
 });
 
-const gameCompositionEventText = computed<string>(() => {
-  if (game.value.options.composition.isHidden) {
-    return t("components.GameStartsEvent.compositionIsHidden");
-  }
-  const gameRolesCount = counting(game.value.players, player => player.role.current);
-  const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
-    const roleText = t(`shared.role.name.${role}`, count);
-    const roleCountText = `${count.toString()} ${roleText}`;
-
-    if (currentIndex === 0) {
-      return roleCountText;
-    }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
-      return `${acc} ${t("shared.and")} ${roleCountText}.`;
-    }
-    return `${acc}, ${roleCountText}`;
-  }, "");
-
-  return t("components.GameStartsEvent.gameCompositionEvent", { composition: shuffledPlayersRolesText });
-});
+const gameCompositionEventText = computed<string>(() => {});
 
 const gameStartsEventTexts = computed<string[]>(() => [
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:41:121
     return t("components.GameStartsEvent.compositionIsHidden");
   }
   const gameRolesCount = counting(game.value.players, player => player.role.current);
-  const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
-    const roleText = t(`shared.role.name.${role}`, count);
-    const roleCountText = `${count.toString()} ${roleText}`;
-
-    if (currentIndex === 0) {
-      return roleCountText;
-    }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
-      return `${acc} ${t("shared.and")} ${roleCountText}.`;
-    }
-    return `${acc}, ${roleCountText}`;
-  }, "");
+  const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {}, "");
 
   return t("components.GameStartsEvent.gameCompositionEvent", { composition: shuffledPlayersRolesText });
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:45:29
     const roleText = t(`shared.role.name.${role}`, count);
     const roleCountText = `${count.toString()} ${roleText}`;
 
-    if (currentIndex === 0) {
-      return roleCountText;
-    }
+    if (currentIndex === 0) {}
     if (currentIndex === Object.values(gameRolesCount).length - 1) {
       return `${acc} ${t("shared.and")} ${roleCountText}.`;
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:48:9
     if (currentIndex === 0) {
       return roleCountText;
     }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
+    if (true) {
       return `${acc} ${t("shared.and")} ${roleCountText}.`;
     }
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:48:9
     if (currentIndex === 0) {
       return roleCountText;
     }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
+    if (false) {
       return `${acc} ${t("shared.and")} ${roleCountText}.`;
     }
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:60:5
 const gameStartsEventTexts = computed<string[]>(() => [
   t("components.GameStartsEvent.welcomeToTheVillage"),
   gameCompositionEventText.value,
-  t("components.GameStartsEvent.looksLifeSomeWerewolvesSneakedIntoTheVillage"),
+  t(""),
   t("components.GameStartsEvent.villagersMurderWerewolves"),
   ...insertIf(isSheriffElectedOnFirstTick.value, t("components.GameStartsEvent.letsElectSheriffBefore")),
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched
