[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameAccursedWolfFatherTurnStartsEvent/GameAccursedWolfFatherTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameAccursedWolfFatherTurnStartsEvent.accursedWolfFatherCanInfect")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Accursed Wolf Father Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Accursed Wolf Father Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameAccursedWolfFatherTurnStartsEvent/GameAccursedWolfFatherTurnStartsEvent.vue:16:52
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameAccursedWolfFatherTurnStartsEvent.accursedWolfFatherCanInfect")]);
+const gameEventTexts = computed<string[]>(() => [t("")]);
 </script>
killedBy: Game Accursed Wolf Father Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Accursed Wolf Father Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
