[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameActorTurnStartsEvent/GameActorTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameActorTurnStartsEvent.actorCanChooseCardToPlay")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Actor Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Actor Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameActorTurnStartsEvent/GameActorTurnStartsEvent.vue:16:52
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameActorTurnStartsEvent.actorCanChooseCardToPlay")]);
+const gameEventTexts = computed<string[]>(() => [t("")]);
 </script>
killedBy: Game Actor Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Actor Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
