[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameBearTamerTurnStartsEvent/GameBearTamerTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameBearTamerTurnStartsEvent.bearTamerGrowls")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Bear Tamer Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Bear Tamer Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameBearTamerTurnStartsEvent/GameBearTamerTurnStartsEvent.vue:16:52
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameBearTamerTurnStartsEvent.bearTamerGrowls")]);
+const gameEventTexts = computed<string[]>(() => [t("")]);
 </script>
killedBy: Game Bear Tamer Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Bear Tamer Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
