[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameBigBadWolfTurnStartsEvent/GameBigBadWolfTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameBigBadWolfTurnStartsEvent.bigBadWolfEatsVillager")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Big Bad Wolf Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Big Bad Wolf Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameBigBadWolfTurnStartsEvent/GameBigBadWolfTurnStartsEvent.vue:16:52
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameBigBadWolfTurnStartsEvent.bigBadWolfEatsVillager")]);
+const gameEventTexts = computed<string[]>(() => [t("")]);
 </script>
killedBy: Game Big Bad Wolf Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Big Bad Wolf Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
