[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameCharmedTurnStartsEvent/GameCharmedTurnStartsEvent.vue:21:40
 
 const { t } = useI18n();
 
-const isFirstNight = computed<boolean>(() => game.value.turn === 1);
+const isFirstNight = computed<boolean>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Charmed Turn Starts Event Component Game Event Texts should pass event texts with first meeting of charmed people text when it's the first turn of the game.
statusReason: expected 'components.GameCharmedTurnStartsEvent…' to be 'components.GameCharmedTurnStartsEvent…' // Object.is equality

[Killed] EqualityOperator
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameCharmedTurnStartsEvent/GameCharmedTurnStartsEvent.vue:21:46
 
 const { t } = useI18n();
 
-const isFirstNight = computed<boolean>(() => game.value.turn === 1);
+const isFirstNight = computed<boolean>(() => game.value.turn !== 1);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Charmed Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Charmed Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameCharmedTurnStartsEvent/GameCharmedTurnStartsEvent.vue:23:49
 
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
-const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
-    return [t("components.GameCharmedTurnStartsEvent.charmedPeopleMeetEachOther")];
-  }
-  return [t("components.GameCharmedTurnStartsEvent.charmedPeopleMeetEachOtherWithOldOnes")];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Charmed Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Charmed Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameCharmedTurnStartsEvent/GameCharmedTurnStartsEvent.vue:24:7
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
+  if (false) {
     return [t("components.GameCharmedTurnStartsEvent.charmedPeopleMeetEachOther")];
   }
killedBy: Game Charmed Turn Starts Event Component Game Event Texts should pass event texts with first meeting of charmed people text when it's the first turn of the game.
statusReason: expected 'components.GameCharmedTurnStartsEvent…' to be 'components.GameCharmedTurnStartsEvent…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameCharmedTurnStartsEvent/GameCharmedTurnStartsEvent.vue:24:27
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
-    return [t("components.GameCharmedTurnStartsEvent.charmedPeopleMeetEachOther")];
-  }
+  if (isFirstNight.value) {}
   return [t("components.GameCharmedTurnStartsEvent.charmedPeopleMeetEachOtherWithOldOnes")];
 });
killedBy: Game Charmed Turn Starts Event Component Game Event Texts should pass event texts with first meeting of charmed people text when it's the first turn of the game.
statusReason: expected 'components.GameCharmedTurnStartsEvent…' to be 'components.GameCharmedTurnStartsEvent…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameCharmedTurnStartsEvent/GameCharmedTurnStartsEvent.vue:27:13
   if (isFirstNight.value) {
     return [t("components.GameCharmedTurnStartsEvent.charmedPeopleMeetEachOther")];
   }
-  return [t("components.GameCharmedTurnStartsEvent.charmedPeopleMeetEachOtherWithOldOnes")];
+  return [t("")];
 });
 </script>
killedBy: Game Charmed Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Charmed Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
