[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameCupidTurnStartsEvent/GameCupidTurnStartsEvent.vue:24:49
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => {
-  const { mustWinWithLovers: mustCupidWinWithLovers } = game.value.options.roles.cupid;
-
-  return [
-    t("components.GameCupidTurnStartsEvent.cupidChoosesTwoPlayersToBeLovers"),
-    ...insertIf(mustCupidWinWithLovers, t("components.GameCupidTurnStartsEvent.cupidMustWinWithLovers")),
-  ];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Cupid Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Cupid Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
