[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameDefenderTurnStartsEvent/GameDefenderTurnStartsEvent.vue:21:52
 
 const { t } = useI18n();
 
-const canDefenderProtectAnyone = computed<boolean>(() => game.value.turn === 1 || game.value.options.roles.defender.canProtectTwice);
+const canDefenderProtectAnyone = computed<boolean>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Defender Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Defender Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameDefenderTurnStartsEvent/GameDefenderTurnStartsEvent.vue:21:58
 
 const { t } = useI18n();
 
-const canDefenderProtectAnyone = computed<boolean>(() => game.value.turn === 1 || game.value.options.roles.defender.canProtectTwice);
+const canDefenderProtectAnyone = computed<boolean>(() => game.value.turn !== 1 || game.value.options.roles.defender.canProtectTwice);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Defender Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Defender Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameDefenderTurnStartsEvent/GameDefenderTurnStartsEvent.vue:23:49
 
 const canDefenderProtectAnyone = computed<boolean>(() => game.value.turn === 1 || game.value.options.roles.defender.canProtectTwice);
 
-const gameEventTexts = computed<string[]>(() => {
-  if (canDefenderProtectAnyone.value) {
-    return [t("components.GameDefenderTurnStartsEvent.defenderProtectsAnyone")];
-  }
-  return [t("components.GameDefenderTurnStartsEvent.defenderProtectsAnyoneExceptLastProtectedPlayer")];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Defender Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Defender Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameDefenderTurnStartsEvent/GameDefenderTurnStartsEvent.vue:24:7
 const canDefenderProtectAnyone = computed<boolean>(() => game.value.turn === 1 || game.value.options.roles.defender.canProtectTwice);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (canDefenderProtectAnyone.value) {
+  if (false) {
     return [t("components.GameDefenderTurnStartsEvent.defenderProtectsAnyone")];
   }
killedBy: Game Defender Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Defender Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameDefenderTurnStartsEvent/GameDefenderTurnStartsEvent.vue:24:7
 const canDefenderProtectAnyone = computed<boolean>(() => game.value.turn === 1 || game.value.options.roles.defender.canProtectTwice);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (canDefenderProtectAnyone.value) {
+  if (true) {
     return [t("components.GameDefenderTurnStartsEvent.defenderProtectsAnyone")];
   }
killedBy: Game Defender Turn Starts Event Component Game Event Texts should pass event texts with defender can protect anyone but the last protected player text when it's second turn.
statusReason: expected 'components.GameDefenderTurnStartsEven…' to be 'components.GameDefenderTurnStartsEven…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameDefenderTurnStartsEvent/GameDefenderTurnStartsEvent.vue:25:12
 
 const gameEventTexts = computed<string[]>(() => {
   if (canDefenderProtectAnyone.value) {
-    return [t("components.GameDefenderTurnStartsEvent.defenderProtectsAnyone")];
+    return [];
   }
   return [t("components.GameDefenderTurnStartsEvent.defenderProtectsAnyoneExceptLastProtectedPlayer")];
killedBy: Game Defender Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Defender Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
