[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameFoxTurnStartsEvent/GameFoxTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameFoxTurnStartsEvent.foxSniffesGroupOfPlayers")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Fox Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Fox Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameFoxTurnStartsEvent/GameFoxTurnStartsEvent.vue:16:49
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameFoxTurnStartsEvent.foxSniffesGroupOfPlayers")]);
+const gameEventTexts = computed<string[]>(() => []);
 </script>
killedBy: Game Fox Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Fox Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
