[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameHunterTurnStartsEvent/GameHunterTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameHunterTurnStartsEvent.hunterShootsAtPlayer")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Hunter Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Hunter Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameHunterTurnStartsEvent/GameHunterTurnStartsEvent.vue:16:52
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameHunterTurnStartsEvent.hunterShootsAtPlayer")]);
+const gameEventTexts = computed<string[]>(() => [t("")]);
 </script>
killedBy: Game Hunter Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Hunter Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
