[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameLoversTurnStartsEvent/GameLoversTurnStartsEvent.vue:24:56
 
 const { t } = useI18n();
 
-const doLoversRevealEachOtherRoles = computed<boolean>(() => game.value.options.roles.cupid.lovers.doRevealRoleToEachOther);
+const doLoversRevealEachOtherRoles = computed<boolean>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => [
killedBy: Game Lovers Turn Starts Event Component Game Event Texts should pass event texts with lovers reveal each other roles when option is activated.
statusReason: expected 'components.GameLoversTurnStartsEvent.…' to be 'components.GameLoversTurnStartsEvent.…' // Object.is equality

[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameLoversTurnStartsEvent/GameLoversTurnStartsEvent.vue:26:43
 
 const doLoversRevealEachOtherRoles = computed<boolean>(() => game.value.options.roles.cupid.lovers.doRevealRoleToEachOther);
 
-const gameEventTexts = computed<string[]>(() => [
-  t("components.GameLoversTurnStartsEvent.loversMeetEachOther"),
-  t("components.GameLoversTurnStartsEvent.ifOneLoveDiesOtherDiesToo"),
-  ...insertIf(doLoversRevealEachOtherRoles.value, t("components.GameLoversTurnStartsEvent.loversRevealEachOtherRoles")),
-]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Lovers Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Lovers Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
