[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GamePiedPiperTurnStartsEvent/GamePiedPiperTurnStartsEvent.vue:21:62
 
 const { t } = useI18n();
 
-const piedPiperCharmedPeopleCountPerNight = computed<number>(() => game.value.options.roles.piedPiper.charmedPeopleCountPerNight);
+const piedPiperCharmedPeopleCountPerNight = computed<number>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Pied Piper Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Pied Piper Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GamePiedPiperTurnStartsEvent/GamePiedPiperTurnStartsEvent.vue:23:49
 
 const piedPiperCharmedPeopleCountPerNight = computed<number>(() => game.value.options.roles.piedPiper.charmedPeopleCountPerNight);
 
-const gameEventTexts = computed<string[]>(() => {
-  const tComponentKey = "GamePiedPiperTurnStartsEvent";
-
-  return [t(`components.${tComponentKey}.piedPiperCharmsPeople`, { count: piedPiperCharmedPeopleCountPerNight.value }, piedPiperCharmedPeopleCountPerNight.value)];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Pied Piper Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Pied Piper Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GamePiedPiperTurnStartsEvent/GamePiedPiperTurnStartsEvent.vue:24:25
 const piedPiperCharmedPeopleCountPerNight = computed<number>(() => game.value.options.roles.piedPiper.charmedPeopleCountPerNight);
 
 const gameEventTexts = computed<string[]>(() => {
-  const tComponentKey = "GamePiedPiperTurnStartsEvent";
+  const tComponentKey = "";
 
   return [t(`components.${tComponentKey}.piedPiperCharmsPeople`, { count: piedPiperCharmedPeopleCountPerNight.value }, piedPiperCharmedPeopleCountPerNight.value)];
killedBy: Game Pied Piper Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Pied Piper Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GamePiedPiperTurnStartsEvent/GamePiedPiperTurnStartsEvent.vue:26:10
 const gameEventTexts = computed<string[]>(() => {
   const tComponentKey = "GamePiedPiperTurnStartsEvent";
 
-  return [t(`components.${tComponentKey}.piedPiperCharmsPeople`, { count: piedPiperCharmedPeopleCountPerNight.value }, piedPiperCharmedPeopleCountPerNight.value)];
+  return [];
 });
 </script>
killedBy: Game Pied Piper Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Pied Piper Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GamePiedPiperTurnStartsEvent/GamePiedPiperTurnStartsEvent.vue:26:13
 const gameEventTexts = computed<string[]>(() => {
   const tComponentKey = "GamePiedPiperTurnStartsEvent";
 
-  return [t(`components.${tComponentKey}.piedPiperCharmsPeople`, { count: piedPiperCharmedPeopleCountPerNight.value }, piedPiperCharmedPeopleCountPerNight.value)];
+  return [t(``, { count: piedPiperCharmedPeopleCountPerNight.value }, piedPiperCharmedPeopleCountPerNight.value)];
 });
 </script>
killedBy: Game Pied Piper Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Pied Piper Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
