[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameScandalmongerTurnStartsEvent/GameScandalmongerTurnStartsEvent.vue:21:51
 
 const { t } = useI18n();
 
-const scandalmongerMarkPenalty = computed<number>(() => game.value.options.roles.scandalmonger.markPenalty);
+const scandalmongerMarkPenalty = computed<number>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Scandalmonger Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Scandalmonger Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameScandalmongerTurnStartsEvent/GameScandalmongerTurnStartsEvent.vue:23:49
 
 const scandalmongerMarkPenalty = computed<number>(() => game.value.options.roles.scandalmonger.markPenalty);
 
-const gameEventTexts = computed<string[]>(() => {
-  const tComponentKey = "GameScandalmongerTurnStartsEvent";
-
-  return [
-    t(`components.${tComponentKey}.scandalmongerCanMarkPlayer`),
-    t(`components.${tComponentKey}.playerWillHavePenaltyForNextVotes`, { penalty: scandalmongerMarkPenalty.value }, scandalmongerMarkPenalty.value),
-  ];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Scandalmonger Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Scandalmonger Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameScandalmongerTurnStartsEvent/GameScandalmongerTurnStartsEvent.vue:24:25
 const scandalmongerMarkPenalty = computed<number>(() => game.value.options.roles.scandalmonger.markPenalty);
 
 const gameEventTexts = computed<string[]>(() => {
-  const tComponentKey = "GameScandalmongerTurnStartsEvent";
+  const tComponentKey = "";
 
   return [
killedBy: Game Scandalmonger Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Scandalmonger Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
