[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameScapegoatTurnStartsEvent/GameScapegoatTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameScapegoatTurnStartsEvent.scapegoatCanBanPlayerFromVoting")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Scapegoat Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Scapegoat Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameScapegoatTurnStartsEvent/GameScapegoatTurnStartsEvent.vue:16:52
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameScapegoatTurnStartsEvent.scapegoatCanBanPlayerFromVoting")]);
+const gameEventTexts = computed<string[]>(() => [t("")]);
 </script>
killedBy: Game Scapegoat Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Scapegoat Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
