[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSeerTurnStartsEvent/GameSeerTurnStartsEvent.vue:21:43
 
 const { t } = useI18n();
 
-const canSeerSeeRoles = computed<boolean>(() => game.value.options.roles.seer.canSeeRoles);
+const canSeerSeeRoles = computed<boolean>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Seer Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Seer Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSeerTurnStartsEvent/GameSeerTurnStartsEvent.vue:23:49
 
 const canSeerSeeRoles = computed<boolean>(() => game.value.options.roles.seer.canSeeRoles);
 
-const gameEventTexts = computed<string[]>(() => {
-  if (canSeerSeeRoles.value) {
-    return [t("components.GameSeerTurnStartsEvent.seerSeesRoles")];
-  }
-  return [t("components.GameSeerTurnStartsEvent.seerSeesSides")];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Seer Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Seer Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSeerTurnStartsEvent/GameSeerTurnStartsEvent.vue:24:7
 const canSeerSeeRoles = computed<boolean>(() => game.value.options.roles.seer.canSeeRoles);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (canSeerSeeRoles.value) {
+  if (false) {
     return [t("components.GameSeerTurnStartsEvent.seerSeesRoles")];
   }
killedBy: Game Seer Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Seer Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSeerTurnStartsEvent/GameSeerTurnStartsEvent.vue:24:7
 const canSeerSeeRoles = computed<boolean>(() => game.value.options.roles.seer.canSeeRoles);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (canSeerSeeRoles.value) {
+  if (true) {
     return [t("components.GameSeerTurnStartsEvent.seerSeesRoles")];
   }
killedBy: Game Seer Turn Starts Event Component Game Event Texts should pass event texts with seer can see side of the player when the option is activated.
statusReason: expected 'components.GameSeerTurnStartsEvent.se…' to be 'components.GameSeerTurnStartsEvent.se…' // Object.is equality
