[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:25:49
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 const { t } = useI18n();
 
-const playersInTieText = computed<string>(() => {
-  const playersInTie = getEligibleTargetsWithInteractionInCurrentGamePlay("sentence-to-death");
-
-  return getPlayersNamesText(playersInTie);
-});
+const playersInTieText = computed<string>(() => {});
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Sheriff Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Sheriff Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:31:49
   return getPlayersNamesText(playersInTie);
 });
 
-const gameEventTexts = computed<string[]>(() => {
-  if (game.value.currentPlay === null) {
-    return [];
-  }
-  if (game.value.currentPlay.action === "delegate") {
-    return [t("components.GameSheriffTurnStartsEvent.sheriffDelegates")];
-  }
-  return [t("components.GameSheriffTurnStartsEvent.sheriffSettlesVotes", { players: playersInTieText.value })];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Sheriff Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Sheriff Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:32:40
 });
 
 const gameEventTexts = computed<string[]>(() => {
-  if (game.value.currentPlay === null) {
-    return [];
-  }
+  if (game.value.currentPlay === null) {}
   if (game.value.currentPlay.action === "delegate") {
     return [t("components.GameSheriffTurnStartsEvent.sheriffDelegates")];
killedBy: Game Sheriff Turn Starts Event Component Game Event Texts should not pass any event texts when current play is null.
statusReason: Cannot read properties of null (reading 'action')

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:32:7
 });
 
 const gameEventTexts = computed<string[]>(() => {
-  if (game.value.currentPlay === null) {
+  if (true) {
     return [];
   }
killedBy: Game Sheriff Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Sheriff Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:35:7
   if (game.value.currentPlay === null) {
     return [];
   }
-  if (game.value.currentPlay.action === "delegate") {
+  if (false) {
     return [t("components.GameSheriffTurnStartsEvent.sheriffDelegates")];
   }
killedBy: Game Sheriff Turn Starts Event Component Game Event Texts should pass event texts when current play is delegate sheriff role.
statusReason: expected 'components.GameSheriffTurnStartsEvent…' to be 'components.GameSheriffTurnStartsEvent…' // Object.is equality

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:35:7
   if (game.value.currentPlay === null) {
     return [];
   }
-  if (game.value.currentPlay.action === "delegate") {
+  if (true) {
     return [t("components.GameSheriffTurnStartsEvent.sheriffDelegates")];
   }
killedBy: Game Sheriff Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Sheriff Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:36:12
     return [];
   }
   if (game.value.currentPlay.action === "delegate") {
-    return [t("components.GameSheriffTurnStartsEvent.sheriffDelegates")];
+    return [];
   }
   return [t("components.GameSheriffTurnStartsEvent.sheriffSettlesVotes", { players: playersInTieText.value })];
killedBy: Game Sheriff Turn Starts Event Component Game Event Texts should pass event texts when current play is delegate sheriff role.
statusReason: expected '' to be 'components.GameSheriffTurnStartsEvent…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSheriffTurnStartsEvent/GameSheriffTurnStartsEvent.vue:38:10
   if (game.value.currentPlay.action === "delegate") {
     return [t("components.GameSheriffTurnStartsEvent.sheriffDelegates")];
   }
-  return [t("components.GameSheriffTurnStartsEvent.sheriffSettlesVotes", { players: playersInTieText.value })];
+  return [];
 });
 </script>
killedBy: Game Sheriff Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Sheriff Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
