[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameStutteringJudgeTurnStartsEvent/GameStutteringJudgeTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [
-  t("components.GameStutteringJudgeTurnStartsEvent.stutteringJudgeCanRequestAnotherVote"),
-  t("components.GameStutteringJudgeTurnStartsEvent.everyonePutHandsInBackAndGameMasterWillRecognizeSign"),
-]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Stuttering Judge Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Stuttering Judge Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameStutteringJudgeTurnStartsEvent/GameStutteringJudgeTurnStartsEvent.vue:17:5
 const { t } = useI18n();
 
 const gameEventTexts = computed<string[]>(() => [
-  t("components.GameStutteringJudgeTurnStartsEvent.stutteringJudgeCanRequestAnotherVote"),
+  t(""),
   t("components.GameStutteringJudgeTurnStartsEvent.everyonePutHandsInBackAndGameMasterWillRecognizeSign"),
 ]);
killedBy: Game Stuttering Judge Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Stuttering Judge Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
