[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:28:49
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => {
-  const { currentPlay } = game.value;
-  if (currentPlay === null) {
-    return [];
-  }
-  const currentPlayActionTextMethods: Partial<Record<GamePlayAction, (play: GamePlay) => string[]>> = {
-    "elect-sheriff": getGameEventTextsForElectingSheriff,
-    "vote": getGameEventTextsForVoting,
-    "bury-dead-bodies": getGameEventTextsForBuryingDeadBodies,
-  };
-
-  return currentPlayActionTextMethods[currentPlay.action]?.(currentPlay) ?? [];
-});
+const gameEventTexts = computed<string[]>(() => {});
 
 function getGameEventTextsForElectingSheriff(): string[] {
killedBy: Game Survivors Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Survivors Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:30:29
 
 const gameEventTexts = computed<string[]>(() => {
   const { currentPlay } = game.value;
-  if (currentPlay === null) {
-    return [];
-  }
+  if (currentPlay === null) {}
   const currentPlayActionTextMethods: Partial<Record<GamePlayAction, (play: GamePlay) => string[]>> = {
     "elect-sheriff": getGameEventTextsForElectingSheriff,
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should not display any texts when the…'
statusReason: Cannot read properties of null (reading 'action')

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:30:7
 
 const gameEventTexts = computed<string[]>(() => {
   const { currentPlay } = game.value;
-  if (currentPlay === null) {
+  if (false) {
     return [];
   }
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should not display any texts when the…'
statusReason: Cannot read properties of null (reading 'action')

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:31:12
 const gameEventTexts = computed<string[]>(() => {
   const { currentPlay } = game.value;
   if (currentPlay === null) {
-    return [];
+    return ["Stryker was here"];
   }
   const currentPlayActionTextMethods: Partial<Record<GamePlayAction, (play: GamePlay) => string[]>> = {
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should not display any texts when the…'
statusReason: expected 'Stryker was here' to be '' // Object.is equality

[Killed] ObjectLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:33:103
   if (currentPlay === null) {
     return [];
   }
-  const currentPlayActionTextMethods: Partial<Record<GamePlayAction, (play: GamePlay) => string[]>> = {
-    "elect-sheriff": getGameEventTextsForElectingSheriff,
-    "vote": getGameEventTextsForVoting,
-    "bury-dead-bodies": getGameEventTextsForBuryingDeadBodies,
-  };
+  const currentPlayActionTextMethods: Partial<Record<GamePlayAction, (play: GamePlay) => string[]>> = {};
 
   return currentPlayActionTextMethods[currentPlay.action]?.(currentPlay) ?? [];
killedBy: Game Survivors Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Survivors Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:39:10
     "bury-dead-bodies": getGameEventTextsForBuryingDeadBodies,
   };
 
-  return currentPlayActionTextMethods[currentPlay.action]?.(currentPlay) ?? [];
+  return currentPlayActionTextMethods[currentPlay.action](currentPlay) ?? [];
 });
 
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should not display any texts when the…'
statusReason: currentPlayActionTextMethods[currentPlay.action] is not a function

[Killed] LogicalOperator
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:39:10
     "bury-dead-bodies": getGameEventTextsForBuryingDeadBodies,
   };
 
-  return currentPlayActionTextMethods[currentPlay.action]?.(currentPlay) ?? [];
+  return currentPlayActionTextMethods[currentPlay.action]?.(currentPlay) && [];
 });
 
killedBy: Game Survivors Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Survivors Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:42:58
   return currentPlayActionTextMethods[currentPlay.action]?.(currentPlay) ?? [];
 });
 
-function getGameEventTextsForElectingSheriff(): string[] {
-  return [t("components.GameSurvivorsTurnStartsEvent.survivorsElectSheriff")];
-}
+function getGameEventTextsForElectingSheriff(): string[] {}
 
 function getGameEventTextsForVotingWithCause(cause: GamePlayCause): string[] {
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display sheriff election texts…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:43:13
 });
 
 function getGameEventTextsForElectingSheriff(): string[] {
-  return [t("components.GameSurvivorsTurnStartsEvent.survivorsElectSheriff")];
+  return [t("")];
 }
 
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display sheriff election texts…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:46:78
   return [t("components.GameSurvivorsTurnStartsEvent.survivorsElectSheriff")];
 }
 
-function getGameEventTextsForVotingWithCause(cause: GamePlayCause): string[] {
-  const eligiblePlayersInTie = getEligibleTargetsWithInteractionInCurrentGamePlay("vote");
-  const votingCauseTexts: Record<GamePlayCause, string[]> = {
-    "angel-presence": [
-      t("components.GameSurvivorsTurnStartsEvent.gameStartsWithVoteBecauseOfAngelPresence"),
-      t("components.GameSurvivorsTurnStartsEvent.watchOutForAngelOrHeWins"),
-    ],
-    "stuttering-judge-request": [t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfStutteringJudge")],
-    "previous-votes-were-in-ties": [
-      t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfPreviousTies"),
-      t("components.GameSurvivorsTurnStartsEvent.survivorsMustVoteBetween", { players: getPlayersNamesText(eligiblePlayersInTie) }),
-    ],
-  };
-
-  return votingCauseTexts[cause];
-}
+function getGameEventTextsForVotingWithCause(cause: GamePlayCause): string[] {}
 
 function getGameEventTextsForVoting(currentPlay: GamePlay): string[] {
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for angel…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:47:83
 }
 
 function getGameEventTextsForVotingWithCause(cause: GamePlayCause): string[] {
-  const eligiblePlayersInTie = getEligibleTargetsWithInteractionInCurrentGamePlay("vote");
+  const eligiblePlayersInTie = getEligibleTargetsWithInteractionInCurrentGamePlay("");
   const votingCauseTexts: Record<GamePlayCause, string[]> = {
     "angel-presence": [
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for sheri…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] ObjectLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:48:61
 
 function getGameEventTextsForVotingWithCause(cause: GamePlayCause): string[] {
   const eligiblePlayersInTie = getEligibleTargetsWithInteractionInCurrentGamePlay("vote");
-  const votingCauseTexts: Record<GamePlayCause, string[]> = {
-    "angel-presence": [
-      t("components.GameSurvivorsTurnStartsEvent.gameStartsWithVoteBecauseOfAngelPresence"),
-      t("components.GameSurvivorsTurnStartsEvent.watchOutForAngelOrHeWins"),
-    ],
-    "stuttering-judge-request": [t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfStutteringJudge")],
-    "previous-votes-were-in-ties": [
-      t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfPreviousTies"),
-      t("components.GameSurvivorsTurnStartsEvent.survivorsMustVoteBetween", { players: getPlayersNamesText(eligiblePlayersInTie) }),
-    ],
-  };
+  const votingCauseTexts: Record<GamePlayCause, string[]> = {};
 
   return votingCauseTexts[cause];
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for angel…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:51:9
   const votingCauseTexts: Record<GamePlayCause, string[]> = {
     "angel-presence": [
       t("components.GameSurvivorsTurnStartsEvent.gameStartsWithVoteBecauseOfAngelPresence"),
-      t("components.GameSurvivorsTurnStartsEvent.watchOutForAngelOrHeWins"),
+      t(""),
     ],
     "stuttering-judge-request": [t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfStutteringJudge")],
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for angel…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:53:33
       t("components.GameSurvivorsTurnStartsEvent.gameStartsWithVoteBecauseOfAngelPresence"),
       t("components.GameSurvivorsTurnStartsEvent.watchOutForAngelOrHeWins"),
     ],
-    "stuttering-judge-request": [t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfStutteringJudge")],
+    "stuttering-judge-request": [],
     "previous-votes-were-in-ties": [
       t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfPreviousTies"),
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for stutt…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:53:36
       t("components.GameSurvivorsTurnStartsEvent.gameStartsWithVoteBecauseOfAngelPresence"),
       t("components.GameSurvivorsTurnStartsEvent.watchOutForAngelOrHeWins"),
     ],
-    "stuttering-judge-request": [t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfStutteringJudge")],
+    "stuttering-judge-request": [t("")],
     "previous-votes-were-in-ties": [
       t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfPreviousTies"),
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for stutt…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:54:36
       t("components.GameSurvivorsTurnStartsEvent.watchOutForAngelOrHeWins"),
     ],
     "stuttering-judge-request": [t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfStutteringJudge")],
-    "previous-votes-were-in-ties": [
-      t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfPreviousTies"),
-      t("components.GameSurvivorsTurnStartsEvent.survivorsMustVoteBetween", { players: getPlayersNamesText(eligiblePlayersInTie) }),
-    ],
+    "previous-votes-were-in-ties": [],
   };
 
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for sheri…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:56:9
     "stuttering-judge-request": [t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfStutteringJudge")],
     "previous-votes-were-in-ties": [
       t("components.GameSurvivorsTurnStartsEvent.voteBecauseOfPreviousTies"),
-      t("components.GameSurvivorsTurnStartsEvent.survivorsMustVoteBetween", { players: getPlayersNamesText(eligiblePlayersInTie) }),
+      t("", { players: getPlayersNamesText(eligiblePlayersInTie) }),
     ],
   };
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for sheri…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:63:70
   return votingCauseTexts[cause];
 }
 
-function getGameEventTextsForVoting(currentPlay: GamePlay): string[] {
-  if (currentPlay.cause === undefined) {
-    return [t("components.GameSurvivorsTurnStartsEvent.survivorsVote")];
-  }
-  return getGameEventTextsForVotingWithCause(currentPlay.cause);
-}
+function getGameEventTextsForVoting(currentPlay: GamePlay): string[] {}
 
 function getGameEventTextsForBuryingDeadBodies(): string[] {
killedBy: Game Survivors Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Survivors Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:64:7
 }
 
 function getGameEventTextsForVoting(currentPlay: GamePlay): string[] {
-  if (currentPlay.cause === undefined) {
+  if (true) {
     return [t("components.GameSurvivorsTurnStartsEvent.survivorsVote")];
   }
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for angel…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] EqualityOperator
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:64:7
 }
 
 function getGameEventTextsForVoting(currentPlay: GamePlay): string[] {
-  if (currentPlay.cause === undefined) {
+  if (currentPlay.cause !== undefined) {
     return [t("components.GameSurvivorsTurnStartsEvent.survivorsVote")];
   }
killedBy: Game Survivors Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Survivors Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:70:60
   return getGameEventTextsForVotingWithCause(currentPlay.cause);
 }
 
-function getGameEventTextsForBuryingDeadBodies(): string[] {
-  return [t("components.GameSurvivorsTurnStartsEvent.survivorsBuryDeadBodies")];
-}
+function getGameEventTextsForBuryingDeadBodies(): string[] {}
 </script>
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display bury dead bodies texts…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:71:13
 }
 
 function getGameEventTextsForBuryingDeadBodies(): string[] {
-  return [t("components.GameSurvivorsTurnStartsEvent.survivorsBuryDeadBodies")];
+  return [t("")];
 }
 </script>
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display bury dead bodies texts…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameSurvivorsTurnStartsEvent/GameSurvivorsTurnStartsEvent.vue:71:10
 }
 
 function getGameEventTextsForBuryingDeadBodies(): string[] {
-  return [t("components.GameSurvivorsTurnStartsEvent.survivorsBuryDeadBodies")];
+  return [];
 }
 </script>
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display bury dead bodies texts…'
statusReason: expected '' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality
