[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThiefTurnStartsEvent/GameThiefTurnStartsEvent.vue:21:52
 
 const { t } = useI18n();
 
-const thiefAdditionalCardsCount = computed<number>(() => game.value.options.roles.thief.additionalCardsCount);
+const thiefAdditionalCardsCount = computed<number>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Thief Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Thief Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThiefTurnStartsEvent/GameThiefTurnStartsEvent.vue:23:49
 
 const thiefAdditionalCardsCount = computed<number>(() => game.value.options.roles.thief.additionalCardsCount);
 
-const gameEventTexts = computed<string[]>(() => {
-  const tComponentKey = "GameThiefTurnStartsEvent";
-
-  return [
-    t(`components.${tComponentKey}.thiefCanStealCard`, { count: thiefAdditionalCardsCount.value }, thiefAdditionalCardsCount.value),
-    t(`components.${tComponentKey}.gameMasterWillFlipThiefCards`, { count: thiefAdditionalCardsCount.value }, thiefAdditionalCardsCount.value),
-  ];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Thief Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Thief Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThiefTurnStartsEvent/GameThiefTurnStartsEvent.vue:26:10
 const gameEventTexts = computed<string[]>(() => {
   const tComponentKey = "GameThiefTurnStartsEvent";
 
-  return [
-    t(`components.${tComponentKey}.thiefCanStealCard`, { count: thiefAdditionalCardsCount.value }, thiefAdditionalCardsCount.value),
-    t(`components.${tComponentKey}.gameMasterWillFlipThiefCards`, { count: thiefAdditionalCardsCount.value }, thiefAdditionalCardsCount.value),
-  ];
+  return [];
 });
 </script>
killedBy: Game Thief Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Thief Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThiefTurnStartsEvent/GameThiefTurnStartsEvent.vue:27:56
   const tComponentKey = "GameThiefTurnStartsEvent";
 
   return [
-    t(`components.${tComponentKey}.thiefCanStealCard`, { count: thiefAdditionalCardsCount.value }, thiefAdditionalCardsCount.value),
+    t(`components.${tComponentKey}.thiefCanStealCard`, {}, thiefAdditionalCardsCount.value),
     t(`components.${tComponentKey}.gameMasterWillFlipThiefCards`, { count: thiefAdditionalCardsCount.value }, thiefAdditionalCardsCount.value),
   ];
killedBy: Game Thief Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Thief Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
