[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThreeBrothersTurnStartsEvent/GameThreeBrothersTurnStartsEvent.vue:21:46
 
 const { t } = useI18n();
 
-const isFirstNight = computed<boolean>(() => game.value.turn === 1);
+const isFirstNight = computed<boolean>(() => false);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Three Brothers Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Three Brothers Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThreeBrothersTurnStartsEvent/GameThreeBrothersTurnStartsEvent.vue:23:49
 
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
-const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
-    return [t("components.GameThreeBrothersTurnStartsEvent.threeBrothersMeetEachOtherForFirstTime")];
-  }
-  return [t("components.GameThreeBrothersTurnStartsEvent.threeBrothersMeetEachOther")];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Three Brothers Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Three Brothers Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThreeBrothersTurnStartsEvent/GameThreeBrothersTurnStartsEvent.vue:24:27
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
-    return [t("components.GameThreeBrothersTurnStartsEvent.threeBrothersMeetEachOtherForFirstTime")];
-  }
+  if (isFirstNight.value) {}
   return [t("components.GameThreeBrothersTurnStartsEvent.threeBrothersMeetEachOther")];
 });
killedBy: Game Three Brothers Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Three Brothers Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameThreeBrothersTurnStartsEvent/GameThreeBrothersTurnStartsEvent.vue:25:15
 
 const gameEventTexts = computed<string[]>(() => {
   if (isFirstNight.value) {
-    return [t("components.GameThreeBrothersTurnStartsEvent.threeBrothersMeetEachOtherForFirstTime")];
+    return [t("")];
   }
   return [t("components.GameThreeBrothersTurnStartsEvent.threeBrothersMeetEachOther")];
killedBy: Game Three Brothers Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Three Brothers Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
