[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTurnStartsEvent.vue:25:111
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const gameTurnStartsEventTypeComponentToRender = computed<GameTurnStartsEventTypeComponent | undefined>(() => {
-  const { currentPlay } = game.value;
-
-  return currentPlay?.source ? GAME_PLAY_SOURCE_NAME_TURN_STARTS_EVENT_COMPONENTS[currentPlay.source.name] : undefined;
-});
+const gameTurnStartsEventTypeComponentToRender = computed<GameTurnStartsEventTypeComponent | undefined>(() => {});
 </script>
killedBy: Game Turn Start Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Turn Start Event Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTurnStartsEvent.vue:28:10
 const gameTurnStartsEventTypeComponentToRender = computed<GameTurnStartsEventTypeComponent | undefined>(() => {
   const { currentPlay } = game.value;
 
-  return currentPlay?.source ? GAME_PLAY_SOURCE_NAME_TURN_STARTS_EVENT_COMPONENTS[currentPlay.source.name] : undefined;
+  return currentPlay.source ? GAME_PLAY_SOURCE_NAME_TURN_STARTS_EVENT_COMPONENTS[currentPlay.source.name] : undefined;
 });
 </script>
killedBy: Game Turn Start Event Component Game Turn Starts Event Component type should render unknown game starts event text when the current play is null.
statusReason: Cannot read properties of null (reading 'source')
