[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTwoSistersTurnStartsEvent/GameTwoSistersTurnStartsEvent.vue:21:46
 
 const { t } = useI18n();
 
-const isFirstNight = computed<boolean>(() => game.value.turn === 1);
+const isFirstNight = computed<boolean>(() => true);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Two Sisters Turn Starts Event Component Game Event Texts should pass event texts when it's not the first night.
statusReason: expected 'components.GameTwoSistersTurnStartsEv…' to be 'components.GameTwoSistersTurnStartsEv…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTwoSistersTurnStartsEvent/GameTwoSistersTurnStartsEvent.vue:23:49
 
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
-const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
-    return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOtherForFirstTime")];
-  }
-  return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOther")];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Two Sisters Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Two Sisters Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTwoSistersTurnStartsEvent/GameTwoSistersTurnStartsEvent.vue:24:7
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
+  if (true) {
     return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOtherForFirstTime")];
   }
killedBy: Game Two Sisters Turn Starts Event Component Game Event Texts should pass event texts when it's not the first night.
statusReason: expected 'components.GameTwoSistersTurnStartsEv…' to be 'components.GameTwoSistersTurnStartsEv…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTwoSistersTurnStartsEvent/GameTwoSistersTurnStartsEvent.vue:25:12
 
 const gameEventTexts = computed<string[]>(() => {
   if (isFirstNight.value) {
-    return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOtherForFirstTime")];
+    return [];
   }
   return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOther")];
killedBy: Game Two Sisters Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Two Sisters Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTwoSistersTurnStartsEvent/GameTwoSistersTurnStartsEvent.vue:25:15
 
 const gameEventTexts = computed<string[]>(() => {
   if (isFirstNight.value) {
-    return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOtherForFirstTime")];
+    return [t("")];
   }
   return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOther")];
killedBy: Game Two Sisters Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Two Sisters Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTwoSistersTurnStartsEvent/GameTwoSistersTurnStartsEvent.vue:27:13
   if (isFirstNight.value) {
     return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOtherForFirstTime")];
   }
-  return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOther")];
+  return [t("")];
 });
 </script>
killedBy: Game Two Sisters Turn Starts Event Component Game Event Texts should pass event texts when it's not the first night.
statusReason: expected '' to be 'components.GameTwoSistersTurnStartsEv…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameTwoSistersTurnStartsEvent/GameTwoSistersTurnStartsEvent.vue:27:10
   if (isFirstNight.value) {
     return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOtherForFirstTime")];
   }
-  return [t("components.GameTwoSistersTurnStartsEvent.twoSistersMeetEachOther")];
+  return [];
 });
 </script>
killedBy: Game Two Sisters Turn Starts Event Component Game Event Texts should pass event texts when it's not the first night.
statusReason: expected '' to be 'components.GameTwoSistersTurnStartsEv…' // Object.is equality
