[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWerewolvesTurnStartsEvent/GameWerewolvesTurnStartsEvent.vue:23:49
 
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
-const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
-    return [
-      t("components.GameWerewolvesTurnStartsEvent.werewolvesMeetEachOtherForFirstTime"),
-      t("components.GameWerewolvesTurnStartsEvent.whenMeetOverWerewolvesEat"),
-    ];
-  }
-  return [t("components.GameWerewolvesTurnStartsEvent.werewolvesEat")];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Werewolves Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Werewolves Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWerewolvesTurnStartsEvent/GameWerewolvesTurnStartsEvent.vue:24:27
 const isFirstNight = computed<boolean>(() => game.value.turn === 1);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (isFirstNight.value) {
-    return [
-      t("components.GameWerewolvesTurnStartsEvent.werewolvesMeetEachOtherForFirstTime"),
-      t("components.GameWerewolvesTurnStartsEvent.whenMeetOverWerewolvesEat"),
-    ];
-  }
+  if (isFirstNight.value) {}
   return [t("components.GameWerewolvesTurnStartsEvent.werewolvesEat")];
 });
killedBy: Game Werewolves Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Werewolves Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWerewolvesTurnStartsEvent/GameWerewolvesTurnStartsEvent.vue:25:12
 
 const gameEventTexts = computed<string[]>(() => {
   if (isFirstNight.value) {
-    return [
-      t("components.GameWerewolvesTurnStartsEvent.werewolvesMeetEachOtherForFirstTime"),
-      t("components.GameWerewolvesTurnStartsEvent.whenMeetOverWerewolvesEat"),
-    ];
+    return [];
   }
   return [t("components.GameWerewolvesTurnStartsEvent.werewolvesEat")];
killedBy: Game Werewolves Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Werewolves Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWerewolvesTurnStartsEvent/GameWerewolvesTurnStartsEvent.vue:30:10
       t("components.GameWerewolvesTurnStartsEvent.whenMeetOverWerewolvesEat"),
     ];
   }
-  return [t("components.GameWerewolvesTurnStartsEvent.werewolvesEat")];
+  return [];
 });
 </script>
killedBy: Game Werewolves Turn Starts Event Component Game Event Texts should pass event texts when it's not the first night.
statusReason: expected '' to be 'components.GameWerewolvesTurnStartsEv…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWerewolvesTurnStartsEvent/GameWerewolvesTurnStartsEvent.vue:30:13
       t("components.GameWerewolvesTurnStartsEvent.whenMeetOverWerewolvesEat"),
     ];
   }
-  return [t("components.GameWerewolvesTurnStartsEvent.werewolvesEat")];
+  return [t("")];
 });
 </script>
killedBy: Game Werewolves Turn Starts Event Component Game Event Texts should pass event texts when it's not the first night.
statusReason: expected '' to be 'components.GameWerewolvesTurnStartsEv…' // Object.is equality
