[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWhiteWerewolfTurnStartsEvent/GameWhiteWerewolfTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameWhiteWerewolfTurnStartsEvent.whiteWerewolfCanEatAnotherWolf")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game White Werewolf Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game White Werewolf Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
