[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWildChildTurnStartsEvent/GameWildChildTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [
-  t("components.GameWildChildTurnStartsEvent.wildChildChoosesModel"),
-  t("components.GameWildChildTurnStartsEvent.ifModelDiesWildChildBecomesWolf"),
-]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Wild Child Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Wild Child Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWildChildTurnStartsEvent/GameWildChildTurnStartsEvent.vue:17:5
 const { t } = useI18n();
 
 const gameEventTexts = computed<string[]>(() => [
-  t("components.GameWildChildTurnStartsEvent.wildChildChoosesModel"),
+  t(""),
   t("components.GameWildChildTurnStartsEvent.ifModelDiesWildChildBecomesWolf"),
 ]);
killedBy: Game Wild Child Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Wild Child Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
