[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWitchTurnStartsEvent/GameWitchTurnStartsEvent.vue:16:43
 
 const { t } = useI18n();
 
-const gameEventTexts = computed<string[]>(() => [t("components.GameWitchTurnStartsEvent.witchCanUsePotions")]);
+const gameEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Witch Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Witch Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
