[Killed] ArrowFunction
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWolfHoundTurnStartsEvent/GameWolfHoundTurnStartsEvent.vue:21:57
 
 const { t } = useI18n();
 
-const isWolfHoundSideRandomlyChosen = computed<boolean>(() => game.value.options.roles.wolfHound.isSideRandomlyChosen);
+const isWolfHoundSideRandomlyChosen = computed<boolean>(() => undefined);
 
 const gameEventTexts = computed<string[]>(() => {
killedBy: Game Wolf Hound Turn Starts Event Component Game Event Texts should pass event texts with random side when rendered when game option is active.
statusReason: expected 'components.GameWolfHoundTurnStartsEve…' to be 'components.GameWolfHoundTurnStartsEve…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWolfHoundTurnStartsEvent/GameWolfHoundTurnStartsEvent.vue:23:49
 
 const isWolfHoundSideRandomlyChosen = computed<boolean>(() => game.value.options.roles.wolfHound.isSideRandomlyChosen);
 
-const gameEventTexts = computed<string[]>(() => {
-  if (isWolfHoundSideRandomlyChosen.value) {
-    return [t("components.GameWolfHoundTurnStartsEvent.wolfHoundSideRandomlyChosen")];
-  }
-  return [t("components.GameWolfHoundTurnStartsEvent.wolfHoundChoosesSide")];
-});
+const gameEventTexts = computed<string[]>(() => {});
 </script>
killedBy: Game Wolf Hound Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Wolf Hound Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWolfHoundTurnStartsEvent/GameWolfHoundTurnStartsEvent.vue:24:7
 const isWolfHoundSideRandomlyChosen = computed<boolean>(() => game.value.options.roles.wolfHound.isSideRandomlyChosen);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (isWolfHoundSideRandomlyChosen.value) {
+  if (true) {
     return [t("components.GameWolfHoundTurnStartsEvent.wolfHoundSideRandomlyChosen")];
   }
killedBy: Game Wolf Hound Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Wolf Hound Turn Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWolfHoundTurnStartsEvent/GameWolfHoundTurnStartsEvent.vue:24:7
 const isWolfHoundSideRandomlyChosen = computed<boolean>(() => game.value.options.roles.wolfHound.isSideRandomlyChosen);
 
 const gameEventTexts = computed<string[]>(() => {
-  if (isWolfHoundSideRandomlyChosen.value) {
+  if (false) {
     return [t("components.GameWolfHoundTurnStartsEvent.wolfHoundSideRandomlyChosen")];
   }
killedBy: Game Wolf Hound Turn Starts Event Component Game Event Texts should pass event texts with random side when rendered when game option is active.
statusReason: expected 'components.GameWolfHoundTurnStartsEve…' to be 'components.GameWolfHoundTurnStartsEve…' // Object.is equality

[Killed] ArrayDeclaration
GameEventsMonitorCurrentEvent/GameTurnStartsEvent/GameWolfHoundTurnStartsEvent/GameWolfHoundTurnStartsEvent.vue:27:10
   if (isWolfHoundSideRandomlyChosen.value) {
     return [t("components.GameWolfHoundTurnStartsEvent.wolfHoundSideRandomlyChosen")];
   }
-  return [t("components.GameWolfHoundTurnStartsEvent.wolfHoundChoosesSide")];
+  return [];
 });
 </script>
killedBy: Game Wolf Hound Turn Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Wolf Hound Turn Starts Event Component > should match snapshot when rendered. 1` mismatched
