[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameBuryDeadBodiesPlayground.vue:32:70
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const eligibleStolenRoleByDevotedServantPlayers = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
+const eligibleStolenRoleByDevotedServantPlayers = computed<Player[]>(() => undefined);
 </script>
killedBy: Game Bury Dead Bodies Playground Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] StringLiteral
GamePlayground/GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameBuryDeadBodiesPlayground.vue:32:127
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const eligibleStolenRoleByDevotedServantPlayers = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
+const eligibleStolenRoleByDevotedServantPlayers = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay(""));
 </script>
killedBy: Game Bury Dead Bodies Playground Component Devoted Servant Playground should render devoted servant playground when one interaction for her is available.
statusReason: expected false to be truthy
