[Killed] ArrowFunction
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:55:46
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const eliminatedPlayers = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
+const eliminatedPlayers = computed<Player[]>(() => undefined);
 
 const doesDevotedServantStealRoleQuestion = computed<string>(() => {
killedBy: Game Devoted Servant Steals Role Playground Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] StringLiteral
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:55:103
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const eliminatedPlayers = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
+const eliminatedPlayers = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay(""));
 
 const doesDevotedServantStealRoleQuestion = computed<string>(() => {
killedBy: Game Devoted Servant Steals Role Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Devoted Servant Steals Role Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:57:68
 
 const eliminatedPlayers = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
 
-const doesDevotedServantStealRoleQuestion = computed<string>(() => {
-  const eliminatedPlayersCount = eliminatedPlayers.value.length;
-
-  return t("components.GameDevotedServantStealsRolePlayground.doesDevotedServantStealRole", eliminatedPlayersCount);
-});
+const doesDevotedServantStealRoleQuestion = computed<string>(() => {});
 </script>
killedBy: Game Devoted Servant Steals Role Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Devoted Servant Steals Role Playground Component > should match snapshot when rendered. 1` mismatched
