[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:35:69
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const giveLifePotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-life-potion"));
+const giveLifePotionInteractionEligibleTargets = computed<Player[]>(() => undefined);
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
killedBy: Game Use Potions Playground Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:37:70
 
 const giveLifePotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-life-potion"));
 
-const giveDeathPotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
+const giveDeathPotionInteractionEligibleTargets = computed<Player[]>(() => undefined);
 
 const hasWitchUsedBothPotions = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value.length && !giveDeathPotionInteractionEligibleTargets.value.length);
killedBy: Game Use Potions Playground Component No potion left should render no potion container when witch has no potion left.
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:39:57
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedBothPotions = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value.length && !giveDeathPotionInteractionEligibleTargets.value.length);
+const hasWitchUsedBothPotions = computed<boolean>(() => false);
 </script>
killedBy: Game Use Potions Playground Component No potion left should render no potion container when witch has no potion left.
statusReason: expected false to be truthy

[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:39:51
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedBothPotions = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value.length && !giveDeathPotionInteractionEligibleTargets.value.length);
+const hasWitchUsedBothPotions = computed<boolean>(() => undefined);
 </script>
killedBy: Game Use Potions Playground Component No potion left should render no potion container when witch has no potion left.
statusReason: expected false to be truthy
