[Killed] ConditionalExpression
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:93:56
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedLifePotion = computed<boolean>(() => giveLifePotionInteractionEligibleTargets.value.length === 0);
+const hasWitchUsedLifePotion = computed<boolean>(() => true);
 
 const hasWitchUsedDeathPotion = computed<boolean>(() => giveDeathPotionInteractionEligibleTargets.value.length === 0);
killedBy: Witch Use Potions Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Witch Use Potions Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:93:50
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[]>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedLifePotion = computed<boolean>(() => giveLifePotionInteractionEligibleTargets.value.length === 0);
+const hasWitchUsedLifePotion = computed<boolean>(() => undefined);
 
 const hasWitchUsedDeathPotion = computed<boolean>(() => giveDeathPotionInteractionEligibleTargets.value.length === 0);
killedBy: Witch Use Potions Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Witch Use Potions Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:95:57
 
 const hasWitchUsedLifePotion = computed<boolean>(() => giveLifePotionInteractionEligibleTargets.value.length === 0);
 
-const hasWitchUsedDeathPotion = computed<boolean>(() => giveDeathPotionInteractionEligibleTargets.value.length === 0);
+const hasWitchUsedDeathPotion = computed<boolean>(() => giveDeathPotionInteractionEligibleTargets.value.length !== 0);
 
 const tabViewActiveIndex = computed<number>(() => (hasWitchUsedLifePotion.value ? 1 : 0));
killedBy: Witch Use Potions Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Witch Use Potions Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:95:57
 
 const hasWitchUsedLifePotion = computed<boolean>(() => giveLifePotionInteractionEligibleTargets.value.length === 0);
 
-const hasWitchUsedDeathPotion = computed<boolean>(() => giveDeathPotionInteractionEligibleTargets.value.length === 0);
+const hasWitchUsedDeathPotion = computed<boolean>(() => true);
 
 const tabViewActiveIndex = computed<number>(() => (hasWitchUsedLifePotion.value ? 1 : 0));
killedBy: Witch Use Potions Tab View Component Give Death Potion Panel should enable panel when witch still has death potion.
statusReason: expected 'true' to be 'false' // Object.is equality
