[Killed] BlockStatement
game-event/GameEventFlippingPlayerCard/GameEventFlippingPlaySourcePlayersCard/GameEventFlippingPlaySourcePlayersCard.vue:19:56
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const expectedPlayersToPlay = computed<Player[]>(() => {
-  const { currentPlay } = game.value;
-
-  return currentPlay?.source.players ?? [];
-});
+const expectedPlayersToPlay = computed<Player[]>(() => {});
 </script>
killedBy: Game Event Flipping Play Source Players Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Flipping Play Source Players Card Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
game-event/GameEventFlippingPlayerCard/GameEventFlippingPlaySourcePlayersCard/GameEventFlippingPlaySourcePlayersCard.vue:22:10
 const expectedPlayersToPlay = computed<Player[]>(() => {
   const { currentPlay } = game.value;
 
-  return currentPlay?.source.players ?? [];
+  return currentPlay?.source.players && [];
 });
 </script>
killedBy: Game Event Flipping Play Source Players Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Flipping Play Source Players Card Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
game-event/GameEventFlippingPlayerCard/GameEventFlippingPlaySourcePlayersCard/GameEventFlippingPlaySourcePlayersCard.vue:22:10
 const expectedPlayersToPlay = computed<Player[]>(() => {
   const { currentPlay } = game.value;
 
-  return currentPlay?.source.players ?? [];
+  return currentPlay.source.players ?? [];
 });
 </script>
killedBy: Game Event Flipping Play Source Players Card Component Game Event Flipping Player Card should pass empty array when there is no current play.
statusReason: Cannot read properties of null (reading 'source')
