[Killed] BlockStatement
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:43:55
 const playerToDisplay = computed<Player | undefined>(() => props.players[playerIndex.value]);
 
 function flipPlayerCard(): void {
-  if (playerIndex.value === props.players.length - 1) {
-    playerIndex.value = 0;
-
-    return;
-  }
+  if (playerIndex.value === props.players.length - 1) {}
   playerIndex.value++;
 }
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should reset to the first player when interval is over for the max number of players.
statusReason: expected undefined to be 'seer' // Object.is equality

[Killed] EqualityOperator
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:43:7
 const playerToDisplay = computed<Player | undefined>(() => props.players[playerIndex.value]);
 
 function flipPlayerCard(): void {
-  if (playerIndex.value === props.players.length - 1) {
+  if (playerIndex.value !== props.players.length - 1) {
     playerIndex.value = 0;
 
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should render the next player role when interval is over.
statusReason: expected 'seer' to be 'cupid' // Object.is equality

[Killed] BlockStatement
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:51:45
   playerIndex.value++;
 }
 
-function flipPlayerCardEachInterval(): void {
-  const intervalInMs = 1500;
-
-  if (props.players.length === 0) {
-    return;
-  }
-  window.setInterval(flipPlayerCard, intervalInMs);
-}
+function flipPlayerCardEachInterval(): void {}
 
 flipPlayerCardEachInterval();
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should set interval of 1500ms for flipping player card when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] EqualityOperator
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:54:7
 function flipPlayerCardEachInterval(): void {
   const intervalInMs = 1500;
 
-  if (props.players.length === 0) {
+  if (props.players.length !== 0) {
     return;
   }
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should set interval of 1500ms for flipping player card when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
