[Killed] BlockStatement
game/game-phase/GamePhaseIcon/GamePhaseIcon.vue:14:42
 
 const props = defineProps<GamePhaseIconProps>();
 
-const phaseIcon = computed<string>(() => {
-  const phasesIcon: Record<GamePhaseName, string> = {
-    night: "fa fa-moon text-night",
-    day: "fa fa-sun text-day",
-    twilight: "fa fa-cloud-moon text-twilight",
-  };
-
-  return phasesIcon[props.phase];
-});
+const phaseIcon = computed<string>(() => {});
 </script>
killedBy: Game Phase Icon Component should match snapshot when rendered.
statusReason: Snapshot `Game Phase Icon Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
game/game-phase/GamePhaseIcon/GamePhaseIcon.vue:15:53
 const props = defineProps<GamePhaseIconProps>();
 
 const phaseIcon = computed<string>(() => {
-  const phasesIcon: Record<GamePhaseName, string> = {
-    night: "fa fa-moon text-night",
-    day: "fa fa-sun text-day",
-    twilight: "fa fa-cloud-moon text-twilight",
-  };
+  const phasesIcon: Record<GamePhaseName, string> = {};
 
   return phasesIcon[props.phase];
killedBy: Game Phase Icon Component should match snapshot when rendered.
statusReason: Snapshot `Game Phase Icon Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
game/game-phase/GamePhaseIcon/GamePhaseIcon.vue:18:15
   const phasesIcon: Record<GamePhaseName, string> = {
     night: "fa fa-moon text-night",
     day: "fa fa-sun text-day",
-    twilight: "fa fa-cloud-moon text-twilight",
+    twilight: "",
   };
 
killedBy: Game Phase Icon Component Icon classes should display the twilight icon when the phase is twilight.
statusReason: expect(received).toContainValues(expected)

Expected object to contain all values:
  Array [
  "fa-cloud-moon",
  "text-twilight",
]
Received:
