[Killed] ConditionalExpression
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:65:7
 });
 
 watch(() => props.roleName, roleName => {
-  if (isFlipped.value) {
+  if (true) {
     frontRoleName.value = roleName;
     isFlipped.value = false;
killedBy: Role Flipping Image Component Flip Container Back Role Image should flip the card when the role is updated in props.
statusReason: expected 'false' to be 'true' // Object.is equality
