[Killed] StringLiteral
RoleImage/RoleFlippingImage/RoleFlippingImageSvgIcon/RoleFlippingImageSvgIcon.vue:17:17
 
 defineProps<RoleFlippingImageSvgIconProps>();
 
-const svgSize = "75";
+const svgSize = "";
 </script>
killedBy: Game Player Dies Event Component should match snapshot when rendered without shallow rendering.
statusReason: Snapshot `Game Player Dies Event Component > should match snapshot when rendered without shallow rendering. 1` mismatched
