[Killed] ConditionalExpression
api/game/game-phase/useGamePhase.ts:13:9
   function getGamePhaseWithTurnText(phase: GamePhaseName, turn: number): string {
     const phaseText = t(`shared.game.phase.${phase}`);
 
-    if (phase === "twilight") {
+    if (false) {
       return phaseText;
     }
killedBy: Use Game Phase Composable getGamePhaseWithTurnText should return game phase without turn text when phase is twilight.
statusReason: expected 'shared.game.phase.twilight 3' to be 'shared.game.phase.twilight' // Object.is equality

[Killed] EqualityOperator
api/game/game-phase/useGamePhase.ts:13:9
   function getGamePhaseWithTurnText(phase: GamePhaseName, turn: number): string {
     const phaseText = t(`shared.game.phase.${phase}`);
 
-    if (phase === "twilight") {
+    if (phase !== "twilight") {
       return phaseText;
     }
killedBy: Game Playground Header Phase should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Phase > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
api/game/game-phase/useGamePhase.ts:16:12
     if (phase === "twilight") {
       return phaseText;
     }
-    return `${phaseText} ${turn}`;
+    return ``;
   }
   return { getGamePhaseWithTurnText };
killedBy: Game Playground Header Phase should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Phase > should match snapshot when rendered. 1` mismatched
