[Killed] ConditionalExpression
api/game/player/usePlayers.ts:12:11
 
   function getPlayersNamesText(players: Player[]): string {
     return players.reduce<string>((acc, player, index) => {
-      if (index === 0) {
+      if (true) {
         return player.name;
       }
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for sheri…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] BlockStatement
api/game/player/usePlayers.ts:12:24
 
   function getPlayersNamesText(players: Player[]): string {
     return players.reduce<string>((acc, player, index) => {
-      if (index === 0) {
-        return player.name;
-      }
+      if (index === 0) {}
       if (index === players.length - 1) {
         return `${acc} ${t("common.and")} ${player.name}`;
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for sheri…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] ConditionalExpression
api/game/player/usePlayers.ts:15:11
       if (index === 0) {
         return player.name;
       }
-      if (index === players.length - 1) {
+      if (true) {
         return `${acc} ${t("common.and")} ${player.name}`;
       }
killedBy: Use Players Composable getPlayersNamesText should return player names text when called.
statusReason: expected 'player-1 common.and player-2 common.a…' to be 'player-1, player-2 common.and player-3' // Object.is equality

[Killed] ArithmeticOperator
api/game/player/usePlayers.ts:15:21
       if (index === 0) {
         return player.name;
       }
-      if (index === players.length - 1) {
+      if (index === players.length + 1) {
         return `${acc} ${t("common.and")} ${player.name}`;
       }
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for sheri…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
api/game/player/usePlayers.ts:16:16
         return player.name;
       }
       if (index === players.length - 1) {
-        return `${acc} ${t("common.and")} ${player.name}`;
+        return ``;
       }
       return `${acc}, ${player.name}`;
killedBy: Game Survivors Turn Starts Event Component Game Event Texts 'should display voting texts for sheri…'
statusReason: expected 'components.GameSurvivorsTurnStartsEve…' to be 'components.GameSurvivorsTurnStartsEve…' // Object.is equality

[Killed] StringLiteral
api/game/player/usePlayers.ts:19:8
         return `${acc} ${t("common.and")} ${player.name}`;
       }
       return `${acc}, ${player.name}`;
-    }, "");
+    }, "Stryker was here!");
   }
   return { getPlayersNamesText };
killedBy: Use Players Composable getPlayersNamesText should return empty string when there are no players.
statusReason: expected 'Stryker was here!' to be '' // Object.is equality
