[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:11:60
   const gameEvents = ref<GameEvent[]>([]);
   const currentGameEventIndex = ref<number>(0);
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
-  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
+  const canGoToPreviousGameEvent = computed<boolean>(() => false);
 
   function resetGameEvents(): void {
killedBy: Game Events Store canGoToPreviousGameEvent should return true when can go to previous game event.
statusReason: expected false to be truthy

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:25:63
     return deadPlayers.map(player => GameEvent.create({ type: "player-dies", players: [player] }));
   }
 
-  function generateAndSetGameEventsFromGame(game: Game): void {
-    resetGameEvents();
-    if (game.tick === 1) {
-      gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    }
-    if (game.phase.tick === 1 && game.phase.name !== "twilight") {
-      gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
-    }
-    if (game.currentPlay?.action === "bury-dead-bodies") {
-      gameEvents.value.push(...getDeadPlayerGameEvents(game));
-    }
-    gameEvents.value.push(GameEvent.create({ type: "game-turn-starts" }));
-  }
+  function generateAndSetGameEventsFromGame(game: Game): void {}
 
   function goToNextGameEvent(): void {
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate game starts and turn …'
statusReason: expected [] to strictly equal [ _GameEvent{ …(2) }, …(1) ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:27:26
 
   function generateAndSetGameEventsFromGame(game: Game): void {
     resetGameEvents();
-    if (game.tick === 1) {
-      gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    }
+    if (game.tick === 1) {}
     if (game.phase.tick === 1 && game.phase.name !== "twilight") {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate game starts and turn …'
statusReason: expected [ _GameEvent{ …(2) } ] to strictly equal [ _GameEvent{ …(2) }, …(1) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:30:9
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     }
-    if (game.phase.tick === 1 && game.phase.name !== "twilight") {
+    if (false) {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate day rises and turn st…'
statusReason: expected [ _GameEvent{ …(2) } ] to strictly equal [ _GameEvent{ …(2) }, …(1) ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:30:66
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     }
-    if (game.phase.tick === 1 && game.phase.name !== "twilight") {
-      gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
-    }
+    if (game.phase.tick === 1 && game.phase.name !== "twilight") {}
     if (game.currentPlay?.action === "bury-dead-bodies") {
       gameEvents.value.push(...getDeadPlayerGameEvents(game));
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate day rises and turn st…'
statusReason: expected [ _GameEvent{ …(2) } ] to strictly equal [ _GameEvent{ …(2) }, …(1) ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:33:58
     if (game.phase.tick === 1 && game.phase.name !== "twilight") {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
-    if (game.currentPlay?.action === "bury-dead-bodies") {
-      gameEvents.value.push(...getDeadPlayerGameEvents(game));
-    }
+    if (game.currentPlay?.action === "bury-dead-bodies") {}
     gameEvents.value.push(GameEvent.create({ type: "game-turn-starts" }));
   }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate player dies event whe…'
statusReason: expected [ _GameEvent{ …(2) }, …(1) ] to strictly equal [ _GameEvent{ …(2) }, …(3) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:33:9
     if (game.phase.tick === 1 && game.phase.name !== "twilight") {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
-    if (game.currentPlay?.action === "bury-dead-bodies") {
+    if (true) {
       gameEvents.value.push(...getDeadPlayerGameEvents(game));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate turn starts event whe…'
statusReason: expected [ _GameEvent{ …(2) }, …(2) ] to strictly equal [ _GameEvent{ …(2) } ]
