[Killed] BlockStatement
GamePlaying/GameEventsMonitor/GameEventsMonitorCurrentEvent/GameEventsMonitorCurrentEvent.vue:33:103
 const gameEventsStore = useGameEventsStore();
 const { currentGameEvent, currentGameEventIndex } = storeToRefs(gameEventsStore);
 
-const currentGameEventTypeComponent = computed<GameEventsMonitorEventTypeComponent | undefined>(() => {
-  const currentGameEventTypeComponents: Record<GameEventType, GameEventsMonitorEventTypeComponent> = {
-    "game-starts": GameStartsEvent,
-    "game-phase-starts": GamePhaseStartsEvent,
-    "game-turn-starts": GameTurnStartsEvent,
-  };
-  if (!currentGameEvent.value) {
-    return undefined;
-  }
-  return currentGameEventTypeComponents[currentGameEvent.value.type];
-});
+const currentGameEventTypeComponent = computed<GameEventsMonitorEventTypeComponent | undefined>(() => {});
 </script>
killedBy: Game Events Monitor Current Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Events Monitor Current Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GamePlaying/GameEventsMonitor/GameEventsMonitorCurrentEvent/GameEventsMonitorCurrentEvent.vue:39:7
     "game-phase-starts": GamePhaseStartsEvent,
     "game-turn-starts": GameTurnStartsEvent,
   };
-  if (!currentGameEvent.value) {
+  if (false) {
     return undefined;
   }
killedBy: Game Events Monitor Current Event Component Current Game Event Component should not render any game event component when there is no current game event.
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] BooleanLiteral
GamePlaying/GameEventsMonitor/GameEventsMonitorCurrentEvent/GameEventsMonitorCurrentEvent.vue:39:7
     "game-phase-starts": GamePhaseStartsEvent,
     "game-turn-starts": GameTurnStartsEvent,
   };
-  if (!currentGameEvent.value) {
+  if (currentGameEvent.value) {
     return undefined;
   }
killedBy: Game Events Monitor Current Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Events Monitor Current Event Component > should match snapshot when rendered. 1` mismatched
