[Killed] BlockStatement
GamePlaying/GameEventsMonitor/GameEventsMonitorFooter/GameEventsMonitorFooter.vue:38:47
 const { canGoToPreviousGameEvent } = storeToRefs(gameEventsStore);
 const { goToNextGameEvent, goToPreviousGameEvent } = gameEventsStore;
 
-function handlePreviousGameEventClick(): void {
-  goToPreviousGameEvent();
-}
+function handlePreviousGameEventClick(): void {}
 
 function handleNextGameEventClick(): void {
killedBy: Game Events Monitor Footer Component Previous Event button should go to previous game event when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GamePlaying/GameEventsMonitor/GameEventsMonitorFooter/GameEventsMonitorFooter.vue:42:43
   goToPreviousGameEvent();
 }
 
-function handleNextGameEventClick(): void {
-  goToNextGameEvent();
-}
+function handleNextGameEventClick(): void {}
 </script>
killedBy: Game Events Monitor Footer Component Skip Current Event button should skip current game event when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
