[Killed] ConditionalExpression
GamePlaying/GamePlayground/GamePlaygroundContent/GamePlaygroundContent.vue:31:7
 
 const gamePlaygroundTypeComponentToRender = computed<GamePlaygroundTypeComponent | undefined>(() => {
   const { currentPlay } = game.value;
-  if (currentPlay?.action === "use-potions") {
+  if (true) {
     return GameUsePotionsPlayground;
   }
killedBy: Game Playground Content Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Content Component > should match snapshot when rendered. 1` mismatched
