[Killed] ArrowFunction
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:36:54
 const props = defineProps<GameEventFlippingPlayerCardProps>();
 
 const playerIndex = ref<number>(0);
-const playerToDisplay = computed<Player | undefined>(() => props.players[playerIndex.value]);
+const playerToDisplay = computed<Player | undefined>(() => undefined);
 
 function flipPlayerCard(): void {
killedBy: Game Event Flipping Player Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Flipping Player Card Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:38:33
 const playerIndex = ref<number>(0);
 const playerToDisplay = computed<Player | undefined>(() => props.players[playerIndex.value]);
 
-function flipPlayerCard(): void {
-  if (playerIndex.value === props.players.length - 1) {
-    playerIndex.value = 0;
-
-    return;
-  }
-  playerIndex.value++;
-}
+function flipPlayerCard(): void {}
 
 function flipPlayerCardEachInterval(): void {
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should render the next player role when interval is over.
statusReason: expected 'seer' to be 'cupid' // Object.is equality

[Killed] ArithmeticOperator
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:39:29
 const playerToDisplay = computed<Player | undefined>(() => props.players[playerIndex.value]);
 
 function flipPlayerCard(): void {
-  if (playerIndex.value === props.players.length - 1) {
+  if (playerIndex.value === props.players.length + 1) {
     playerIndex.value = 0;
 
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should reset to the first player when interval is over for the max number of players.
statusReason: expected undefined to be 'seer' // Object.is equality

[Killed] ConditionalExpression
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:39:7
 const playerToDisplay = computed<Player | undefined>(() => props.players[playerIndex.value]);
 
 function flipPlayerCard(): void {
-  if (playerIndex.value === props.players.length - 1) {
+  if (false) {
     playerIndex.value = 0;
 
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should reset to the first player when interval is over for the max number of players.
statusReason: expected undefined to be 'seer' // Object.is equality

[Killed] UpdateOperator
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:44:3
 
     return;
   }
-  playerIndex.value++;
+  playerIndex.value--;
 }
 
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should render the next player role when interval is over.
statusReason: expected undefined to be 'cupid' // Object.is equality

[Killed] BlockStatement
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:47:45
   playerIndex.value++;
 }
 
-function flipPlayerCardEachInterval(): void {
-  const intervalInMs = 1500;
-
-  if (props.players.length === 0) {
-    return;
-  }
-  global.setInterval(flipPlayerCard, intervalInMs);
-}
+function flipPlayerCardEachInterval(): void {}
 
 flipPlayerCardEachInterval();
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should set interval of 1500ms for flipping player card when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:50:7
 function flipPlayerCardEachInterval(): void {
   const intervalInMs = 1500;
 
-  if (props.players.length === 0) {
+  if (true) {
     return;
   }
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should set interval of 1500ms for flipping player card when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
game/game-event/GameEventFlippingPlayerCard/GameEventFlippingPlayerCard.vue:50:35
 function flipPlayerCardEachInterval(): void {
   const intervalInMs = 1500;
 
-  if (props.players.length === 0) {
-    return;
-  }
+  if (props.players.length === 0) {}
   global.setInterval(flipPlayerCard, intervalInMs);
 }
killedBy: Game Event Flipping Player Card Component Game Event Player Flipping Role should not set interval when there are no players to display.
statusReason: expected "setInterval" to not be called at all, but actually been called 1 times

Received: 

  1st setInterval call:

    Array [
      [Function flipPlayerCard],
