[Killed] ArrowFunction
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:63:59
 
 const currentIndex = ref<number>(0);
 
-const currentGameEventText = computed<string | undefined>(() => props.texts[currentIndex.value]);
+const currentGameEventText = computed<string | undefined>(() => undefined);
 
 const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0);
killedBy: Game Event Texts Manager Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Texts Manager Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:65:62
 
 const currentGameEventText = computed<string | undefined>(() => props.texts[currentIndex.value]);
 
-const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0);
+const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value >= 0);
 
 const previousGameEventTextTooltip = computed<string>(() => {
killedBy: Game Event Texts Manager Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Texts Manager Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:65:62
 
 const currentGameEventText = computed<string | undefined>(() => props.texts[currentIndex.value]);
 
-const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0);
+const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value <= 0);
 
 const previousGameEventTextTooltip = computed<string>(() => {
killedBy: Game Event Texts Manager Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Texts Manager Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:67:61
 
 const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0);
 
-const previousGameEventTextTooltip = computed<string>(() => {
-  if (canGoToPreviousGameEventText.value) {
-    return t("shared.actions.back");
-  }
-  return "";
-});
+const previousGameEventTextTooltip = computed<string>(() => {});
 
 function nextEventText(): void {
killedBy: Game Event Texts Manager Component Previous Game Event Text button should not have tooltip when cannot go to previous game event.
statusReason: expected undefined to be '' // Object.is equality

[Killed] ConditionalExpression
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:68:7
 const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0);
 
 const previousGameEventTextTooltip = computed<string>(() => {
-  if (canGoToPreviousGameEventText.value) {
+  if (true) {
     return t("shared.actions.back");
   }
killedBy: Game Event Texts Manager Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Texts Manager Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:68:43
 const canGoToPreviousGameEventText = computed<boolean>(() => currentIndex.value > 0);
 
 const previousGameEventTextTooltip = computed<string>(() => {
-  if (canGoToPreviousGameEventText.value) {
-    return t("shared.actions.back");
-  }
+  if (canGoToPreviousGameEventText.value) {}
   return "";
 });
killedBy: Game Event Texts Manager Component Previous Game Event Text button should have tooltip when can go to previous game event.
statusReason: expected '' to be 'shared.actions.back' // Object.is equality

[Killed] StringLiteral
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:69:14
 
 const previousGameEventTextTooltip = computed<string>(() => {
   if (canGoToPreviousGameEventText.value) {
-    return t("shared.actions.back");
+    return t("");
   }
   return "";
killedBy: Game Event Texts Manager Component Previous Game Event Text button should have tooltip when can go to previous game event.
statusReason: expected '' to be 'shared.actions.back' // Object.is equality

[Killed] StringLiteral
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:71:10
   if (canGoToPreviousGameEventText.value) {
     return t("shared.actions.back");
   }
-  return "";
+  return "Stryker was here!";
 });
 
killedBy: Game Event Texts Manager Component should match snapshot when rendered.
statusReason: Snapshot `Game Event Texts Manager Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:74:32
   return "";
 });
 
-function nextEventText(): void {
-  currentIndex.value++;
-  if (currentGameEventText.value === undefined) {
-    goToNextGameEvent();
-  }
-}
+function nextEventText(): void {}
 
 function previousGameEventText(): void {
killedBy: Game Event Texts Manager Component Previous Game Event Text button should be enabled when can go to previous game event.
statusReason: expected '' to be undefined

[Killed] UpdateOperator
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:75:3
 });
 
 function nextEventText(): void {
-  currentIndex.value++;
+  currentIndex.value--;
   if (currentGameEventText.value === undefined) {
     goToNextGameEvent();
killedBy: Game Event Texts Manager Component Previous Game Event Text button should be enabled when can go to previous game event.
statusReason: expected '' to be undefined

[Killed] ConditionalExpression
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:76:7
 
 function nextEventText(): void {
   currentIndex.value++;
-  if (currentGameEventText.value === undefined) {
+  if (true) {
     goToNextGameEvent();
   }
killedBy: Game Event Texts Manager Component Next Game Event Text button should go to next game event when there is no more text.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 3 times

[Killed] EqualityOperator
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:76:7
 
 function nextEventText(): void {
   currentIndex.value++;
-  if (currentGameEventText.value === undefined) {
+  if (currentGameEventText.value !== undefined) {
     goToNextGameEvent();
   }
killedBy: Game Event Texts Manager Component Next Game Event Text button should go to next game event when there is no more text.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 2 times

[Killed] BlockStatement
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:81:40
   }
 }
 
-function previousGameEventText(): void {
-  currentIndex.value--;
-}
+function previousGameEventText(): void {}
 </script>
killedBy: Game Event Texts Manager Component Previous Game Event Text button should display previous game event text when clicked.
statusReason: expected 'Night falls.' to be 'Day rises.' // Object.is equality

[Killed] UpdateOperator
game-event/GameEventWithTexts/GameEventTextsManager/GameEventTextsManager.vue:82:3
 }
 
 function previousGameEventText(): void {
-  currentIndex.value--;
+  currentIndex.value++;
 }
 </script>
killedBy: Game Event Texts Manager Component Previous Game Event Text button should display previous game event text when clicked.
statusReason: expected '' to be 'Day rises.' // Object.is equality
