[Killed] EqualityOperator
stores/game/game-event/useGameEventsStore.ts:10:60
   const gameEvents = ref<GameEvent[]>([]);
   const currentGameEventIndex = ref<number>(0);
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
-  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
+  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value >= 0);
 
   function resetGameEvents(): void {
killedBy: Game Events Monitor Footer Component should match snapshot when rendered.
statusReason: Snapshot `Game Events Monitor Footer Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:10:60
   const gameEvents = ref<GameEvent[]>([]);
   const currentGameEventIndex = ref<number>(0);
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
-  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
+  const canGoToPreviousGameEvent = computed<boolean>(() => true);
 
   function resetGameEvents(): void {
killedBy: Game Events Monitor Footer Component should match snapshot when rendered.
statusReason: Snapshot `Game Events Monitor Footer Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:17:63
     currentGameEventIndex.value = 0;
   }
 
-  function generateAndSetGameEventsFromGame(game: Game): void {
-    resetGameEvents();
-    if (game.tick === 1) {
-      gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    } else if (game.phase.tick === 1) {
-      gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
-    }
-    gameEvents.value.push(GameEvent.create({ type: "game-turn-starts" }));
-  }
+  function generateAndSetGameEventsFromGame(game: Game): void {}
 
   function goToNextGameEvent(): void {
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate game starts and turn …'
statusReason: expected [] to strictly equal [ …(2) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:19:9
 
   function generateAndSetGameEventsFromGame(game: Game): void {
     resetGameEvents();
-    if (game.tick === 1) {
+    if (false) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     } else if (game.phase.tick === 1) {
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate game starts and turn …'
statusReason: expected [ Array(1) ] to strictly equal [ …(2) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:21:16
     resetGameEvents();
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    } else if (game.phase.tick === 1) {
+    } else if (true) {
       gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate turn starts event whe…'
statusReason: expected [ …(2) ] to strictly equal [ Array(1) ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:21:39
     resetGameEvents();
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    } else if (game.phase.tick === 1) {
-      gameEvents.value.push(GameEvent.create({ type: "game-phase-starts" }));
-    }
+    } else if (game.phase.tick === 1) {}
     gameEvents.value.push(GameEvent.create({ type: "game-turn-starts" }));
   }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate day rises and turn st…'
statusReason: expected [ Array(1) ] to strictly equal [ …(2) ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:27:38
     gameEvents.value.push(GameEvent.create({ type: "game-turn-starts" }));
   }
 
-  function goToNextGameEvent(): void {
-    currentGameEventIndex.value += 1;
-  }
+  function goToNextGameEvent(): void {}
 
   function goToPreviousGameEvent(): void {
killedBy: Game Events Store goToNextGameEvent should go to the next game event when called.
statusReason: expected _GameEvent{ type: 'game-phase-starts' } to strictly equal _GameEvent{ type: 'game-turn-starts' }

[Killed] AssignmentOperator
stores/game/game-event/useGameEventsStore.ts:28:5
   }
 
   function goToNextGameEvent(): void {
-    currentGameEventIndex.value += 1;
+    currentGameEventIndex.value -= 1;
   }
 
killedBy: Game Events Store goToNextGameEvent should go to the next game event when called.
statusReason: expected undefined to strictly equal _GameEvent{ type: 'game-starts' }

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:31:42
     currentGameEventIndex.value += 1;
   }
 
-  function goToPreviousGameEvent(): void {
-    currentGameEventIndex.value -= 1;
-  }
+  function goToPreviousGameEvent(): void {}
   return {
     gameEvents,
killedBy: Game Events Store goToPreviousGameEvent should go to the previous game event when called.
statusReason: expected _GameEvent{ type: 'game-phase-starts' } to strictly equal _GameEvent{ type: 'game-starts' }

[Killed] AssignmentOperator
stores/game/game-event/useGameEventsStore.ts:32:5
   }
 
   function goToPreviousGameEvent(): void {
-    currentGameEventIndex.value -= 1;
+    currentGameEventIndex.value += 1;
   }
   return {
killedBy: Game Events Store goToPreviousGameEvent should go to the previous game event when called.
statusReason: expected undefined to strictly equal _GameEvent{ type: 'game-turn-starts' }
