[Killed] BlockStatement
stores/game/useGameStore.ts:28:65
     game.value = new Game();
   }
 
-  async function fetchAndSetGame(gameId: string): Promise<void> {
-    fetchingGameStatus.value = "pending";
-    const fetchedGame = await fetchGameFromApi(gameId);
-    if (!fetchedGame) {
-      fetchingGameStatus.value = "error";
-
-      return;
-    }
-    generateAndSetGameEventsFromGame(fetchedGame);
-    game.value = fetchedGame;
-    fetchingGameStatus.value = "success";
-  }
+  async function fetchAndSetGame(gameId: string): Promise<void> {}
 
   async function cancelGame(): Promise<void> {
killedBy: Game Store fetchAndSetGame should fetch game when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
stores/game/useGameStore.ts:53:80
     cancelingGameStatus.value = "success";
   }
 
-  async function makeGamePlay(makeGamePlayDto: MakeGamePlayDto): Promise<void> {
-    makingGamePlayStatus.value = "pending";
-    const playedGame = await makeGamePlayFromApi(game.value._id, makeGamePlayDto);
-    if (!playedGame) {
-      fetchingGameStatus.value = "error";
-
-      return;
-    }
-    generateAndSetGameEventsFromGame(playedGame);
-    game.value = playedGame;
-    makingGamePlayStatus.value = "success";
-  }
+  async function makeGamePlay(makeGamePlayDto: MakeGamePlayDto): Promise<void> {}
   return {
     game,
killedBy: Game Store makeGamePlay should make game play when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
