[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:30:61
 
 const { insertIf } = useArrays();
 
-const isSheriffElectedOnFirstTick = computed<boolean>(() => {
-  const { currentPlay } = game.value;
-
-  return currentPlay?.action === "elect-sheriff";
-});
+const isSheriffElectedOnFirstTick = computed<boolean>(() => {});
 
 const gameCompositionEventText = computed<string>(() => {
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:33:10
 const isSheriffElectedOnFirstTick = computed<boolean>(() => {
   const { currentPlay } = game.value;
 
-  return currentPlay?.action === "elect-sheriff";
+  return currentPlay.action === "elect-sheriff";
 });
 
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event without sheriff election when there is no current play.
statusReason: Cannot read properties of null (reading 'action')

[Killed] EqualityOperator
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:33:10
 const isSheriffElectedOnFirstTick = computed<boolean>(() => {
   const { currentPlay } = game.value;
 
-  return currentPlay?.action === "elect-sheriff";
+  return currentPlay?.action !== "elect-sheriff";
 });
 
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:36:57
   return currentPlay?.action === "elect-sheriff";
 });
 
-const gameCompositionEventText = computed<string>(() => {
-  if (game.value.options.composition.isHidden) {
-    return t("components.GameStartsEvent.compositionIsHidden");
-  }
-  const gameRolesCount = counting(game.value.players, player => player.role.current);
-  const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
-    const roleCountText = `${count.toString()} ${t(`shared.role.name.${role}`, { count }, count)}`;
-
-    if (currentIndex === 0) {
-      return roleCountText;
-    }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
-      return `${acc} ${t("shared.and")} ${roleCountText}.`;
-    }
-    return `${acc}, ${roleCountText}`;
-  }, "");
-
-  return t("components.GameStartsEvent.gameCompositionEvent", { composition: shuffledPlayersRolesText });
-});
+const gameCompositionEventText = computed<string>(() => {});
 
 const gameStartsEventTexts = computed<string[]>(() => [
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:37:7
 });
 
 const gameCompositionEventText = computed<string>(() => {
-  if (game.value.options.composition.isHidden) {
+  if (false) {
     return t("components.GameStartsEvent.compositionIsHidden");
   }
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event with composition hidden when composition is hidden in game options.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:37:48
 });
 
 const gameCompositionEventText = computed<string>(() => {
-  if (game.value.options.composition.isHidden) {
-    return t("components.GameStartsEvent.compositionIsHidden");
-  }
+  if (game.value.options.composition.isHidden) {}
   const gameRolesCount = counting(game.value.players, player => player.role.current);
   const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event with composition hidden when composition is hidden in game options.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:38:14
 
 const gameCompositionEventText = computed<string>(() => {
   if (game.value.options.composition.isHidden) {
-    return t("components.GameStartsEvent.compositionIsHidden");
+    return t("");
   }
   const gameRolesCount = counting(game.value.players, player => player.role.current);
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event with composition hidden when composition is hidden in game options.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] ArrowFunction
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:40:55
   if (game.value.options.composition.isHidden) {
     return t("components.GameStartsEvent.compositionIsHidden");
   }
-  const gameRolesCount = counting(game.value.players, player => player.role.current);
+  const gameRolesCount = counting(game.value.players, () => undefined);
   const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
     const roleCountText = `${count.toString()} ${t(`shared.role.name.${role}`, { count }, count)}`;
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:41:121
     return t("components.GameStartsEvent.compositionIsHidden");
   }
   const gameRolesCount = counting(game.value.players, player => player.role.current);
-  const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
-    const roleCountText = `${count.toString()} ${t(`shared.role.name.${role}`, { count }, count)}`;
-
-    if (currentIndex === 0) {
-      return roleCountText;
-    }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
-      return `${acc} ${t("shared.and")} ${roleCountText}.`;
-    }
-    return `${acc}, ${roleCountText}`;
-  }, "");
+  const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {}, "");
 
   return t("components.GameStartsEvent.gameCompositionEvent", { composition: shuffledPlayersRolesText });
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:42:52
   }
   const gameRolesCount = counting(game.value.players, player => player.role.current);
   const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
-    const roleCountText = `${count.toString()} ${t(`shared.role.name.${role}`, { count }, count)}`;
+    const roleCountText = `${count.toString()} ${t(``, { count }, count)}`;
 
     if (currentIndex === 0) {
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:42:27
   }
   const gameRolesCount = counting(game.value.players, player => player.role.current);
   const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
-    const roleCountText = `${count.toString()} ${t(`shared.role.name.${role}`, { count }, count)}`;
+    const roleCountText = ``;
 
     if (currentIndex === 0) {
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] ConditionalExpression
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:44:9
   const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
     const roleCountText = `${count.toString()} ${t(`shared.role.name.${role}`, { count }, count)}`;
 
-    if (currentIndex === 0) {
+    if (false) {
       return roleCountText;
     }
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] EqualityOperator
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:44:9
   const shuffledPlayersRolesText = shuffle(Object.entries(gameRolesCount)).reduce((acc, [role, count], currentIndex) => {
     const roleCountText = `${count.toString()} ${t(`shared.role.name.${role}`, { count }, count)}`;
 
-    if (currentIndex === 0) {
+    if (currentIndex !== 0) {
       return roleCountText;
     }
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] ArithmeticOperator
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:47:26
     if (currentIndex === 0) {
       return roleCountText;
     }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
+    if (currentIndex === Object.values(gameRolesCount).length + 1) {
       return `${acc} ${t("shared.and")} ${roleCountText}.`;
     }
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] BlockStatement
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:47:68
     if (currentIndex === 0) {
       return roleCountText;
     }
-    if (currentIndex === Object.values(gameRolesCount).length - 1) {
-      return `${acc} ${t("shared.and")} ${roleCountText}.`;
-    }
+    if (currentIndex === Object.values(gameRolesCount).length - 1) {}
     return `${acc}, ${roleCountText}`;
   }, "");
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:48:26
       return roleCountText;
     }
     if (currentIndex === Object.values(gameRolesCount).length - 1) {
-      return `${acc} ${t("shared.and")} ${roleCountText}.`;
+      return `${acc} ${t("")} ${roleCountText}.`;
     }
     return `${acc}, ${roleCountText}`;
killedBy: Game Starts Event Component Game Starts Event texts should have texts for the game starts event containing sheriff election when first action is sheriff election.
statusReason: expected 'components.GameStartsEvent.welcomeToT…' to be 'components.GameStartsEvent.welcomeToT…' // Object.is equality

[Killed] ObjectLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:53:63
     return `${acc}, ${roleCountText}`;
   }, "");
 
-  return t("components.GameStartsEvent.gameCompositionEvent", { composition: shuffledPlayersRolesText });
+  return t("components.GameStartsEvent.gameCompositionEvent", {});
 });
 
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:56:49
   return t("components.GameStartsEvent.gameCompositionEvent", { composition: shuffledPlayersRolesText });
 });
 
-const gameStartsEventTexts = computed<string[]>(() => [
-  t("components.GameStartsEvent.welcomeToTheVillage"),
-  gameCompositionEventText.value,
-  t("components.GameStartsEvent.looksLifeSomeWerewolvesSneakedIntoTheVillage"),
-  t("components.GameStartsEvent.villagersMurderWerewolves"),
-  ...insertIf(isSheriffElectedOnFirstTick.value, t("components.GameStartsEvent.letsElectSheriffBefore")),
-]);
+const gameStartsEventTexts = computed<string[]>(() => undefined);
 </script>
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:56:55
   return t("components.GameStartsEvent.gameCompositionEvent", { composition: shuffledPlayersRolesText });
 });
 
-const gameStartsEventTexts = computed<string[]>(() => [
-  t("components.GameStartsEvent.welcomeToTheVillage"),
-  gameCompositionEventText.value,
-  t("components.GameStartsEvent.looksLifeSomeWerewolvesSneakedIntoTheVillage"),
-  t("components.GameStartsEvent.villagersMurderWerewolves"),
-  ...insertIf(isSheriffElectedOnFirstTick.value, t("components.GameStartsEvent.letsElectSheriffBefore")),
-]);
+const gameStartsEventTexts = computed<string[]>(() => []);
 </script>
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameEventsMonitor/GameEventsMonitorCurrentEvent/GameStartsEvent/GameStartsEvent.vue:60:5
   t("components.GameStartsEvent.welcomeToTheVillage"),
   gameCompositionEventText.value,
   t("components.GameStartsEvent.looksLifeSomeWerewolvesSneakedIntoTheVillage"),
-  t("components.GameStartsEvent.villagersMurderWerewolves"),
+  t(""),
   ...insertIf(isSheriffElectedOnFirstTick.value, t("components.GameStartsEvent.letsElectSheriffBefore")),
 ]);
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched
