[Killed] ArrayDeclaration
composables/misc/useArrays.ts:7:29
 
 function useArrays(): UseArrays {
   function insertIf<T>(mustBeInserted: boolean, value: T): T[] {
-    return mustBeInserted ? [value] : [];
+    return mustBeInserted ? [] : [];
   }
   return { insertIf };
killedBy: Game Starts Event Component should match snapshot when rendered.
statusReason: Snapshot `Game Starts Event Component > should match snapshot when rendered. 1` mismatched
