[Killed] ObjectLiteral
app.vue:20:9
 
 const { t } = useI18n();
 
-useHead({
-  title: t("shared.werewolvesAssistant"),
-  meta: [
-    { name: "application-name", content: t("shared.werewolvesAssistant") },
-    { name: "creator", content: "Antoine ZANARDI" },
-    { name: "description", content: t("components.App.seoDescription") },
-    { name: "viewport", content: "width=device-width, initial-scale=1" },
-    { name: "charset", content: "utf-8" },
-    { name: "generator", content: "nuxt" },
-    { name: "color-scheme", content: "dark" },
-  ],
-});
+useHead({});
 
 void rolesStore.fetchAndSetRoles();
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",

[Killed] StringLiteral
app.vue:21:12
 const { t } = useI18n();
 
 useHead({
-  title: t("shared.werewolvesAssistant"),
+  title: t(""),
   meta: [
     { name: "application-name", content: t("shared.werewolvesAssistant") },
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",

[Killed] ArrayDeclaration
app.vue:22:9
 
 useHead({
   title: t("shared.werewolvesAssistant"),
-  meta: [
-    { name: "application-name", content: t("shared.werewolvesAssistant") },
-    { name: "creator", content: "Antoine ZANARDI" },
-    { name: "description", content: t("components.App.seoDescription") },
-    { name: "viewport", content: "width=device-width, initial-scale=1" },
-    { name: "charset", content: "utf-8" },
-    { name: "generator", content: "nuxt" },
-    { name: "color-scheme", content: "dark" },
-  ],
+  meta: [],
 });
 
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",

[Killed] ObjectLiteral
app.vue:23:5
 useHead({
   title: t("shared.werewolvesAssistant"),
   meta: [
-    { name: "application-name", content: t("shared.werewolvesAssistant") },
+    {},
     { name: "creator", content: "Antoine ZANARDI" },
     { name: "description", content: t("components.App.seoDescription") },
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",

[Killed] StringLiteral
app.vue:25:13
   meta: [
     { name: "application-name", content: t("shared.werewolvesAssistant") },
     { name: "creator", content: "Antoine ZANARDI" },
-    { name: "description", content: t("components.App.seoDescription") },
+    { name: "", content: t("components.App.seoDescription") },
     { name: "viewport", content: "width=device-width, initial-scale=1" },
     { name: "charset", content: "utf-8" },
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",

[Killed] StringLiteral
app.vue:26:34
     { name: "application-name", content: t("shared.werewolvesAssistant") },
     { name: "creator", content: "Antoine ZANARDI" },
     { name: "description", content: t("components.App.seoDescription") },
-    { name: "viewport", content: "width=device-width, initial-scale=1" },
+    { name: "viewport", content: "" },
     { name: "charset", content: "utf-8" },
     { name: "generator", content: "nuxt" },
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",

[Killed] StringLiteral
app.vue:29:38
     { name: "viewport", content: "width=device-width, initial-scale=1" },
     { name: "charset", content: "utf-8" },
     { name: "generator", content: "nuxt" },
-    { name: "color-scheme", content: "dark" },
+    { name: "color-scheme", content: "" },
   ],
 });
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",

[Killed] ObjectLiteral
app.vue:29:5
     { name: "viewport", content: "width=device-width, initial-scale=1" },
     { name: "charset", content: "utf-8" },
     { name: "generator", content: "nuxt" },
-    { name: "color-scheme", content: "dark" },
+    {},
   ],
 });
killedBy: App Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "shared.werewolvesAssistant",
        "name": "application-name",
