[Killed] ArrowFunction
default/NavBar/ParametersMenu/ParametersMenu.vue:36:42
 const { t } = useI18n();
 const { addSuccessToast } = useVuePrimeToasts();
 
-const gameMenuItems = computed<MenuItem>(() => ({
-  visible: !!game.value._id,
-  label: t("components.ParametersMenu.game"),
-  items: [
-    {
-      label: t("components.ParametersMenu.cancelGame"),
-      icon: "fa fa-ban text-danger",
-      disabled: game.value.status !== "playing",
-      command: (): void => {
-        cancelGame();
-      },
-    },
-  ],
-}));
+const gameMenuItems = computed<MenuItem>(() => undefined);
 
 const parametersMenuItems = computed<MenuItem[]>(() => [
killedBy: Parameters Menu Component should match snapshot when rendered.
statusReason: Snapshot `Parameters Menu Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
default/NavBar/ParametersMenu/ParametersMenu.vue:37:13
 const { addSuccessToast } = useVuePrimeToasts();
 
 const gameMenuItems = computed<MenuItem>(() => ({
-  visible: !!game.value._id,
+  visible: !game.value._id,
   label: t("components.ParametersMenu.game"),
   items: [
killedBy: Parameters Menu Component Parameters Menu should show success toast when game is canceled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] StringLiteral
default/NavBar/ParametersMenu/ParametersMenu.vue:38:12
 
 const gameMenuItems = computed<MenuItem>(() => ({
   visible: !!game.value._id,
-  label: t("components.ParametersMenu.game"),
+  label: t(""),
   items: [
     {
killedBy: Parameters Menu Component Parameters Menu should pass the default items to the menu when rendered.
statusReason: expected [ { visible: false, …(2) }, { …(4) } ] to strictly equal [ { visible: false, …(2) }, { …(4) } ]

[Killed] ArrayDeclaration
default/NavBar/ParametersMenu/ParametersMenu.vue:39:10
 const gameMenuItems = computed<MenuItem>(() => ({
   visible: !!game.value._id,
   label: t("components.ParametersMenu.game"),
-  items: [
-    {
-      label: t("components.ParametersMenu.cancelGame"),
-      icon: "fa fa-ban text-danger",
-      disabled: game.value.status !== "playing",
-      command: (): void => {
-        cancelGame();
-      },
-    },
-  ],
+  items: [],
 }));
 
killedBy: Parameters Menu Component Parameters Menu should show success toast when game is canceled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] EqualityOperator
default/NavBar/ParametersMenu/ParametersMenu.vue:43:17
     {
       label: t("components.ParametersMenu.cancelGame"),
       icon: "fa fa-ban text-danger",
-      disabled: game.value.status !== "playing",
+      disabled: game.value.status === "playing",
       command: (): void => {
         cancelGame();
killedBy: Parameters Menu Component Parameters Menu should show success toast when game is canceled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
default/NavBar/ParametersMenu/ParametersMenu.vue:43:17
     {
       label: t("components.ParametersMenu.cancelGame"),
       icon: "fa fa-ban text-danger",
-      disabled: game.value.status !== "playing",
+      disabled: false,
       command: (): void => {
         cancelGame();
killedBy: Parameters Menu Component Parameters Menu should pass the default items to the menu when rendered.
statusReason: expected [ { visible: false, …(2) }, { …(4) } ] to strictly equal [ { visible: false, …(2) }, { …(4) } ]

[Killed] BlockStatement
default/NavBar/ParametersMenu/ParametersMenu.vue:44:28
       label: t("components.ParametersMenu.cancelGame"),
       icon: "fa fa-ban text-danger",
       disabled: game.value.status !== "playing",
-      command: (): void => {
-        cancelGame();
-      },
+      command: (): void => {},
     },
   ],
killedBy: Parameters Menu Component Parameters Menu should show success toast when game is canceled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
default/NavBar/ParametersMenu/ParametersMenu.vue:51:50
   ],
 }));
 
-const parametersMenuItems = computed<MenuItem[]>(() => [
-  gameMenuItems.value,
-  {
-    label: t("components.ParametersMenu.backToHome"),
-    icon: "fa fa-sign-out",
-    arialLabel: t("components.ParametersMenu.backToHome"),
-    command(): void {
-      void navigateTo("/");
-    },
-  },
-]);
+const parametersMenuItems = computed<MenuItem[]>(() => undefined);
 
 const parametersMenu = ref<InstanceType<typeof VuePrimeMenu> | null>(null);
killedBy: Parameters Menu Component should match snapshot when rendered.
statusReason: Snapshot `Parameters Menu Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
default/NavBar/ParametersMenu/ParametersMenu.vue:55:11
   gameMenuItems.value,
   {
     label: t("components.ParametersMenu.backToHome"),
-    icon: "fa fa-sign-out",
+    icon: "",
     arialLabel: t("components.ParametersMenu.backToHome"),
     command(): void {
killedBy: Parameters Menu Component Parameters Menu should pass the default items to the menu when rendered.
statusReason: expected [ { visible: false, …(2) }, { …(4) } ] to strictly equal [ { visible: false, …(2) }, { …(4) } ]

[Killed] StringLiteral
default/NavBar/ParametersMenu/ParametersMenu.vue:56:19
   {
     label: t("components.ParametersMenu.backToHome"),
     icon: "fa fa-sign-out",
-    arialLabel: t("components.ParametersMenu.backToHome"),
+    arialLabel: t(""),
     command(): void {
       void navigateTo("/");
killedBy: Parameters Menu Component Parameters Menu should pass the default items to the menu when rendered.
statusReason: expected [ { visible: false, …(2) }, { …(4) } ] to strictly equal [ { visible: false, …(2) }, { …(4) } ]

[Killed] BlockStatement
default/NavBar/ParametersMenu/ParametersMenu.vue:57:21
     label: t("components.ParametersMenu.backToHome"),
     icon: "fa fa-sign-out",
     arialLabel: t("components.ParametersMenu.backToHome"),
-    command(): void {
-      void navigateTo("/");
-    },
+    command(): void {},
   },
 ]);
killedBy: Parameters Menu Component Parameters Menu should navigate to home page when clicking on back to home button.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
default/NavBar/ParametersMenu/ParametersMenu.vue:65:56
 
 const parametersMenu = ref<InstanceType<typeof VuePrimeMenu> | null>(null);
 
-function toggleParametersMenu(event: MouseEvent): void {
-  if (!parametersMenu.value) {
-    throw createError("Parameters Menu is not initialized");
-  }
-  parametersMenu.value.toggle(event);
-}
+function toggleParametersMenu(event: MouseEvent): void {}
 
 function cancelGame(): void {
killedBy: Parameters Menu Component Parameters Menu Button should open the parameters menu when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BooleanLiteral
default/NavBar/ParametersMenu/ParametersMenu.vue:66:7
 const parametersMenu = ref<InstanceType<typeof VuePrimeMenu> | null>(null);
 
 function toggleParametersMenu(event: MouseEvent): void {
-  if (!parametersMenu.value) {
+  if (parametersMenu.value) {
     throw createError("Parameters Menu is not initialized");
   }
killedBy: Parameters Menu Component Parameters Menu Button should open the parameters menu when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
default/NavBar/ParametersMenu/ParametersMenu.vue:66:7
 const parametersMenu = ref<InstanceType<typeof VuePrimeMenu> | null>(null);
 
 function toggleParametersMenu(event: MouseEvent): void {
-  if (!parametersMenu.value) {
+  if (true) {
     throw createError("Parameters Menu is not initialized");
   }
killedBy: Parameters Menu Component Parameters Menu Button should open the parameters menu when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
default/NavBar/ParametersMenu/ParametersMenu.vue:72:29
   parametersMenu.value.toggle(event);
 }
 
-function cancelGame(): void {
-  void cancelGameFromStore();
-  addSuccessToast({ summary: t("components.ParametersMenu.gameCanceled") });
-}
+function cancelGame(): void {}
 </script>
killedBy: Parameters Menu Component Parameters Menu should show success toast when game is canceled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ObjectLiteral
default/NavBar/ParametersMenu/ParametersMenu.vue:74:19
 
 function cancelGame(): void {
   void cancelGameFromStore();
-  addSuccessToast({ summary: t("components.ParametersMenu.gameCanceled") });
+  addSuccessToast({});
 }
 </script>
killedBy: Parameters Menu Component Parameters Menu should show success toast when game is canceled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "summary": "components.ParametersMenu.gameCanceled",
  },
], but it was called with Object {}
