[Killed] BlockStatement
about/AboutAvailableRoles/AboutAvailableRoleDescription/AboutAvailableRoleDescription.vue:48:69
 
 const { getRoleNameLabel } = useRoleName();
 
-function getRoleDescriptionLeftImageAlt(roleName: RoleName): string {
-  return t("components.AboutAvailableRoleDescription.roleDescriptionLeftImageAlt", { role: getRoleNameLabel(roleName) });
-}
+function getRoleDescriptionLeftImageAlt(roleName: RoleName): string {}
 </script>
 
killedBy: About Available Role Description Component should match snapshot when rendered.
statusReason: Snapshot `About Available Role Description Component > should match snapshot when rendered. 1` mismatched
