[Killed] BlockStatement
pages/about/AboutAvailableRoles/AboutAvailableRoles.vue:79:63
 const { getRoleNameLabel } = useRoleName();
 const { roles } = storeToRefs(useRolesStore());
 
-const availableRolesText = computed<string | undefined>(() => {
-  if (!roles.value) {
-    return undefined;
-  }
-  return t("components.AboutAvailableRoles.assistantHasManyRoles", roles.value.length);
-});
+const availableRolesText = computed<string | undefined>(() => {});
 
 function getAvailableRoleAccordionHeaderAriaLabel(roleName: RoleName): string {
killedBy: About Available Roles Component Available Roles Accordion Roles are set should translate first section when roles are set.
statusReason: expected '' to be 'components.AboutAvailableRoles.assist…' // Object.is equality

[Killed] BooleanLiteral
pages/about/AboutAvailableRoles/AboutAvailableRoles.vue:80:7
 const { roles } = storeToRefs(useRolesStore());
 
 const availableRolesText = computed<string | undefined>(() => {
-  if (!roles.value) {
+  if (roles.value) {
     return undefined;
   }
killedBy: About Available Roles Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ConditionalExpression
pages/about/AboutAvailableRoles/AboutAvailableRoles.vue:80:7
 const { roles } = storeToRefs(useRolesStore());
 
 const availableRolesText = computed<string | undefined>(() => {
-  if (!roles.value) {
+  if (false) {
     return undefined;
   }
killedBy: About Available Roles Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] BlockStatement
pages/about/AboutAvailableRoles/AboutAvailableRoles.vue:86:79
   return t("components.AboutAvailableRoles.assistantHasManyRoles", roles.value.length);
 });
 
-function getAvailableRoleAccordionHeaderAriaLabel(roleName: RoleName): string {
-  return t("components.AboutAvailableRoles.clickToExpandRoleDescription", { role: getRoleNameLabel(roleName) });
-}
+function getAvailableRoleAccordionHeaderAriaLabel(roleName: RoleName): string {}
 
 function getAvailableRoleHeaderImageAlt(roleName: RoleName): string {
killedBy: About Available Roles Component Available Roles Accordion Roles are set should render roles accordion tabs with header aria labels when roles are set.
statusReason: expected { headerAction: { …(1) } } to strictly equal { Object (headerAction) }

[Killed] BlockStatement
pages/about/AboutAvailableRoles/AboutAvailableRoles.vue:90:69
   return t("components.AboutAvailableRoles.clickToExpandRoleDescription", { role: getRoleNameLabel(roleName) });
 }
 
-function getAvailableRoleHeaderImageAlt(roleName: RoleName): string {
-  return t("components.AboutAvailableRoles.availableRoleImage", { role: getRoleNameLabel(roleName) });
-}
+function getAvailableRoleHeaderImageAlt(roleName: RoleName): string {}
 </script>
killedBy: About Available Roles Component Available Roles Accordion Roles are set should render roles accordion tabs with header images when roles are set.
statusReason: expected undefined to be 'components.AboutAvailableRoles.availa…' // Object.is equality

[Killed] ObjectLiteral
pages/about/AboutAvailableRoles/AboutAvailableRoles.vue:91:65
 }
 
 function getAvailableRoleHeaderImageAlt(roleName: RoleName): string {
-  return t("components.AboutAvailableRoles.availableRoleImage", { role: getRoleNameLabel(roleName) });
+  return t("components.AboutAvailableRoles.availableRoleImage", {});
 }
 </script>
killedBy: About Available Roles Component Available Roles Accordion Roles are set should render roles accordion tabs with header images when roles are set.
statusReason: expected 'components.AboutAvailableRoles.availa…' to be 'components.AboutAvailableRoles.availa…' // Object.is equality
