[Killed] ObjectLiteral
pages/game/GameCanceled/GameCanceled.vue:33:9
 
 const { t } = useI18n();
 
-useHead({ title: t("components.GameCanceled.gameCanceled") });
+useHead({});
 </script>
killedBy: Game Canceled Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "title": "components.GameCanceled.gameCanceled",
  },
], but it was called with Object {}
