[Killed] ArrowFunction
pages/game/GameOver/GameOver.vue:48:48
 
 const gameOverHistory = ref<GameOverHistoryExposed | null>(null);
 
-const winners = computed<Player[] | undefined>(() => game.value.victory?.winners);
+const winners = computed<Player[] | undefined>(() => undefined);
 
 function showGameHistory(): void {
killedBy: Game Over Component should match snapshot when rendered.
statusReason: Snapshot `Game Over Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
pages/game/GameOver/GameOver.vue:48:54
 
 const gameOverHistory = ref<GameOverHistoryExposed | null>(null);
 
-const winners = computed<Player[] | undefined>(() => game.value.victory?.winners);
+const winners = computed<Player[] | undefined>(() => game.value.victory.winners);
 
 function showGameHistory(): void {
killedBy: Game Over Component Game Over Winners should not display game over winners when there is no victory.
statusReason: Cannot read properties of undefined (reading 'winners')

[Killed] BlockStatement
pages/game/GameOver/GameOver.vue:50:34
 
 const winners = computed<Player[] | undefined>(() => game.value.victory?.winners);
 
-function showGameHistory(): void {
-  if (!gameOverHistory.value) {
-    throw createError("Game Over History is not defined");
-  }
-  gameOverHistory.value.showGameHistory();
-}
+function showGameHistory(): void {}
 
 void fetchAndSetGameHistoryRecords(game.value._id);
killedBy: Game Over Component Game History should show game history when the show game history button is clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
pages/game/GameOver/GameOver.vue:51:31
 const winners = computed<Player[] | undefined>(() => game.value.victory?.winners);
 
 function showGameHistory(): void {
-  if (!gameOverHistory.value) {
-    throw createError("Game Over History is not defined");
-  }
+  if (!gameOverHistory.value) {}
   gameOverHistory.value.showGameHistory();
 }
killedBy: Game Over Component Game History should throw an error when the show game history button is clicked and the game history is not defined.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game/GameOver/GameOver.vue:51:7
 const winners = computed<Player[] | undefined>(() => game.value.victory?.winners);
 
 function showGameHistory(): void {
-  if (!gameOverHistory.value) {
+  if (true) {
     throw createError("Game Over History is not defined");
   }
killedBy: Game Over Component Game History should show game history when the show game history button is clicked.
statusReason: Mocked error
