[Killed] BlockStatement
game/GameOver/GameOverActions/GameOverActions.vue:46:58
 
 const { t } = useI18n();
 
-const showGameHistoryTextButton = computed<string>(() => {
-  if (gameHistoryRecords.value.length) {
-    return t("components.GameOverActions.showGameHistory");
-  }
-  return t("components.GameOverActions.loadingGameHistory");
-});
+const showGameHistoryTextButton = computed<string>(() => {});
 
 function showGameHistory(): void {
killedBy: Game Over Actions Component should match snapshot when rendered.
statusReason: Snapshot `Game Over Actions Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game/GameOver/GameOverActions/GameOverActions.vue:47:7
 const { t } = useI18n();
 
 const showGameHistoryTextButton = computed<string>(() => {
-  if (gameHistoryRecords.value.length) {
+  if (false) {
     return t("components.GameOverActions.showGameHistory");
   }
killedBy: Game Over Actions Component Show Game History Button should translate show game history button text when the game history records have been fetched.
statusReason: expected 'components.GameOverActions.loadingGam…' to be 'components.GameOverActions.showGameHi…' // Object.is equality

[Killed] ConditionalExpression
game/GameOver/GameOverActions/GameOverActions.vue:47:7
 const { t } = useI18n();
 
 const showGameHistoryTextButton = computed<string>(() => {
-  if (gameHistoryRecords.value.length) {
+  if (true) {
     return t("components.GameOverActions.showGameHistory");
   }
killedBy: Game Over Actions Component should match snapshot when rendered.
statusReason: Snapshot `Game Over Actions Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
game/GameOver/GameOverActions/GameOverActions.vue:50:12
   if (gameHistoryRecords.value.length) {
     return t("components.GameOverActions.showGameHistory");
   }
-  return t("components.GameOverActions.loadingGameHistory");
+  return t("");
 });
 
killedBy: Game Over Actions Component should match snapshot when rendered.
statusReason: Snapshot `Game Over Actions Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game/GameOver/GameOverActions/GameOverActions.vue:53:34
   return t("components.GameOverActions.loadingGameHistory");
 });
 
-function showGameHistory(): void {
-  emit("showGameHistory");
-}
+function showGameHistory(): void {}
 </script>
killedBy: Game Over Actions Component Emits should emit show game history event when the show game history button is clicked.
statusReason: expected undefined to be truthy
