[Killed] BooleanLiteral
game/GameOver/GameOverHistory/GameOverHistory.vue:46:32
 import GameOverHistoryRecords from "~/components/pages/game/GameOver/GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecords.vue";
 import DialogFooterCloseButtonOnly from "~/components/shared/dialogs/DialogFooterCloseButtonOnly/DialogFooterCloseButtonOnly.vue";
 
-const isVisible = ref<boolean>(false);
+const isVisible = ref<boolean>(true);
 
 function showGameHistory(): void {
killedBy: Game Over History Component Dialog not open should set dialog to invisible when rendered.
statusReason: expected true to be falsy

[Killed] BlockStatement
game/GameOver/GameOverHistory/GameOverHistory.vue:48:34
 
 const isVisible = ref<boolean>(false);
 
-function showGameHistory(): void {
-  isVisible.value = true;
-}
+function showGameHistory(): void {}
 
 function close(): void {
killedBy: Game Over History Component Dialog open should set dialog to visible when showGameHistory is called.
statusReason: expected false to be truthy

[Killed] BooleanLiteral
game/GameOver/GameOverHistory/GameOverHistory.vue:49:21
 const isVisible = ref<boolean>(false);
 
 function showGameHistory(): void {
-  isVisible.value = true;
+  isVisible.value = false;
 }
 
killedBy: Game Over History Component Dialog open should set dialog to visible when showGameHistory is called.
statusReason: expected false to be truthy

[Killed] BlockStatement
game/GameOver/GameOverHistory/GameOverHistory.vue:52:24
   isVisible.value = true;
 }
 
-function close(): void {
-  isVisible.value = false;
-}
+function close(): void {}
 
 defineExpose({ showGameHistory });
killedBy: Game Over History Component Dialog open Game Over History Footer should close game history when game over history footer emits event.
statusReason: expected true to be falsy

[Killed] BooleanLiteral
game/GameOver/GameOverHistory/GameOverHistory.vue:53:21
 }
 
 function close(): void {
-  isVisible.value = false;
+  isVisible.value = true;
 }
 
killedBy: Game Over History Component Dialog open Game Over History Footer should close game history when game over history footer emits event.
statusReason: expected true to be falsy
