[Killed] BlockStatement
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecord.vue:40:68
 
 const { didSourceSkipped } = useGameHistoryRecord();
 
-const isGameHistoryRecordTargetDisplayed = computed<boolean>(() => {
-  const { type } = props.gameHistoryRecord.play;
-  const displayedTargetTypes: GamePlayType[] = ["target", "vote", "bury-dead-bodies", "choose-card", "choose-side"];
-
-  return displayedTargetTypes.includes(type) && !didSourceSkipped(props.gameHistoryRecord);
-});
+const isGameHistoryRecordTargetDisplayed = computed<boolean>(() => {});
 </script>
killedBy: Game Over History Record Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecord.vue:42:102
 
 const isGameHistoryRecordTargetDisplayed = computed<boolean>(() => {
   const { type } = props.gameHistoryRecord.play;
-  const displayedTargetTypes: GamePlayType[] = ["target", "vote", "bury-dead-bodies", "choose-card", "choose-side"];
+  const displayedTargetTypes: GamePlayType[] = ["target", "vote", "bury-dead-bodies", "choose-card", ""];
 
   return displayedTargetTypes.includes(type) && !didSourceSkipped(props.gameHistoryRecord);
killedBy: Game Over History Record Component Game History Record Decision should display game over history record decision when type is choose-side and play is not skipped.
statusReason: expected false to be truthy

[Killed] ArrayDeclaration
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecord.vue:42:48
 
 const isGameHistoryRecordTargetDisplayed = computed<boolean>(() => {
   const { type } = props.gameHistoryRecord.play;
-  const displayedTargetTypes: GamePlayType[] = ["target", "vote", "bury-dead-bodies", "choose-card", "choose-side"];
+  const displayedTargetTypes: GamePlayType[] = [];
 
   return displayedTargetTypes.includes(type) && !didSourceSkipped(props.gameHistoryRecord);
killedBy: Game Over History Record Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecord.vue:44:10
   const { type } = props.gameHistoryRecord.play;
   const displayedTargetTypes: GamePlayType[] = ["target", "vote", "bury-dead-bodies", "choose-card", "choose-side"];
 
-  return displayedTargetTypes.includes(type) && !didSourceSkipped(props.gameHistoryRecord);
+  return true;
 });
 </script>
killedBy: Game Over History Record Component Game History Record Decision should not display game over history record decision when type is no-action.
statusReason: expected true to be falsy

[Killed] BooleanLiteral
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecord.vue:44:49
   const { type } = props.gameHistoryRecord.play;
   const displayedTargetTypes: GamePlayType[] = ["target", "vote", "bury-dead-bodies", "choose-card", "choose-side"];
 
-  return displayedTargetTypes.includes(type) && !didSourceSkipped(props.gameHistoryRecord);
+  return displayedTargetTypes.includes(type) && didSourceSkipped(props.gameHistoryRecord);
 });
 </script>
killedBy: Game Over History Record Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Component > should match snapshot when rendered. 1` mismatched
