[Killed] BlockStatement
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:30:60
 
 const { didSourceSkipped } = useGameHistoryRecord();
 
-const gameHistoryRecordActionText = computed<string>(() => {
-  if (didSourceSkipped(props.gameHistoryRecord)) {
-    return t("components.GameOverHistoryRecordAction.skippedTurn");
-  }
-  const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action]?.textKey;
-  if (textKey === undefined) {
-    return t("components.GameOverHistoryRecordAction.unknownGamePlay");
-  }
-  return t(textKey);
-});
+const gameHistoryRecordActionText = computed<string>(() => {});
 
 const gameHistoryRecordActionTextIcon = computed<string>(() => {
killedBy: Game Over History Record Action Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Action Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:31:7
 const { didSourceSkipped } = useGameHistoryRecord();
 
 const gameHistoryRecordActionText = computed<string>(() => {
-  if (didSourceSkipped(props.gameHistoryRecord)) {
+  if (true) {
     return t("components.GameOverHistoryRecordAction.skippedTurn");
   }
killedBy: Game Over History Record Action Component Action Text 'should have infected text when game h…'
statusReason: expected 'components.GameOverHistoryRecordActio…' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] BlockStatement
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:31:50
 const { didSourceSkipped } = useGameHistoryRecord();
 
 const gameHistoryRecordActionText = computed<string>(() => {
-  if (didSourceSkipped(props.gameHistoryRecord)) {
-    return t("components.GameOverHistoryRecordAction.skippedTurn");
-  }
+  if (didSourceSkipped(props.gameHistoryRecord)) {}
   const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action]?.textKey;
   if (textKey === undefined) {
killedBy: Game Over History Record Action Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Action Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:32:14
 
 const gameHistoryRecordActionText = computed<string>(() => {
   if (didSourceSkipped(props.gameHistoryRecord)) {
-    return t("components.GameOverHistoryRecordAction.skippedTurn");
+    return t("");
   }
   const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action]?.textKey;
killedBy: Game Over History Record Action Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Action Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:34:19
   if (didSourceSkipped(props.gameHistoryRecord)) {
     return t("components.GameOverHistoryRecordAction.skippedTurn");
   }
-  const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action]?.textKey;
+  const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action].textKey;
   if (textKey === undefined) {
     return t("components.GameOverHistoryRecordAction.unknownGamePlay");
killedBy: Game Over History Record Action Component Action Text 'should have unknown play text when ga…'
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:35:7
     return t("components.GameOverHistoryRecordAction.skippedTurn");
   }
   const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action]?.textKey;
-  if (textKey === undefined) {
+  if (false) {
     return t("components.GameOverHistoryRecordAction.unknownGamePlay");
   }
killedBy: Game Over History Record Action Component Action Text 'should have unknown play text when ga…'
statusReason: expected '' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] EqualityOperator
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:35:7
     return t("components.GameOverHistoryRecordAction.skippedTurn");
   }
   const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action]?.textKey;
-  if (textKey === undefined) {
+  if (textKey !== undefined) {
     return t("components.GameOverHistoryRecordAction.unknownGamePlay");
   }
killedBy: Game Over History Record Action Component Action Text 'should have infected text when game h…'
statusReason: expected 'components.GameOverHistoryRecordActio…' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] StringLiteral
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:36:14
   }
   const textKey = GAME_HISTORY_RECORD_PLAYS_TEXT[props.gameHistoryRecord.play.source.name][props.gameHistoryRecord.play.action]?.textKey;
   if (textKey === undefined) {
-    return t("components.GameOverHistoryRecordAction.unknownGamePlay");
+    return t("");
   }
   return t(textKey);
killedBy: Game Over History Record Action Component Action Text 'should have unknown play text when ga…'
statusReason: expected '' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] BlockStatement
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:41:64
   return t(textKey);
 });
 
-const gameHistoryRecordActionTextIcon = computed<string>(() => {
-  const { action } = props.gameHistoryRecord.play;
-  if (didSourceSkipped(props.gameHistoryRecord)) {
-    return "/svg/game/player/player-attribute/powerless.svg";
-  }
-  if (action === "growl" || action === "request-another-vote") {
-    return "/svg/misc/exclamation-mark.svg";
-  }
-  if (action === "meet-each-other") {
-    return "/svg/misc/people.svg";
-  }
-  return "/svg/misc/arrow-right.svg";
-});
+const gameHistoryRecordActionTextIcon = computed<string>(() => {});
 </script>
killedBy: Game Over History Record Action Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Action Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:43:50
 
 const gameHistoryRecordActionTextIcon = computed<string>(() => {
   const { action } = props.gameHistoryRecord.play;
-  if (didSourceSkipped(props.gameHistoryRecord)) {
-    return "/svg/game/player/player-attribute/powerless.svg";
-  }
+  if (didSourceSkipped(props.gameHistoryRecord)) {}
   if (action === "growl" || action === "request-another-vote") {
     return "/svg/misc/exclamation-mark.svg";
killedBy: Game Over History Record Action Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Action Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:43:7
 
 const gameHistoryRecordActionTextIcon = computed<string>(() => {
   const { action } = props.gameHistoryRecord.play;
-  if (didSourceSkipped(props.gameHistoryRecord)) {
+  if (true) {
     return "/svg/game/player/player-attribute/powerless.svg";
   }
killedBy: Game Over History Record Action Component Action Icon 'should have exclamation mark icon whe…'
statusReason: expected '/svg/game/player/player-attribute/pow…' to be '/svg/misc/exclamation-mark.svg' // Object.is equality

[Killed] BlockStatement
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:46:64
   if (didSourceSkipped(props.gameHistoryRecord)) {
     return "/svg/game/player/player-attribute/powerless.svg";
   }
-  if (action === "growl" || action === "request-another-vote") {
-    return "/svg/misc/exclamation-mark.svg";
-  }
+  if (action === "growl" || action === "request-another-vote") {}
   if (action === "meet-each-other") {
     return "/svg/misc/people.svg";
killedBy: Game Over History Record Action Component Action Icon 'should have exclamation mark icon whe…'
statusReason: expected '/svg/misc/arrow-right.svg' to be '/svg/misc/exclamation-mark.svg' // Object.is equality

[Killed] ConditionalExpression
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:46:7
   if (didSourceSkipped(props.gameHistoryRecord)) {
     return "/svg/game/player/player-attribute/powerless.svg";
   }
-  if (action === "growl" || action === "request-another-vote") {
+  if (false) {
     return "/svg/misc/exclamation-mark.svg";
   }
killedBy: Game Over History Record Action Component Action Icon 'should have exclamation mark icon whe…'
statusReason: expected '/svg/misc/arrow-right.svg' to be '/svg/misc/exclamation-mark.svg' // Object.is equality

[Killed] EqualityOperator
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:49:7
   if (action === "growl" || action === "request-another-vote") {
     return "/svg/misc/exclamation-mark.svg";
   }
-  if (action === "meet-each-other") {
+  if (action !== "meet-each-other") {
     return "/svg/misc/people.svg";
   }
killedBy: Game Over History Record Action Component Action Icon 'should have people icon when game his…'
statusReason: expected '/svg/misc/arrow-right.svg' to be '/svg/misc/people.svg' // Object.is equality

[Killed] ConditionalExpression
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordAction/GameOverHistoryRecordAction.vue:49:7
   if (action === "growl" || action === "request-another-vote") {
     return "/svg/misc/exclamation-mark.svg";
   }
-  if (action === "meet-each-other") {
+  if (true) {
     return "/svg/misc/people.svg";
   }
killedBy: Game Over History Record Action Component Action Icon 'should have arrow right icon when gam…'
statusReason: expected '/svg/misc/people.svg' to be '/svg/misc/arrow-right.svg' // Object.is equality
