[Killed] BlockStatement
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayer/GameOverHistoryRecordDecisionBuriedPlayer.vue:36:48
 
 const props = defineProps<GameOverHistoryRecordDecisionBuriedPlayerProps>();
 
-const isTagDisplayed = computed<boolean>(() => {
-  const target = props.gameHistoryRecord.play.targets?.[0];
-
-  return !!target && target.player._id === props.buriedPlayer._id;
-});
+const isTagDisplayed = computed<boolean>(() => {});
 </script>
killedBy: Game Over History Record Decision Buried Player Component Devoted Servant Tag should render Devoted Servant Tag when the target is the buried player.
statusReason: expected false to be truthy

[Killed] OptionalChaining
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayer/GameOverHistoryRecordDecisionBuriedPlayer.vue:37:18
 const props = defineProps<GameOverHistoryRecordDecisionBuriedPlayerProps>();
 
 const isTagDisplayed = computed<boolean>(() => {
-  const target = props.gameHistoryRecord.play.targets?.[0];
+  const target = props.gameHistoryRecord.play.targets[0];
 
   return !!target && target.player._id === props.buriedPlayer._id;
killedBy: Game Over History Record Decision Buried Player Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] BooleanLiteral
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayer/GameOverHistoryRecordDecisionBuriedPlayer.vue:39:11
 const isTagDisplayed = computed<boolean>(() => {
   const target = props.gameHistoryRecord.play.targets?.[0];
 
-  return !!target && target.player._id === props.buriedPlayer._id;
+  return !target && target.player._id === props.buriedPlayer._id;
 });
 </script>
killedBy: Game Over History Record Decision Buried Player Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".
