[Killed] BlockStatement
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayers.vue:32:48
 
 const maximumBuriedPlayersDisplayed = 3;
 
-const buriedPlayers = computed<Player[]>(() => {
-  const { interactions } = props.gameHistoryRecord.play.source;
-  const buryDeadBodiesInteraction = interactions?.find(({ type }) => type === "bury");
-
-  return buryDeadBodiesInteraction?.eligibleTargets ?? [];
-});
+const buriedPlayers = computed<Player[]>(() => {});
 
 const truncatedBuriedPlayers = computed<Player[]>(() => buriedPlayers.value.slice(0, maximumBuriedPlayersDisplayed));
killedBy: Game Over History Record Decision Buried Players Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayers.vue:34:56
 
 const buriedPlayers = computed<Player[]>(() => {
   const { interactions } = props.gameHistoryRecord.play.source;
-  const buryDeadBodiesInteraction = interactions?.find(({ type }) => type === "bury");
+  const buryDeadBodiesInteraction = interactions?.find(() => undefined);
 
   return buryDeadBodiesInteraction?.eligibleTargets ?? [];
killedBy: Game Over History Record Decision Buried Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Buried Players Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayers.vue:34:70
 
 const buriedPlayers = computed<Player[]>(() => {
   const { interactions } = props.gameHistoryRecord.play.source;
-  const buryDeadBodiesInteraction = interactions?.find(({ type }) => type === "bury");
+  const buryDeadBodiesInteraction = interactions?.find(({ type }) => true);
 
   return buryDeadBodiesInteraction?.eligibleTargets ?? [];
killedBy: Game Over History Record Decision Buried Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Buried Players Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayers.vue:36:10
   const { interactions } = props.gameHistoryRecord.play.source;
   const buryDeadBodiesInteraction = interactions?.find(({ type }) => type === "bury");
 
-  return buryDeadBodiesInteraction?.eligibleTargets ?? [];
+  return buryDeadBodiesInteraction?.eligibleTargets && [];
 });
 
killedBy: Game Over History Record Decision Buried Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Buried Players Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayers.vue:36:10
   const { interactions } = props.gameHistoryRecord.play.source;
   const buryDeadBodiesInteraction = interactions?.find(({ type }) => type === "bury");
 
-  return buryDeadBodiesInteraction?.eligibleTargets ?? [];
+  return buryDeadBodiesInteraction.eligibleTargets ?? [];
 });
 
killedBy: Game Over History Record Decision Buried Players Component Buried Players should display no buried players when there are no interactions.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] MethodExpression
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayers.vue:39:57
   return buryDeadBodiesInteraction?.eligibleTargets ?? [];
 });
 
-const truncatedBuriedPlayers = computed<Player[]>(() => buriedPlayers.value.slice(0, maximumBuriedPlayersDisplayed));
+const truncatedBuriedPlayers = computed<Player[]>(() => buriedPlayers.value);
 </script>
killedBy: Game Over History Record Decision Buried Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Buried Players Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionBuriedPlayers/GameOverHistoryRecordDecisionBuriedPlayers.vue:39:51
   return buryDeadBodiesInteraction?.eligibleTargets ?? [];
 });
 
-const truncatedBuriedPlayers = computed<Player[]>(() => buriedPlayers.value.slice(0, maximumBuriedPlayersDisplayed));
+const truncatedBuriedPlayers = computed<Player[]>(() => undefined);
 </script>
killedBy: Game Over History Record Decision Buried Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Buried Players Component > should match snapshot when rendered. 1` mismatched
