[Killed] BlockStatement
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionChosenSide/GameOverHistoryRecordDecisionChosenSide.vue:26:54
 
 const { t } = useI18n();
 
-const chosenSideSvgIconPath = computed<string>(() => {
-  if (props.gameHistoryRecord.play.chosenSide === "villagers") {
-    return "/svg/role/villager.svg";
-  }
-  return "/svg/role/werewolf.svg";
-});
+const chosenSideSvgIconPath = computed<string>(() => {});
 
 const chosenSideText = computed<string>(() => t(`shared.role.definiteSide.${props.gameHistoryRecord.play.chosenSide}`));
killedBy: Game Over History Record Decision Chosen Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Chosen Side Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionChosenSide/GameOverHistoryRecordDecisionChosenSide.vue:27:7
 const { t } = useI18n();
 
 const chosenSideSvgIconPath = computed<string>(() => {
-  if (props.gameHistoryRecord.play.chosenSide === "villagers") {
+  if (false) {
     return "/svg/role/villager.svg";
   }
killedBy: Game Over History Record Decision Chosen Side Component Chosen Side Icon should render the chosen villagers side icon when rendered.
statusReason: expected '/svg/role/werewolf.svg' to be '/svg/role/villager.svg' // Object.is equality

[Killed] ConditionalExpression
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionChosenSide/GameOverHistoryRecordDecisionChosenSide.vue:27:7
 const { t } = useI18n();
 
 const chosenSideSvgIconPath = computed<string>(() => {
-  if (props.gameHistoryRecord.play.chosenSide === "villagers") {
+  if (true) {
     return "/svg/role/villager.svg";
   }
killedBy: Game Over History Record Decision Chosen Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Chosen Side Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionChosenSide/GameOverHistoryRecordDecisionChosenSide.vue:30:10
   if (props.gameHistoryRecord.play.chosenSide === "villagers") {
     return "/svg/role/villager.svg";
   }
-  return "/svg/role/werewolf.svg";
+  return "";
 });
 
killedBy: Game Over History Record Decision Chosen Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Chosen Side Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionChosenSide/GameOverHistoryRecordDecisionChosenSide.vue:33:41
   return "/svg/role/werewolf.svg";
 });
 
-const chosenSideText = computed<string>(() => t(`shared.role.definiteSide.${props.gameHistoryRecord.play.chosenSide}`));
+const chosenSideText = computed<string>(() => undefined);
 </script>
killedBy: Game Over History Record Decision Chosen Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Chosen Side Component > should match snapshot when rendered. 1` mismatched
