[Killed] BlockStatement
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionNominatedPlayers/GameOverHistoryRecordDecisionNominatedPlayers.vue:36:51
 
 const maximumNominatedPlayersDisplayed = 3;
 
-const nominatedPlayers = computed<Player[]>(() => {
-  const { voting } = props.gameHistoryRecord.play;
-
-  return voting?.nominatedPlayers ?? [];
-});
+const nominatedPlayers = computed<Player[]>(() => {});
 
 const truncatedNominatedPlayers = computed<Player[]>(() => nominatedPlayers.value.slice(0, maximumNominatedPlayersDisplayed));
killedBy: Game Over History Record Decision Nominated Players Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] OptionalChaining
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionNominatedPlayers/GameOverHistoryRecordDecisionNominatedPlayers.vue:39:10
 const nominatedPlayers = computed<Player[]>(() => {
   const { voting } = props.gameHistoryRecord.play;
 
-  return voting?.nominatedPlayers ?? [];
+  return voting.nominatedPlayers ?? [];
 });
 
killedBy: Game Over History Record Decision Nominated Players Component Nominated Players should not render the nominated players when there are no voting results.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionNominatedPlayers/GameOverHistoryRecordDecisionNominatedPlayers.vue:39:10
 const nominatedPlayers = computed<Player[]>(() => {
   const { voting } = props.gameHistoryRecord.play;
 
-  return voting?.nominatedPlayers ?? [];
+  return voting?.nominatedPlayers && [];
 });
 
killedBy: Game Over History Record Decision Nominated Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Nominated Players Component > should match snapshot when rendered. 1` mismatched

[Killed] MethodExpression
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionNominatedPlayers/GameOverHistoryRecordDecisionNominatedPlayers.vue:42:60
   return voting?.nominatedPlayers ?? [];
 });
 
-const truncatedNominatedPlayers = computed<Player[]>(() => nominatedPlayers.value.slice(0, maximumNominatedPlayersDisplayed));
+const truncatedNominatedPlayers = computed<Player[]>(() => nominatedPlayers.value);
 </script>
killedBy: Game Over History Record Decision Nominated Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Nominated Players Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionNominatedPlayers/GameOverHistoryRecordDecisionNominatedPlayers.vue:42:54
   return voting?.nominatedPlayers ?? [];
 });
 
-const truncatedNominatedPlayers = computed<Player[]>(() => nominatedPlayers.value.slice(0, maximumNominatedPlayersDisplayed));
+const truncatedNominatedPlayers = computed<Player[]>(() => undefined);
 </script>
killedBy: Game Over History Record Decision Nominated Players Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Nominated Players Component > should match snapshot when rendered. 1` mismatched
