[Killed] BooleanLiteral
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:37:49
 
 const { t } = useI18n();
 
-const isTagDisplayed = computed<boolean>(() => !!props.target.drankPotion);
+const isTagDisplayed = computed<boolean>(() => !props.target.drankPotion);
 
 const tagText = computed<string>(() => {
killedBy: Game Over History Record Decision Target Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Target Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:39:40
 
 const isTagDisplayed = computed<boolean>(() => !!props.target.drankPotion);
 
-const tagText = computed<string>(() => {
-  if (props.target.drankPotion === "life") {
-    return t("components.GameOverHistoryRecordDecisionTarget.lifePotion");
-  }
-  return t("components.GameOverHistoryRecordDecisionTarget.deathPotion");
-});
+const tagText = computed<string>(() => {});
 
 const tagIconPath = computed<string>(() => {
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should render drank life potion tag icon when the target drank a life potion.
statusReason: Cannot call attributes on an empty VueWrapper.

[Killed] ConditionalExpression
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:40:7
 const isTagDisplayed = computed<boolean>(() => !!props.target.drankPotion);
 
 const tagText = computed<string>(() => {
-  if (props.target.drankPotion === "life") {
+  if (false) {
     return t("components.GameOverHistoryRecordDecisionTarget.lifePotion");
   }
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should render drank life potion tag icon when the target drank a life potion.
statusReason: Cannot call attributes on an empty VueWrapper.

[Killed] EqualityOperator
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:40:7
 const isTagDisplayed = computed<boolean>(() => !!props.target.drankPotion);
 
 const tagText = computed<string>(() => {
-  if (props.target.drankPotion === "life") {
+  if (props.target.drankPotion !== "life") {
     return t("components.GameOverHistoryRecordDecisionTarget.lifePotion");
   }
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should render drank life potion tag icon when the target drank a life potion.
statusReason: Cannot call attributes on an empty VueWrapper.

[Killed] StringLiteral
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:41:14
 
 const tagText = computed<string>(() => {
   if (props.target.drankPotion === "life") {
-    return t("components.GameOverHistoryRecordDecisionTarget.lifePotion");
+    return t("");
   }
   return t("components.GameOverHistoryRecordDecisionTarget.deathPotion");
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should render drank life potion tag icon when the target drank a life potion.
statusReason: Cannot call attributes on an empty VueWrapper.

[Killed] BlockStatement
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:46:44
   return t("components.GameOverHistoryRecordDecisionTarget.deathPotion");
 });
 
-const tagIconPath = computed<string>(() => {
-  if (props.target.drankPotion === "life") {
-    return "/svg/game/player/player-attribute/drank-life-potion.svg";
-  }
-  return "/svg/game/player/player-attribute/drank-death-potion.svg";
-});
+const tagIconPath = computed<string>(() => {});
 
 const tagSeverity = computed<"danger" | "success">(() => {
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should render drank life potion tag icon when the target drank a life potion.
statusReason: expected undefined to be '/svg/game/player/player-attribute/dra…' // Object.is equality

[Killed] ConditionalExpression
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:47:7
 });
 
 const tagIconPath = computed<string>(() => {
-  if (props.target.drankPotion === "life") {
+  if (false) {
     return "/svg/game/player/player-attribute/drank-life-potion.svg";
   }
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should render drank life potion tag icon when the target drank a life potion.
statusReason: expected '/svg/game/player/player-attribute/dra…' to be '/svg/game/player/player-attribute/dra…' // Object.is equality

[Killed] ConditionalExpression
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:47:7
 });
 
 const tagIconPath = computed<string>(() => {
-  if (props.target.drankPotion === "life") {
+  if (true) {
     return "/svg/game/player/player-attribute/drank-life-potion.svg";
   }
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank death potion should render drank death potion tag icon when the target drank a death potion.
statusReason: expected '/svg/game/player/player-attribute/dra…' to be '/svg/game/player/player-attribute/dra…' // Object.is equality

[Killed] BlockStatement
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:53:58
   return "/svg/game/player/player-attribute/drank-death-potion.svg";
 });
 
-const tagSeverity = computed<"danger" | "success">(() => {
-  if (props.target.drankPotion === "life") {
-    return "success";
-  }
-  return "danger";
-});
+const tagSeverity = computed<"danger" | "success">(() => {});
 </script>
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should set severity to success when the target drank a life potion.
statusReason: expected undefined to be 'success' // Object.is equality

[Killed] BlockStatement
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:54:44
 });
 
 const tagSeverity = computed<"danger" | "success">(() => {
-  if (props.target.drankPotion === "life") {
-    return "success";
-  }
+  if (props.target.drankPotion === "life") {}
   return "danger";
 });
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should set severity to success when the target drank a life potion.
statusReason: expected 'danger' to be 'success' // Object.is equality

[Killed] ConditionalExpression
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:54:7
 });
 
 const tagSeverity = computed<"danger" | "success">(() => {
-  if (props.target.drankPotion === "life") {
+  if (false) {
     return "success";
   }
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank life potion should set severity to success when the target drank a life potion.
statusReason: expected 'danger' to be 'success' // Object.is equality

[Killed] StringLiteral
GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTarget/GameOverHistoryRecordDecisionTarget.vue:57:10
   if (props.target.drankPotion === "life") {
     return "success";
   }
-  return "danger";
+  return "";
 });
 </script>
killedBy: Game Over History Record Decision Target Component Drank potion tag Target drank death potion should set severity to danger when the target drank a death potion.
statusReason: expected '' to be 'danger' // Object.is equality
