[Killed] LogicalOperator
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTargets.vue:31:63
 
 const maximumTargetsDisplayed = 3;
 
-const targets = computed<GameHistoryRecordPlayTarget[]>(() => props.gameHistoryRecord.play.targets ?? []);
+const targets = computed<GameHistoryRecordPlayTarget[]>(() => props.gameHistoryRecord.play.targets && []);
 
 const truncatedTargets = computed<GameHistoryRecordPlayTarget[]>(() => targets.value.slice(0, maximumTargetsDisplayed));
killedBy: Game Over History Record Decision Targets Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Targets Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTargets.vue:31:57
 
 const maximumTargetsDisplayed = 3;
 
-const targets = computed<GameHistoryRecordPlayTarget[]>(() => props.gameHistoryRecord.play.targets ?? []);
+const targets = computed<GameHistoryRecordPlayTarget[]>(() => undefined);
 
 const truncatedTargets = computed<GameHistoryRecordPlayTarget[]>(() => targets.value.slice(0, maximumTargetsDisplayed));
killedBy: Game Over History Record Decision Targets Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTargets.vue:33:66
 
 const targets = computed<GameHistoryRecordPlayTarget[]>(() => props.gameHistoryRecord.play.targets ?? []);
 
-const truncatedTargets = computed<GameHistoryRecordPlayTarget[]>(() => targets.value.slice(0, maximumTargetsDisplayed));
+const truncatedTargets = computed<GameHistoryRecordPlayTarget[]>(() => undefined);
 </script>
killedBy: Game Over History Record Decision Targets Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Targets Component > should match snapshot when rendered. 1` mismatched

[Killed] MethodExpression
GameOverHistoryRecord/GameOverHistoryRecordDecision/GameOverHistoryRecordDecisionTargets/GameOverHistoryRecordDecisionTargets.vue:33:72
 
 const targets = computed<GameHistoryRecordPlayTarget[]>(() => props.gameHistoryRecord.play.targets ?? []);
 
-const truncatedTargets = computed<GameHistoryRecordPlayTarget[]>(() => targets.value.slice(0, maximumTargetsDisplayed));
+const truncatedTargets = computed<GameHistoryRecordPlayTarget[]>(() => targets.value);
 </script>
killedBy: Game Over History Record Decision Targets Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Decision Targets Component > should match snapshot when rendered. 1` mismatched
