[Killed] BlockStatement
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordSource/GameOverHistoryRecordSource.vue:47:69
 
 const { getDefiniteGameSourceNameLabel } = useGameSourceName();
 
-const gameHistoryRecordPlaySourceNameLabel = computed<string>(() => {
-  const { source } = props.gameHistoryRecord.play;
-
-  return getDefiniteGameSourceNameLabel(source.name, source.players.length);
-});
+const gameHistoryRecordPlaySourceNameLabel = computed<string>(() => {});
 
 const maximumSourcePlayersDisplayed = 3;
killedBy: Game Over History Record Source Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Source Component > should match snapshot when rendered. 1` mismatched

[Killed] MethodExpression
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordSource/GameOverHistoryRecordSource.vue:55:65
 
 const maximumSourcePlayersDisplayed = 3;
 
-const shuffledTruncatedSourcePlayers = computed<Player[]>(() => shuffle(props.gameHistoryRecord.play.source.players).slice(0, maximumSourcePlayersDisplayed));
+const shuffledTruncatedSourcePlayers = computed<Player[]>(() => shuffle(props.gameHistoryRecord.play.source.players));
 </script>
killedBy: Game Over History Record Source Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Source Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GameOverHistoryRecords/GameOverHistoryRecord/GameOverHistoryRecordSource/GameOverHistoryRecordSource.vue:55:59
 
 const maximumSourcePlayersDisplayed = 3;
 
-const shuffledTruncatedSourcePlayers = computed<Player[]>(() => shuffle(props.gameHistoryRecord.play.source.players).slice(0, maximumSourcePlayersDisplayed));
+const shuffledTruncatedSourcePlayers = computed<Player[]>(() => undefined);
 </script>
killedBy: Game Over History Record Source Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Source Component > should match snapshot when rendered. 1` mismatched
