[Killed] BlockStatement
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecordIcon/GameOverHistoryRecordIcon.vue:19:58
 
 const props = defineProps<GameOverHistoryRecordProps>();
 
-const gameHistoryRecordIconPath = computed<string>(() => {
-  const { gameHistoryRecord } = props;
-  const { source, action } = gameHistoryRecord.play;
-
-  const svgPath = GAME_PLAYS_TEXT_AND_SVG[source.name][action]?.svgPath;
-
-  return svgPath ?? "/svg/misc/question-mark.svg";
-});
+const gameHistoryRecordIconPath = computed<string>(() => {});
 </script>
killedBy: Game Over History Record Icon Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Icon Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecordIcon/GameOverHistoryRecordIcon.vue:23:19
   const { gameHistoryRecord } = props;
   const { source, action } = gameHistoryRecord.play;
 
-  const svgPath = GAME_PLAYS_TEXT_AND_SVG[source.name][action]?.svgPath;
+  const svgPath = GAME_PLAYS_TEXT_AND_SVG[source.name][action].svgPath;
 
   return svgPath ?? "/svg/misc/question-mark.svg";
killedBy: Game Over History Record Icon Component Icon should return question mark icon when the game history record icon is not found.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] LogicalOperator
GameOverHistory/GameOverHistoryRecords/GameOverHistoryRecordIcon/GameOverHistoryRecordIcon.vue:25:10
 
   const svgPath = GAME_PLAYS_TEXT_AND_SVG[source.name][action]?.svgPath;
 
-  return svgPath ?? "/svg/misc/question-mark.svg";
+  return svgPath && "/svg/misc/question-mark.svg";
 });
 </script>
killedBy: Game Over History Record Icon Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Icon Component > should match snapshot when rendered. 1` mismatched
