[Killed] BlockStatement
game/GameOver/GameOverVictoryText/GameOverVictoryText.vue:52:60
 
 const { t } = useI18n();
 
-const victoryTypeTextsAndSvg = computed<TextsAndSvg>(() => {
-  const { victory } = game.value;
-  const unknownVictoryTextsAndSvg: TextsAndSvg = {
-    text: "??",
-    subText: "??",
-    svgPath: "svg/misc/question-mark.svg",
-  };
-  if (!victory) {
-    return unknownVictoryTextsAndSvg;
-  }
-  const { textKey, subTextKey, svgPath } = VICTORY_TYPES_TEXTS_AND_SVG[victory.type];
-
-  return {
-    text: t(textKey),
-    subText: t(subTextKey),
-    svgPath,
-  };
-});
+const victoryTypeTextsAndSvg = computed<TextsAndSvg>(() => {});
 </script>
killedBy: Game Over Victory Text Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] StringLiteral
game/GameOver/GameOverVictoryText/GameOverVictoryText.vue:57:14
   const unknownVictoryTextsAndSvg: TextsAndSvg = {
     text: "??",
     subText: "??",
-    svgPath: "svg/misc/question-mark.svg",
+    svgPath: "",
   };
   if (!victory) {
killedBy: Game Over Victory Text Component should match snapshot when rendered.
statusReason: Snapshot `Game Over Victory Text Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game/GameOver/GameOverVictoryText/GameOverVictoryText.vue:59:17
     subText: "??",
     svgPath: "svg/misc/question-mark.svg",
   };
-  if (!victory) {
-    return unknownVictoryTextsAndSvg;
-  }
+  if (!victory) {}
   const { textKey, subTextKey, svgPath } = VICTORY_TYPES_TEXTS_AND_SVG[victory.type];
 
killedBy: Game Over Victory Text Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ConditionalExpression
game/GameOver/GameOverVictoryText/GameOverVictoryText.vue:59:7
     subText: "??",
     svgPath: "svg/misc/question-mark.svg",
   };
-  if (!victory) {
+  if (true) {
     return unknownVictoryTextsAndSvg;
   }
killedBy: Game Over Victory Text Component Victory Type Icon 'should render werewolves icon when vi…'
statusReason: expected 'svg/misc/question-mark.svg' to be 'svg/role/werewolf.svg' // Object.is equality
