[Killed] ArrowFunction
GamePlaying/GamePlayground/CurrentPlayExpectedPlayersToAct/CurrentPlayExpectedPlayersToAct.vue:23:49
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const expectedPlayersToAct = computed<Player[]>(() => game.value.currentPlay?.source.players ?? []);
+const expectedPlayersToAct = computed<Player[]>(() => undefined);
 </script>
killedBy: Current Play Expected Players To Act Component should match snapshot when rendered.
statusReason: Snapshot `Current Play Expected Players To Act Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
GamePlaying/GamePlayground/CurrentPlayExpectedPlayersToAct/CurrentPlayExpectedPlayersToAct.vue:23:55
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const expectedPlayersToAct = computed<Player[]>(() => game.value.currentPlay?.source.players ?? []);
+const expectedPlayersToAct = computed<Player[]>(() => game.value.currentPlay?.source.players && []);
 </script>
killedBy: Current Play Expected Players To Act Component should match snapshot when rendered.
statusReason: Snapshot `Current Play Expected Players To Act Component > should match snapshot when rendered. 1` mismatched
