[Killed] BlockStatement
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:21:52
 
 const { t } = useI18n();
 
-const currentPlayQuestion = computed<string>(() => {
-  const { currentPlay } = game.value;
-  if (!currentPlay) {
-    return t("components.CurrentPlayQuestion.unknownQuestionForCurrentPlay");
-  }
-
-  const { source, action, cause } = currentPlay;
-  const questionKey = GAME_PLAYS_QUESTIONS[source.name][action]?.[cause ?? "default"];
-
-  if (questionKey === undefined) {
-    return t("components.CurrentPlayQuestion.unknownQuestionForCurrentPlay");
-  }
-  return t(questionKey);
-});
+const currentPlayQuestion = computed<string>(() => {});
 </script>
killedBy: Current Play Question Component should match snapshot when rendered.
statusReason: Snapshot `Current Play Question Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:23:7
 
 const currentPlayQuestion = computed<string>(() => {
   const { currentPlay } = game.value;
-  if (!currentPlay) {
+  if (false) {
     return t("components.CurrentPlayQuestion.unknownQuestionForCurrentPlay");
   }
killedBy: Current Play Question Component 'should render nothing when current pl…'
statusReason: Cannot destructure property 'source' of 'currentPlay' as it is null.

[Killed] BooleanLiteral
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:23:7
 
 const currentPlayQuestion = computed<string>(() => {
   const { currentPlay } = game.value;
-  if (!currentPlay) {
+  if (currentPlay) {
     return t("components.CurrentPlayQuestion.unknownQuestionForCurrentPlay");
   }
killedBy: Current Play Question Component should match snapshot when rendered.
statusReason: Snapshot `Current Play Question Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:28:23
   }
 
   const { source, action, cause } = currentPlay;
-  const questionKey = GAME_PLAYS_QUESTIONS[source.name][action]?.[cause ?? "default"];
+  const questionKey = GAME_PLAYS_QUESTIONS[source.name][action][cause ?? "default"];
 
   if (questionKey === undefined) {
killedBy: Current Play Question Component 'should render unknown question when a…'
statusReason: Cannot read properties of undefined (reading 'default')

[Killed] LogicalOperator
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:28:67
   }
 
   const { source, action, cause } = currentPlay;
-  const questionKey = GAME_PLAYS_QUESTIONS[source.name][action]?.[cause ?? "default"];
+  const questionKey = GAME_PLAYS_QUESTIONS[source.name][action]?.[cause && "default"];
 
   if (questionKey === undefined) {
killedBy: Current Play Question Component should match snapshot when rendered.
statusReason: Snapshot `Current Play Question Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:30:34
   const { source, action, cause } = currentPlay;
   const questionKey = GAME_PLAYS_QUESTIONS[source.name][action]?.[cause ?? "default"];
 
-  if (questionKey === undefined) {
-    return t("components.CurrentPlayQuestion.unknownQuestionForCurrentPlay");
-  }
+  if (questionKey === undefined) {}
   return t(questionKey);
 });
killedBy: Current Play Question Component 'should render unknown question when a…'
statusReason: expected '' to be 'components.CurrentPlayQuestion.unknow…' // Object.is equality

[Killed] ConditionalExpression
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:30:7
   const { source, action, cause } = currentPlay;
   const questionKey = GAME_PLAYS_QUESTIONS[source.name][action]?.[cause ?? "default"];
 
-  if (questionKey === undefined) {
+  if (false) {
     return t("components.CurrentPlayQuestion.unknownQuestionForCurrentPlay");
   }
killedBy: Current Play Question Component 'should render unknown question when a…'
statusReason: expected '' to be 'components.CurrentPlayQuestion.unknow…' // Object.is equality

[Killed] StringLiteral
GamePlaying/GamePlayground/CurrentPlayQuestion/CurrentPlayQuestion.vue:31:14
   const questionKey = GAME_PLAYS_QUESTIONS[source.name][action]?.[cause ?? "default"];
 
   if (questionKey === undefined) {
-    return t("components.CurrentPlayQuestion.unknownQuestionForCurrentPlay");
+    return t("");
   }
   return t(questionKey);
killedBy: Current Play Question Component 'should render unknown question when a…'
statusReason: expected '' to be 'components.CurrentPlayQuestion.unknow…' // Object.is equality
