[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameBuryDeadBodiesPlayground.vue:32:82
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const eligibleStolenRoleByDevotedServantPlayers = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
+const eligibleStolenRoleByDevotedServantPlayers = computed<Player[] | undefined>(() => undefined);
 </script>
killedBy: Game Bury Dead Bodies Playground Component Devoted Servant Playground should render devoted servant playground when one interaction for her is available.
statusReason: expected false to be truthy
