[Killed] ArrowFunction
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:55:58
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const eliminatedPlayers = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
+const eliminatedPlayers = computed<Player[] | undefined>(() => undefined);
 
 const doesDevotedServantStealRoleQuestion = computed<string>(() => {
killedBy: Game Devoted Servant Steals Role Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Devoted Servant Steals Role Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:55:115
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const eliminatedPlayers = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
+const eliminatedPlayers = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay(""));
 
 const doesDevotedServantStealRoleQuestion = computed<string>(() => {
killedBy: Game Devoted Servant Steals Role Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Devoted Servant Steals Role Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:57:68
 
 const eliminatedPlayers = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
 
-const doesDevotedServantStealRoleQuestion = computed<string>(() => {
-  const eliminatedPlayersCount = eliminatedPlayers.value?.length ?? 0;
-
-  return t("components.GameDevotedServantStealsRolePlayground.doesDevotedServantStealRole", eliminatedPlayersCount);
-});
+const doesDevotedServantStealRoleQuestion = computed<string>(() => {});
 </script>
killedBy: Game Devoted Servant Steals Role Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Devoted Servant Steals Role Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:58:34
 const eliminatedPlayers = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
 
 const doesDevotedServantStealRoleQuestion = computed<string>(() => {
-  const eliminatedPlayersCount = eliminatedPlayers.value?.length ?? 0;
+  const eliminatedPlayersCount = eliminatedPlayers.value?.length && 0;
 
   return t("components.GameDevotedServantStealsRolePlayground.doesDevotedServantStealRole", eliminatedPlayersCount);
killedBy: Game Devoted Servant Steals Role Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Devoted Servant Steals Role Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] OptionalChaining
GamePlaygroundContent/GameBuryDeadBodiesPlayground/GameDevotedServantStealsRolePlayground/GameDevotedServantStealsRolePlayground.vue:58:34
 const eliminatedPlayers = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("steal-role"));
 
 const doesDevotedServantStealRoleQuestion = computed<string>(() => {
-  const eliminatedPlayersCount = eliminatedPlayers.value?.length ?? 0;
+  const eliminatedPlayersCount = eliminatedPlayers.value.length ?? 0;
 
   return t("components.GameDevotedServantStealsRolePlayground.doesDevotedServantStealRole", eliminatedPlayersCount);
killedBy: Game Devoted Servant Steals Role Playground Component Devoted Servant steals role question should translate devoted servant steals role question as singular when there is no interaction.
statusReason: Cannot read properties of undefined (reading 'length')
