[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GameChooseSidePlayground/GameChooseSidePlayground.vue:68:55
 const { makeGamePlayDto } = storeToRefs(makeGamePlayDtoStore);
 const { setChosenSide } = makeGamePlayDtoStore;
 
-function handleChooseVillagersSideButtonClick(): void {
-  setChosenSide("villagers");
-}
+function handleChooseVillagersSideButtonClick(): void {}
 
 function handleChooseWerewolvesSideButtonClick(): void {
killedBy: Game Choose Side Playground Component Choose Villager Side Button should select the villager side when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GameChooseSidePlayground/GameChooseSidePlayground.vue:72:56
   setChosenSide("villagers");
 }
 
-function handleChooseWerewolvesSideButtonClick(): void {
-  setChosenSide("werewolves");
-}
+function handleChooseWerewolvesSideButtonClick(): void {}
 </script>
killedBy: Game Choose Side Playground Component Choose Werewolves Side button should select the werewolves side when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
