[Killed] BlockStatement
GamePlaying/GamePlayground/GamePlaygroundContent/GamePlaygroundContent.vue:38:101
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const gamePlaygroundTypeComponentToRender = computed<GamePlaygroundTypeComponent | undefined>(() => {
-  const { currentPlay } = game.value;
-  if (currentPlay?.action === "use-potions") {
-    return GameUsePotionsPlayground;
-  }
-  const currentGamePlayTypeComponents: Record<GamePlayType, GamePlaygroundTypeComponent> = {
-    "bury-dead-bodies": GameBuryDeadBodiesPlayground,
-    "choose-card": GameChooseCardPlayground,
-    "choose-side": GameChooseSidePlayground,
-    "no-action": GameNoActionPlayground,
-    "request-another-vote": GameRequestAnotherVotePlayground,
-    "target": GameTargetPlayground,
-    "vote": GameVotePlayground,
-  };
-
-  return currentPlay?.type ? currentGamePlayTypeComponents[currentPlay.type] : undefined;
-});
+const gamePlaygroundTypeComponentToRender = computed<GamePlaygroundTypeComponent | undefined>(() => {});
 </script>
killedBy: Game Playground Content Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Content Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
GamePlaying/GamePlayground/GamePlaygroundContent/GamePlaygroundContent.vue:40:7
 
 const gamePlaygroundTypeComponentToRender = computed<GamePlaygroundTypeComponent | undefined>(() => {
   const { currentPlay } = game.value;
-  if (currentPlay?.action === "use-potions") {
+  if (currentPlay?.action !== "use-potions") {
     return GameUsePotionsPlayground;
   }
killedBy: Game Playground Content Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Content Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlaying/GamePlayground/GamePlaygroundContent/GamePlaygroundContent.vue:40:46
 
 const gamePlaygroundTypeComponentToRender = computed<GamePlaygroundTypeComponent | undefined>(() => {
   const { currentPlay } = game.value;
-  if (currentPlay?.action === "use-potions") {
-    return GameUsePotionsPlayground;
-  }
+  if (currentPlay?.action === "use-potions") {}
   const currentGamePlayTypeComponents: Record<GamePlayType, GamePlaygroundTypeComponent> = {
     "bury-dead-bodies": GameBuryDeadBodiesPlayground,
killedBy: Game Playground Content Component Game Playground Component should render game use potions playground component when current game play is use potions type.
statusReason: expected false to be truthy

[Killed] OptionalChaining
GamePlaying/GamePlayground/GamePlaygroundContent/GamePlaygroundContent.vue:53:10
     "vote": GameVotePlayground,
   };
 
-  return currentPlay?.type ? currentGamePlayTypeComponents[currentPlay.type] : undefined;
+  return currentPlay.type ? currentGamePlayTypeComponents[currentPlay.type] : undefined;
 });
 </script>
killedBy: Game Playground Content Component Game Playground Component should not render any game playground component when current game play type is not defined.
statusReason: Cannot read properties of null (reading 'type')
