[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:47:53
   removeFirstMakeGamePlayTargetDtoWithPotion,
 } = makeGamePlayDtoStore;
 
-const canPlayerBeTargeted = computed<boolean>(() => {
-  const { type } = game.value.currentPlay ?? {};
-
-  return type === "target" || type === "bury-dead-bodies";
-});
+const canPlayerBeTargeted = computed<boolean>(() => {});
 
 const isPlayerTargeted = computed<boolean>(() => {
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] LogicalOperator
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:48:20
 } = makeGamePlayDtoStore;
 
 const canPlayerBeTargeted = computed<boolean>(() => {
-  const { type } = game.value.currentPlay ?? {};
+  const { type } = game.value.currentPlay && {};
 
   return type === "target" || type === "bury-dead-bodies";
killedBy: Game Playground Player Card Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:50:10
 const canPlayerBeTargeted = computed<boolean>(() => {
   const { type } = game.value.currentPlay ?? {};
 
-  return type === "target" || type === "bury-dead-bodies";
+  return false;
 });
 
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:50:10
 const canPlayerBeTargeted = computed<boolean>(() => {
   const { type } = game.value.currentPlay ?? {};
 
-  return type === "target" || type === "bury-dead-bodies";
+  return false || type === "bury-dead-bodies";
 });
 
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:53:50
   return type === "target" || type === "bury-dead-bodies";
 });
 
-const isPlayerTargeted = computed<boolean>(() => {
-  if (!makeGamePlayDto.value.targets) {
-    return false;
-  }
-  return makeGamePlayDto.value.targets.some(({ playerId }) => playerId === props.player._id);
-});
+const isPlayerTargeted = computed<boolean>(() => {});
 
 function handleWitchGivesPotionClick(): void {
killedBy: Game Playground Player Card Component Player Card should be selected when player is in make game play dto targets.
statusReason: expected false to be truthy

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:54:39
 });
 
 const isPlayerTargeted = computed<boolean>(() => {
-  if (!makeGamePlayDto.value.targets) {
-    return false;
-  }
+  if (!makeGamePlayDto.value.targets) {}
   return makeGamePlayDto.value.targets.some(({ playerId }) => playerId === props.player._id);
 });
killedBy: Game Playground Player Card Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:54:7
 });
 
 const isPlayerTargeted = computed<boolean>(() => {
-  if (!makeGamePlayDto.value.targets) {
+  if (true) {
     return false;
   }
killedBy: Game Playground Player Card Component Player Card should be selected when player is in make game play dto targets.
statusReason: expected false to be truthy

[Killed] BooleanLiteral
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:55:12
 
 const isPlayerTargeted = computed<boolean>(() => {
   if (!makeGamePlayDto.value.targets) {
-    return false;
+    return true;
   }
   return makeGamePlayDto.value.targets.some(({ playerId }) => playerId === props.player._id);
killedBy: Game Playground Player Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Player Card Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:57:45
   if (!makeGamePlayDto.value.targets) {
     return false;
   }
-  return makeGamePlayDto.value.targets.some(({ playerId }) => playerId === props.player._id);
+  return makeGamePlayDto.value.targets.some(() => undefined);
 });
 
killedBy: Game Playground Player Card Component Player Card should be selected when player is in make game play dto targets.
statusReason: expected false to be truthy

[Killed] MethodExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:57:10
   if (!makeGamePlayDto.value.targets) {
     return false;
   }
-  return makeGamePlayDto.value.targets.some(({ playerId }) => playerId === props.player._id);
+  return makeGamePlayDto.value.targets.every(({
+  playerId
+}) => playerId === props.player._id);
 });
 
killedBy: Game Playground Player Card Component Player Card should be selected when player is in make game play dto targets.
statusReason: expected false to be truthy

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:60:46
   return makeGamePlayDto.value.targets.some(({ playerId }) => playerId === props.player._id);
 });
 
-function handleWitchGivesPotionClick(): void {
-  const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
-  const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
-  const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
-  if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
-    props.interaction === "give-death-potion" && givenDeathPotionTargets?.length === 1) {
-    removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion);
-  }
-  addMakeGamePlayTargetDto({
-    playerId: props.player._id,
-    drankPotion,
-  });
-}
+function handleWitchGivesPotionClick(): void {}
 
 function handlePlayerCardSelectorClick(): void {
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] EqualityOperator
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:61:93
 });
 
 function handleWitchGivesPotionClick(): void {
-  const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
+  const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion !== "life");
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:61:72
 });
 
 function handleWitchGivesPotionClick(): void {
-  const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
+  const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(() => undefined);
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:62:94
 
 function handleWitchGivesPotionClick(): void {
   const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
-  const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
+  const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => true);
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
   if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
killedBy: Game Playground Player Card Component Player Card Click on Player Card should add player to make game play dto targets with drank death potion when player can be targeted and is not already with life 
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "death",

[Killed] MethodExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:62:35
 
 function handleWitchGivesPotionClick(): void {
   const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
-  const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
+  const givenDeathPotionTargets = makeGamePlayDto.value.targets;
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
   if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
killedBy: Game Playground Player Card Component Player Card Click on Player Card should add player to make game play dto targets with drank death potion when player can be targeted and is not already with life 
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "death",

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:63:36
 function handleWitchGivesPotionClick(): void {
   const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
-  const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
+  const drankPotion: WitchPotion = false ? "life" : "death";
   if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
     props.interaction === "give-death-potion" && givenDeathPotionTargets?.length === 1) {
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "life",
], but it was called with "death"

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:63:36
 function handleWitchGivesPotionClick(): void {
   const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
-  const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
+  const drankPotion: WitchPotion = true ? "life" : "death";
   if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
     props.interaction === "give-death-potion" && givenDeathPotionTargets?.length === 1) {
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is death potion and there is already one target for death potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "death",
], but it was called with "life"

[Killed] LogicalOperator
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:64:7
   const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
-  if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
+  if (props.interaction === "give-life-potion" || givenLifePotionTargets?.length === 1 ||
     props.interaction === "give-death-potion" && givenDeathPotionTargets?.length === 1) {
     removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion);
killedBy: Game Playground Player Card Component Player Card Click on Player Card should add player to make game play dto targets with drank life potion when player can be targeted and is not already with death 
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "life",

[Killed] OptionalChaining
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:64:51
   const givenLifePotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "life");
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
-  if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
+  if (props.interaction === "give-life-potion" && givenLifePotionTargets.length === 1 ||
     props.interaction === "give-death-potion" && givenDeathPotionTargets?.length === 1) {
     removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion);
killedBy: Game Playground Player Card Component Player Card Click on Player Card should add player to make game play dto targets with drank life potion when player can be targeted and is not already without dea
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:65:50
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
   if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
-    props.interaction === "give-death-potion" && givenDeathPotionTargets?.length === 1) {
+    props.interaction === "give-death-potion" && true) {
     removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion);
   }
killedBy: Game Playground Player Card Component Player Card Click on Player Card should add player to make game play dto targets with drank death potion when player can be targeted and is not already with life 
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "death",

[Killed] EqualityOperator
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:65:50
   const givenDeathPotionTargets = makeGamePlayDto.value.targets?.filter(({ drankPotion }) => drankPotion === "death");
   const drankPotion: WitchPotion = props.interaction === "give-life-potion" ? "life" : "death";
   if (props.interaction === "give-life-potion" && givenLifePotionTargets?.length === 1 ||
-    props.interaction === "give-death-potion" && givenDeathPotionTargets?.length === 1) {
+    props.interaction === "give-death-potion" && givenDeathPotionTargets?.length !== 1) {
     removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion);
   }
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is death potion and there is already one target for death potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:74:48
   });
 }
 
-function handlePlayerCardSelectorClick(): void {
-  const currentPlayInteraction = game.value.currentPlay?.source.interactions?.find(({ type }) => type === props.interaction);
-  if (!currentPlayInteraction || !canPlayerBeTargeted.value) {
-    return;
-  }
-  if (isPlayerTargeted.value) {
-    removeMakeGamePlayTargetDto(props.player._id);
-
-    return;
-  }
-  if (currentPlayInteraction.type === "give-life-potion" || currentPlayInteraction.type === "give-death-potion") {
-    handleWitchGivesPotionClick();
-
-    return;
-  }
-  if (makeGamePlayDto.value.targets?.length === currentPlayInteraction.boundaries.max) {
-    removeFirstMakeGamePlayTargetDto();
-  }
-  addMakeGamePlayTargetDto({ playerId: props.player._id });
-}
+function handlePlayerCardSelectorClick(): void {}
 </script>
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:75:98
 }
 
 function handlePlayerCardSelectorClick(): void {
-  const currentPlayInteraction = game.value.currentPlay?.source.interactions?.find(({ type }) => type === props.interaction);
+  const currentPlayInteraction = game.value.currentPlay?.source.interactions?.find(({ type }) => true);
   if (!currentPlayInteraction || !canPlayerBeTargeted.value) {
     return;
killedBy: Game Playground Player Card Component Player Card Click on Player Card should do nothing when player can't be targeted because interaction is not found.
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:75:84
 }
 
 function handlePlayerCardSelectorClick(): void {
-  const currentPlayInteraction = game.value.currentPlay?.source.interactions?.find(({ type }) => type === props.interaction);
+  const currentPlayInteraction = game.value.currentPlay?.source.interactions?.find(() => undefined);
   if (!currentPlayInteraction || !canPlayerBeTargeted.value) {
     return;
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] LogicalOperator
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:76:7
 
 function handlePlayerCardSelectorClick(): void {
   const currentPlayInteraction = game.value.currentPlay?.source.interactions?.find(({ type }) => type === props.interaction);
-  if (!currentPlayInteraction || !canPlayerBeTargeted.value) {
+  if (!currentPlayInteraction && !canPlayerBeTargeted.value) {
     return;
   }
killedBy: Game Playground Player Card Component Player Card Click on Player Card should do nothing when player can't be targeted because game play type is not target.
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:76:62
 
 function handlePlayerCardSelectorClick(): void {
   const currentPlayInteraction = game.value.currentPlay?.source.interactions?.find(({ type }) => type === props.interaction);
-  if (!currentPlayInteraction || !canPlayerBeTargeted.value) {
-    return;
-  }
+  if (!currentPlayInteraction || !canPlayerBeTargeted.value) {}
   if (isPlayerTargeted.value) {
     removeMakeGamePlayTargetDto(props.player._id);
killedBy: Game Playground Player Card Component Player Card Click on Player Card should do nothing when player can't be targeted because game play is null.
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:79:7
   if (!currentPlayInteraction || !canPlayerBeTargeted.value) {
     return;
   }
-  if (isPlayerTargeted.value) {
+  if (true) {
     removeMakeGamePlayTargetDto(props.player._id);
 
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:79:7
   if (!currentPlayInteraction || !canPlayerBeTargeted.value) {
     return;
   }
-  if (isPlayerTargeted.value) {
+  if (false) {
     removeMakeGamePlayTargetDto(props.player._id);
 
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove player from make game play dto targets when player can be targeted and is already.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] LogicalOperator
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:84:7
 
     return;
   }
-  if (currentPlayInteraction.type === "give-life-potion" || currentPlayInteraction.type === "give-death-potion") {
+  if (currentPlayInteraction.type === "give-life-potion" && currentPlayInteraction.type === "give-death-potion") {
     handleWitchGivesPotionClick();
 
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is life potion and there is already one target for life potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:84:61
 
     return;
   }
-  if (currentPlayInteraction.type === "give-life-potion" || currentPlayInteraction.type === "give-death-potion") {
+  if (currentPlayInteraction.type === "give-life-potion" || false) {
     handleWitchGivesPotionClick();
 
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first make game play target dto when interaction is death potion and there is already one target for death potion.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] EqualityOperator
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:89:7
 
     return;
   }
-  if (makeGamePlayDto.value.targets?.length === currentPlayInteraction.boundaries.max) {
+  if (makeGamePlayDto.value.targets?.length !== currentPlayInteraction.boundaries.max) {
     removeFirstMakeGamePlayTargetDto();
   }
killedBy: Game Playground Player Card Component Player Card Click on Player Card should add player to make game play dto targets when player can be targeted and is not already.
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array []

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:89:88
 
     return;
   }
-  if (makeGamePlayDto.value.targets?.length === currentPlayInteraction.boundaries.max) {
-    removeFirstMakeGamePlayTargetDto();
-  }
+  if (makeGamePlayDto.value.targets?.length === currentPlayInteraction.boundaries.max) {}
   addMakeGamePlayTargetDto({ playerId: props.player._id });
 }
killedBy: Game Playground Player Card Component Player Card Click on Player Card should remove first player from make game play dto targets when player can be targeted and max targets are reached.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ObjectLiteral
GamePlayground/GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCard.vue:92:28
   if (makeGamePlayDto.value.targets?.length === currentPlayInteraction.boundaries.max) {
     removeFirstMakeGamePlayTargetDto();
   }
-  addMakeGamePlayTargetDto({ playerId: props.player._id });
+  addMakeGamePlayTargetDto({});
 }
 </script>
killedBy: Game Playground Player Card Component Player Card Click on Player Card should add player to make game play dto targets when player can be targeted and is not already.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "playerId": "8131526e-e8a8-42f3-9a03-e92eceb86116",
  },
], but it was called with Object {}
