[Killed] BlockStatement
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:74:58
 
 const votedPlayer = ref<Player | string | null>(null);
 
-const voteOptions = computed<Player[] | undefined>(() => {
-  const eligibleTargets = game.value.currentPlay?.source.interactions?.[0]?.eligibleTargets;
-  if (eligibleTargets === undefined) {
-    return undefined;
-  }
-  return eligibleTargets.filter(({ _id }) => _id !== props.player._id);
-});
+const voteOptions = computed<Player[] | undefined>(() => {});
 
 function searchVoteOptions({ query }: AutoCompleteCompleteEvent): void {
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass all players without the player in props himself as suggestions when query is empty on complete event.
statusReason: expected [] to strictly equal [ _Player{ …(6) }, …(2) ]

[Killed] OptionalChaining
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:75:27
 const votedPlayer = ref<Player | string | null>(null);
 
 const voteOptions = computed<Player[] | undefined>(() => {
-  const eligibleTargets = game.value.currentPlay?.source.interactions?.[0]?.eligibleTargets;
+  const eligibleTargets = game.value.currentPlay?.source.interactions?.[0].eligibleTargets;
   if (eligibleTargets === undefined) {
     return undefined;
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play source interactions (empty array) on complete event.
statusReason: Cannot read properties of undefined (reading 'eligibleTargets')

[Killed] OptionalChaining
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:75:27
 const votedPlayer = ref<Player | string | null>(null);
 
 const voteOptions = computed<Player[] | undefined>(() => {
-  const eligibleTargets = game.value.currentPlay?.source.interactions?.[0]?.eligibleTargets;
+  const eligibleTargets = game.value.currentPlay?.source.interactions[0]?.eligibleTargets;
   if (eligibleTargets === undefined) {
     return undefined;
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play eligible targets on complete event.
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:76:7
 
 const voteOptions = computed<Player[] | undefined>(() => {
   const eligibleTargets = game.value.currentPlay?.source.interactions?.[0]?.eligibleTargets;
-  if (eligibleTargets === undefined) {
+  if (false) {
     return undefined;
   }
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play on complete event.
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:76:38
 
 const voteOptions = computed<Player[] | undefined>(() => {
   const eligibleTargets = game.value.currentPlay?.source.interactions?.[0]?.eligibleTargets;
-  if (eligibleTargets === undefined) {
-    return undefined;
-  }
+  if (eligibleTargets === undefined) {}
   return eligibleTargets.filter(({ _id }) => _id !== props.player._id);
 });
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play on complete event.
statusReason: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:79:46
   if (eligibleTargets === undefined) {
     return undefined;
   }
-  return eligibleTargets.filter(({ _id }) => _id !== props.player._id);
+  return eligibleTargets.filter(({ _id }) => true);
 });
 
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass all players without the player in props himself as suggestions when query is empty on complete event.
statusReason: expected [ _Player{ …(6) }, …(3) ] to strictly equal [ _Player{ …(6) }, …(2) ]

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:79:46
   if (eligibleTargets === undefined) {
     return undefined;
   }
-  return eligibleTargets.filter(({ _id }) => _id !== props.player._id);
+  return eligibleTargets.filter(({ _id }) => false);
 });
 
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass all players without the player in props himself as suggestions when query is empty on complete event.
statusReason: expected [] to strictly equal [ _Player{ …(6) }, …(2) ]

[Killed] BlockStatement
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:82:72
   return eligibleTargets.filter(({ _id }) => _id !== props.player._id);
 });
 
-function searchVoteOptions({ query }: AutoCompleteCompleteEvent): void {
-  const options: Player[] = voteOptions.value ?? [];
-  if (!query.trim()) {
-    filteredVoteOptions.value = options;
-
-    return;
-  }
-  const fuse: Fuse<Player> = new Fuse(options, { keys: ["name"] });
-  filteredVoteOptions.value = fuse.search(query).map(({ item }) => item);
-}
+function searchVoteOptions({ query }: AutoCompleteCompleteEvent): void {}
 
 function handleHideEvent(): void {
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play source interactions on complete event.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] LogicalOperator
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:83:29
 });
 
 function searchVoteOptions({ query }: AutoCompleteCompleteEvent): void {
-  const options: Player[] = voteOptions.value ?? [];
+  const options: Player[] = voteOptions.value && [];
   if (!query.trim()) {
     filteredVoteOptions.value = options;
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play on complete event.
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:83:50
 });
 
 function searchVoteOptions({ query }: AutoCompleteCompleteEvent): void {
-  const options: Player[] = voteOptions.value ?? [];
+  const options: Player[] = voteOptions.value ?? ["Stryker was here"];
   if (!query.trim()) {
     filteredVoteOptions.value = options;
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play source interactions on complete event.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Array [],
  undefined,
], but it was called with Array [
  "Stryker was here",
]

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:84:7
 
 function searchVoteOptions({ query }: AutoCompleteCompleteEvent): void {
   const options: Player[] = voteOptions.value ?? [];
-  if (!query.trim()) {
+  if (false) {
     filteredVoteOptions.value = options;
 
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass all players without the player in props himself as suggestions when query is empty on complete event.
statusReason: expected [] to strictly equal [ _Player{ …(6) }, …(2) ]

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:84:7
 
 function searchVoteOptions({ query }: AutoCompleteCompleteEvent): void {
   const options: Player[] = voteOptions.value ?? [];
-  if (!query.trim()) {
+  if (true) {
     filteredVoteOptions.value = options;
 
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass empty array as suggestions when there is no current play source interactions on complete event.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:90:54
     return;
   }
   const fuse: Fuse<Player> = new Fuse(options, { keys: ["name"] });
-  filteredVoteOptions.value = fuse.search(query).map(({ item }) => item);
+  filteredVoteOptions.value = fuse.search(query).map(() => undefined);
 }
 
killedBy: Game Playground Player Card Vote Input Component Autocomplete should pass players with similar name without the player in props himself as suggestions when query the player's name himself on complete 
statusReason: expected [ undefined, undefined ] to strictly equal [ _Player{ …(6) }, _Player{ …(6) } ]

[Killed] BlockStatement
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:93:34
   filteredVoteOptions.value = fuse.search(query).map(({ item }) => item);
 }
 
-function handleHideEvent(): void {
-  filteredVoteOptions.value = [];
-}
+function handleHideEvent(): void {}
 
 function handleUpdateModelValueEvent({ value }: AutoCompleteChangeEvent): void {
killedBy: Game Playground Player Card Vote Input Component Autocomplete should empty suggestions when hide event is emitted.
statusReason: expected [ _Player{ …(6) }, _Player{ …(6) } ] to strictly equal []

[Killed] ArrayDeclaration
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:94:31
 }
 
 function handleHideEvent(): void {
-  filteredVoteOptions.value = [];
+  filteredVoteOptions.value = ["Stryker was here"];
 }
 
killedBy: Game Playground Player Card Vote Input Component Autocomplete should empty suggestions when hide event is emitted.
statusReason: expected [ 'Stryker was here' ] to strictly equal []

[Killed] BlockStatement
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:97:80
   filteredVoteOptions.value = [];
 }
 
-function handleUpdateModelValueEvent({ value }: AutoCompleteChangeEvent): void {
-  votedPlayer.value = value as Player | string | null;
-  if (typeof votedPlayer.value === "string") {
-    return;
-  }
-  if (votedPlayer.value === null) {
-    removeMakeGamePlayVoteDto(props.player._id);
-
-    return;
-  }
-  removeMakeGamePlayVoteDto(props.player._id);
-  addMakeGamePlayVoteDto({
-    sourceId: props.player._id,
-    targetId: votedPlayer.value._id,
-  });
-}
+function handleUpdateModelValueEvent({ value }: AutoCompleteChangeEvent): void {}
 </script>
killedBy: Game Playground Player Card Vote Input Component Autocomplete should remove make game play vote from dto when item select event is emitted and player is null.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:99:7
 
 function handleUpdateModelValueEvent({ value }: AutoCompleteChangeEvent): void {
   votedPlayer.value = value as Player | string | null;
-  if (typeof votedPlayer.value === "string") {
+  if (true) {
     return;
   }
killedBy: Game Playground Player Card Vote Input Component Autocomplete should remove make game play vote from dto when item select event is emitted and player is null.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:99:7
 
 function handleUpdateModelValueEvent({ value }: AutoCompleteChangeEvent): void {
   votedPlayer.value = value as Player | string | null;
-  if (typeof votedPlayer.value === "string") {
+  if (false) {
     return;
   }
killedBy: Game Playground Player Card Vote Input Component Autocomplete should do nothing when v-model change event is emitted but value is string.
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      "07fc7062-e650-44c7-b956-9c0be03f6828",

[Killed] BlockStatement
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:102:35
   if (typeof votedPlayer.value === "string") {
     return;
   }
-  if (votedPlayer.value === null) {
-    removeMakeGamePlayVoteDto(props.player._id);
-
-    return;
-  }
+  if (votedPlayer.value === null) {}
   removeMakeGamePlayVoteDto(props.player._id);
   addMakeGamePlayVoteDto({
killedBy: Game Playground Player Card Vote Input Component Autocomplete should remove make game play vote from dto when item select event is emitted and player is null.
statusReason: Cannot read properties of null (reading '_id')

[Killed] ConditionalExpression
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:102:7
   if (typeof votedPlayer.value === "string") {
     return;
   }
-  if (votedPlayer.value === null) {
+  if (false) {
     removeMakeGamePlayVoteDto(props.player._id);
 
killedBy: Game Playground Player Card Vote Input Component Autocomplete should remove make game play vote from dto when item select event is emitted and player is null.
statusReason: Cannot read properties of null (reading '_id')

[Killed] ObjectLiteral
GamePlaygroundContent/GamePlaygroundPlayerCard/GamePlaygroundPlayerCardVoteInput/GamePlaygroundPlayerCardVoteInput.vue:108:26
     return;
   }
   removeMakeGamePlayVoteDto(props.player._id);
-  addMakeGamePlayVoteDto({
-    sourceId: props.player._id,
-    targetId: votedPlayer.value._id,
-  });
+  addMakeGamePlayVoteDto({});
 }
 </script>
killedBy: Game Playground Player Card Vote Input Component Autocomplete should add make game play vote from dto when item select event is emitted and player is voted.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "sourceId": "0f10534c-17d7-48ef-a293-1fe521e3176c",
    "targetId": "cc0e94e1-9c3f-48fd-a249-91d2df11d899",
  },
], but it was called with Object {}
