[Killed] BooleanLiteral
GamePlayground/GamePlaygroundContent/GameRequestAnotherVotePlayground/GameRequestAnotherVotePlayground.vue:25:50
 const makeGamePlayDtoStore = useMakeGamePlayDtoStore();
 const { setDoesJudgeRequestAnotherVote } = makeGamePlayDtoStore;
 
-const doesJudgeRequestAnotherVote = ref<boolean>(false);
+const doesJudgeRequestAnotherVote = ref<boolean>(true);
 
 function handleDoesJudgeRequestAnotherVoteChange(): void {
killedBy: Game Request Another Vote Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Request Another Vote Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundContent/GameRequestAnotherVotePlayground/GameRequestAnotherVotePlayground.vue:27:58
 
 const doesJudgeRequestAnotherVote = ref<boolean>(false);
 
-function handleDoesJudgeRequestAnotherVoteChange(): void {
-  setDoesJudgeRequestAnotherVote(doesJudgeRequestAnotherVote.value);
-}
+function handleDoesJudgeRequestAnotherVoteChange(): void {}
 </script>
killedBy: Game Request Another Vote Playground Component Toggle Button should set the does request another vote value to true in dto when the toggle button emits true change event.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
