[Killed] OptionalChaining
GamePlaygroundContent/GameTargetPlayground/GameTargetPlaygroundTargets/GameTargetPlaygroundTargets.vue:41:54
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const targets = computed<Player[] | undefined>(() => game.value.currentPlay?.source.interactions?.[0]?.eligibleTargets);
+const targets = computed<Player[] | undefined>(() => game.value.currentPlay.source.interactions?.[0]?.eligibleTargets);
 </script>
killedBy: Game Target Playground Targets Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] OptionalChaining
GamePlaygroundContent/GameTargetPlayground/GameTargetPlaygroundTargets/GameTargetPlaygroundTargets.vue:41:54
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const targets = computed<Player[] | undefined>(() => game.value.currentPlay?.source.interactions?.[0]?.eligibleTargets);
+const targets = computed<Player[] | undefined>(() => game.value.currentPlay?.source.interactions[0]?.eligibleTargets);
 </script>
killedBy: Game Target Playground Targets Component No targets should render no targets message when current play is defined but there are no eligible targets.
statusReason: Cannot read properties of undefined (reading '0')
