[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:35:81
 
 const { getEligibleTargetsWithInteractionInCurrentGamePlay } = useCurrentGamePlay(game);
 
-const giveLifePotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-life-potion"));
+const giveLifePotionInteractionEligibleTargets = computed<Player[] | undefined>(() => undefined);
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
killedBy: Game Use Potions Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Use Potions Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:37:82
 
 const giveLifePotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-life-potion"));
 
-const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
+const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => undefined);
 
 const hasWitchUsedBothPotions = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value && !giveDeathPotionInteractionEligibleTargets.value);
killedBy: Game Use Potions Playground Component At least one potion left should render witch use potions tab view when witch has her death potion.
statusReason: expected false to be truthy

[Killed] StringLiteral
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:37:139
 
 const giveLifePotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-life-potion"));
 
-const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
+const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay(""));
 
 const hasWitchUsedBothPotions = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value && !giveDeathPotionInteractionEligibleTargets.value);
killedBy: Game Use Potions Playground Component At least one potion left should render witch use potions tab view when witch has her death potion.
statusReason: expected false to be truthy

[Killed] BooleanLiteral
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:39:57
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedBothPotions = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value && !giveDeathPotionInteractionEligibleTargets.value);
+const hasWitchUsedBothPotions = computed<boolean>(() => giveLifePotionInteractionEligibleTargets.value && !giveDeathPotionInteractionEligibleTargets.value);
 </script>
killedBy: Game Use Potions Playground Component should match snapshot when rendered.
statusReason: Snapshot `Game Use Potions Playground Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundContent/GameUsePotionsPlayground/GameUsePotionsPlayground.vue:39:57
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedBothPotions = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value && !giveDeathPotionInteractionEligibleTargets.value);
+const hasWitchUsedBothPotions = computed<boolean>(() => false);
 </script>
killedBy: Game Use Potions Playground Component No potion left should render no potion container when witch has no potion left.
statusReason: expected false to be truthy
