[Killed] BooleanLiteral
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:93:56
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedLifePotion = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value);
+const hasWitchUsedLifePotion = computed<boolean>(() => giveLifePotionInteractionEligibleTargets.value);
 
 const hasWitchUsedDeathPotion = computed<boolean>(() => !giveDeathPotionInteractionEligibleTargets.value);
killedBy: Witch Use Potions Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Witch Use Potions Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:93:50
 
 const giveDeathPotionInteractionEligibleTargets = computed<Player[] | undefined>(() => getEligibleTargetsWithInteractionInCurrentGamePlay("give-death-potion"));
 
-const hasWitchUsedLifePotion = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value);
+const hasWitchUsedLifePotion = computed<boolean>(() => undefined);
 
 const hasWitchUsedDeathPotion = computed<boolean>(() => !giveDeathPotionInteractionEligibleTargets.value);
killedBy: Witch Use Potions Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Witch Use Potions Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:95:57
 
 const hasWitchUsedLifePotion = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value);
 
-const hasWitchUsedDeathPotion = computed<boolean>(() => !giveDeathPotionInteractionEligibleTargets.value);
+const hasWitchUsedDeathPotion = computed<boolean>(() => giveDeathPotionInteractionEligibleTargets.value);
 
 const tabViewActiveIndex = computed<number>(() => (hasWitchUsedLifePotion.value ? 1 : 0));
killedBy: Witch Use Potions Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Witch Use Potions Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:95:51
 
 const hasWitchUsedLifePotion = computed<boolean>(() => !giveLifePotionInteractionEligibleTargets.value);
 
-const hasWitchUsedDeathPotion = computed<boolean>(() => !giveDeathPotionInteractionEligibleTargets.value);
+const hasWitchUsedDeathPotion = computed<boolean>(() => undefined);
 
 const tabViewActiveIndex = computed<number>(() => (hasWitchUsedLifePotion.value ? 1 : 0));
killedBy: Witch Use Potions Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Witch Use Potions Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GamePlaygroundContent/GameUsePotionsPlayground/WitchUsePotionsTabView/WitchUsePotionsTabView.vue:97:45
 
 const hasWitchUsedDeathPotion = computed<boolean>(() => !giveDeathPotionInteractionEligibleTargets.value);
 
-const tabViewActiveIndex = computed<number>(() => (hasWitchUsedLifePotion.value ? 1 : 0));
+const tabViewActiveIndex = computed<number>(() => undefined);
 </script>
killedBy: Witch Use Potions Tab View Component Tab View should have active index set to 0 when witch still has life potion.
statusReason: expected undefined to be '0' // Object.is equality
