[Killed] BlockStatement
GamePlaygroundContent/GameVotePlayground/GameVotePlaygroundVoters/GameVotePlaygroundVoters.vue:41:41
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const voters = computed<Player[]>(() => {
-  if (game.value.currentPlay?.source.players === undefined || game.value.currentPlay.source.players.length === 0) {
-    return [];
-  }
-  return shuffle(game.value.currentPlay.source.players);
-});
+const voters = computed<Player[]>(() => {});
 </script>
killedBy: Game Vote Playground Voter Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] LogicalOperator
GamePlaygroundContent/GameVotePlayground/GameVotePlaygroundVoters/GameVotePlaygroundVoters.vue:42:7
 const { game } = storeToRefs(gameStore);
 
 const voters = computed<Player[]>(() => {
-  if (game.value.currentPlay?.source.players === undefined || game.value.currentPlay.source.players.length === 0) {
+  if (game.value.currentPlay?.source.players === undefined && game.value.currentPlay.source.players.length === 0) {
     return [];
   }
killedBy: Game Vote Playground Voter Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] EqualityOperator
GamePlaygroundContent/GameVotePlayground/GameVotePlaygroundVoters/GameVotePlaygroundVoters.vue:42:7
 const { game } = storeToRefs(gameStore);
 
 const voters = computed<Player[]>(() => {
-  if (game.value.currentPlay?.source.players === undefined || game.value.currentPlay.source.players.length === 0) {
+  if (game.value.currentPlay?.source.players !== undefined || game.value.currentPlay.source.players.length === 0) {
     return [];
   }
killedBy: Game Vote Playground Voter Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrayDeclaration
GamePlaygroundContent/GameVotePlayground/GameVotePlaygroundVoters/GameVotePlaygroundVoters.vue:43:12
 
 const voters = computed<Player[]>(() => {
   if (game.value.currentPlay?.source.players === undefined || game.value.currentPlay.source.players.length === 0) {
-    return [];
+    return ["Stryker was here"];
   }
   return shuffle(game.value.currentPlay.source.players);
killedBy: Game Vote Playground Voter Component should match snapshot when rendered.
statusReason: Snapshot `Game Vote Playground Voter Component > should match snapshot when rendered. 1` mismatched
