[Killed] BooleanLiteral
GamePlayground/GamePlaygroundFooter/GamePlaygroundFooterMakePlayButton/GamePlaygroundFooterMakePlayButton.vue:39:40
 
 const { canMakeGamePlay } = useMakeGamePlayDtoValidation(makeGamePlayDto, game);
 
-const isLoadingMakePlay = ref<boolean>(false);
+const isLoadingMakePlay = ref<boolean>(true);
 
 async function handleMakePlayButtonClick(): Promise<void> {
killedBy: Game Playground Footer Make Play Button Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Footer Make Play Button Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundFooter/GamePlaygroundFooterMakePlayButton/GamePlaygroundFooterMakePlayButton.vue:41:59
 
 const isLoadingMakePlay = ref<boolean>(false);
 
-async function handleMakePlayButtonClick(): Promise<void> {
-  isLoadingMakePlay.value = true;
-  await makeGamePlay(makeGamePlayDto.value);
-  resetMakeGamePlayDto();
-  isLoadingMakePlay.value = false;
-}
+async function handleMakePlayButtonClick(): Promise<void> {}
 </script>
killedBy: Game Playground Footer Make Play Button Component Make Game Play Button Click on button should make play when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BooleanLiteral
GamePlayground/GamePlaygroundFooter/GamePlaygroundFooterMakePlayButton/GamePlaygroundFooterMakePlayButton.vue:42:29
 const isLoadingMakePlay = ref<boolean>(false);
 
 async function handleMakePlayButtonClick(): Promise<void> {
-  isLoadingMakePlay.value = true;
+  isLoadingMakePlay.value = false;
   await makeGamePlay(makeGamePlayDto.value);
   resetMakeGamePlayDto();
killedBy: Game Playground Footer Make Play Button Component Make Game Play Button Click on button should be loading when fetch is in progress.
statusReason: expect(received).toBeTrue()

Expected value to be true:
  true
Received:
  false

[Killed] BooleanLiteral
GamePlayground/GamePlaygroundFooter/GamePlaygroundFooterMakePlayButton/GamePlaygroundFooterMakePlayButton.vue:45:29
   isLoadingMakePlay.value = true;
   await makeGamePlay(makeGamePlayDto.value);
   resetMakeGamePlayDto();
-  isLoadingMakePlay.value = false;
+  isLoadingMakePlay.value = true;
 }
 </script>
killedBy: Game Playground Footer Make Play Button Component Make Game Play Button Click on button should not be loading when fetch is finished.
statusReason: expected 'true' to be 'false' // Object.is equality
