[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:25:71
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const currentPlayRoleImageName = computed<RoleName | undefined>(() => {
-  const { currentPlay } = game.value;
-  if (!currentPlay) {
-    return undefined;
-  }
-  const { name: sourceName } = currentPlay.source;
-  const villagerImageSpecificGamePlaySourceNames: GamePlaySourceName[] = [
-    "sheriff",
-    "survivors",
-    "charmed",
-    "lovers",
-  ];
-  if (villagerImageSpecificGamePlaySourceNames.includes(sourceName)) {
-    return "villager";
-  }
-  if (sourceName === "werewolves") {
-    return "werewolf";
-  }
-  return sourceName as RoleName;
-});
+const currentPlayRoleImageName = computed<RoleName | undefined>(() => {});
 </script>
killedBy: Game Playground Header Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Card Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:27:21
 
 const currentPlayRoleImageName = computed<RoleName | undefined>(() => {
   const { currentPlay } = game.value;
-  if (!currentPlay) {
-    return undefined;
-  }
+  if (!currentPlay) {}
   const { name: sourceName } = currentPlay.source;
   const villagerImageSpecificGamePlaySourceNames: GamePlaySourceName[] = [
killedBy: Game Playground Header Card Component Role Image should pass undefined to the role image component when the current play is not set.
statusReason: Cannot read properties of null (reading 'source')

[Killed] StringLiteral
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:32:5
   }
   const { name: sourceName } = currentPlay.source;
   const villagerImageSpecificGamePlaySourceNames: GamePlaySourceName[] = [
-    "sheriff",
+    "",
     "survivors",
     "charmed",
killedBy: Game Playground Header Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Card Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:37:70
     "charmed",
     "lovers",
   ];
-  if (villagerImageSpecificGamePlaySourceNames.includes(sourceName)) {
-    return "villager";
-  }
+  if (villagerImageSpecificGamePlaySourceNames.includes(sourceName)) {}
   if (sourceName === "werewolves") {
     return "werewolf";
killedBy: Game Playground Header Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Card Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:37:7
     "charmed",
     "lovers",
   ];
-  if (villagerImageSpecificGamePlaySourceNames.includes(sourceName)) {
+  if (true) {
     return "villager";
   }
killedBy: Game Playground Header Card Component Role Image 'should pass the werewolf role name to…'
statusReason: expected 'villager' to be 'werewolf' // Object.is equality

[Killed] StringLiteral
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:38:12
     "lovers",
   ];
   if (villagerImageSpecificGamePlaySourceNames.includes(sourceName)) {
-    return "villager";
+    return "";
   }
   if (sourceName === "werewolves") {
killedBy: Game Playground Header Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Card Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:40:36
   if (villagerImageSpecificGamePlaySourceNames.includes(sourceName)) {
     return "villager";
   }
-  if (sourceName === "werewolves") {
-    return "werewolf";
-  }
+  if (sourceName === "werewolves") {}
   return sourceName as RoleName;
 });
killedBy: Game Playground Header Card Component Role Image 'should pass the werewolf role name to…'
statusReason: expected 'werewolves' to be 'werewolf' // Object.is equality

[Killed] EqualityOperator
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCard/GamePlaygroundHeaderCard.vue:40:7
   if (villagerImageSpecificGamePlaySourceNames.includes(sourceName)) {
     return "villager";
   }
-  if (sourceName === "werewolves") {
+  if (sourceName !== "werewolves") {
     return "werewolf";
   }
killedBy: Game Playground Header Card Component Role Image 'should pass the werewolf role name to…'
statusReason: expected 'werewolves' to be 'werewolf' // Object.is equality
