[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:36:84
 const { game } = storeToRefs(gameStore);
 const { t } = useI18n();
 
-const currentPlaySvgAndTextKey = computed<CurrentPlaySvgAndText | undefined>(() => {
-  const { currentPlay } = game.value;
-  if (!currentPlay) {
-    return undefined;
-  }
-  const svgAndText = GAME_PLAYS_TEXT_AND_SVG[currentPlay.source.name][currentPlay.action];
-  if (!svgAndText) {
-    return undefined;
-  }
-  return {
-    svgPath: svgAndText.svgPath,
-    text: svgAndText.textKey,
-  };
-});
+const currentPlaySvgAndTextKey = computed<CurrentPlaySvgAndText | undefined>(() => {});
 
 const currentPlayText = computed<string>(() => {
killedBy: Game Playground Header Current Play Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Current Play Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:42:7
     return undefined;
   }
   const svgAndText = GAME_PLAYS_TEXT_AND_SVG[currentPlay.source.name][currentPlay.action];
-  if (!svgAndText) {
+  if (svgAndText) {
     return undefined;
   }
killedBy: Game Playground Header Current Play Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Current Play Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:42:20
     return undefined;
   }
   const svgAndText = GAME_PLAYS_TEXT_AND_SVG[currentPlay.source.name][currentPlay.action];
-  if (!svgAndText) {
-    return undefined;
-  }
+  if (!svgAndText) {}
   return {
     svgPath: svgAndText.svgPath,
killedBy: Game Playground Header Current Play Component Current play SVG icon should not render the current play SVG icon when the current play is unknown.
statusReason: Cannot read properties of undefined (reading 'svgPath')

[Killed] ObjectLiteral
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:45:10
   if (!svgAndText) {
     return undefined;
   }
-  return {
-    svgPath: svgAndText.svgPath,
-    text: svgAndText.textKey,
-  };
+  return {};
 });
 
killedBy: Game Playground Header Current Play Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Current Play Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:51:48
   };
 });
 
-const currentPlayText = computed<string>(() => {
-  if (!currentPlaySvgAndTextKey.value) {
-    return t("components.GamePlaygroundHeaderCurrentPlay.unknownGamePlay");
-  }
-  return t(currentPlaySvgAndTextKey.value.text);
-});
+const currentPlayText = computed<string>(() => {});
 </script>
killedBy: Game Playground Header Current Play Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Current Play Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:52:7
 });
 
 const currentPlayText = computed<string>(() => {
-  if (!currentPlaySvgAndTextKey.value) {
+  if (currentPlaySvgAndTextKey.value) {
     return t("components.GamePlaygroundHeaderCurrentPlay.unknownGamePlay");
   }
killedBy: Game Playground Header Current Play Component should match snapshot when rendered.
statusReason: Snapshot `Game Playground Header Current Play Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:52:40
 });
 
 const currentPlayText = computed<string>(() => {
-  if (!currentPlaySvgAndTextKey.value) {
-    return t("components.GamePlaygroundHeaderCurrentPlay.unknownGamePlay");
-  }
+  if (!currentPlaySvgAndTextKey.value) {}
   return t(currentPlaySvgAndTextKey.value.text);
 });
killedBy: Game Playground Header Current Play Component Current play SVG icon should not render the current play SVG icon when the current play is unknown.
statusReason: Cannot read properties of undefined (reading 'text')

[Killed] StringLiteral
GamePlayground/GamePlaygroundHeader/GamePlaygroundHeaderCurrentPlay/GamePlaygroundHeaderCurrentPlay.vue:53:14
 
 const currentPlayText = computed<string>(() => {
   if (!currentPlaySvgAndTextKey.value) {
-    return t("components.GamePlaygroundHeaderCurrentPlay.unknownGamePlay");
+    return t("");
   }
   return t(currentPlaySvgAndTextKey.value.text);
killedBy: Game Playground Header Current Play Component Current play text 'should render the current play text f…'
statusReason: expected '' to be 'components.GamePlaygroundHeaderCurren…' // Object.is equality
