[Killed] MethodExpression
game/GamePlaying/GameTeamSide/GameTeamSide.vue:64:46
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const teamPlayers = computed<Player[]>(() => game.value.players.filter(player => player.side.current === props.side));
+const teamPlayers = computed<Player[]>(() => game.value.players);
 
 const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {
killedBy: Game Team Side Component Alive text should render the number of alive werewolves when the side is werewolves.
statusReason: expected 'components.GameTeamSide.aliveTeamPlay…' to be 'components.GameTeamSide.aliveTeamPlay…' // Object.is equality

[Killed] EqualityOperator
game/GamePlaying/GameTeamSide/GameTeamSide.vue:64:82
 const gameStore = useGameStore();
 const { game } = storeToRefs(gameStore);
 
-const teamPlayers = computed<Player[]>(() => game.value.players.filter(player => player.side.current === props.side));
+const teamPlayers = computed<Player[]>(() => game.value.players.filter(player => player.side.current !== props.side));
 
 const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {
killedBy: Game Team Side Component Alive text should render the number of alive werewolves when the side is werewolves.
statusReason: expected 'components.GameTeamSide.aliveTeamPlay…' to be 'components.GameTeamSide.aliveTeamPlay…' // Object.is equality

[Killed] BlockStatement
game/GamePlaying/GameTeamSide/GameTeamSide.vue:66:105
 
 const teamPlayers = computed<Player[]>(() => game.value.players.filter(player => player.side.current === props.side));
 
-const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {
-  if (playerA.isAlive && !playerB.isAlive) {
-    return -1;
-  }
-  return 1;
-}));
+const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {}));
 
 const alivePlayersText = computed<string>(() => {
killedBy: Game Team Side Component Game Team Side Players should render the werewolves players with alive players first when the side is werewolves.
statusReason: expected _Player{ …(6) } to strictly equal _Player{ …(6) }

[Killed] ArrowFunction
game/GamePlaying/GameTeamSide/GameTeamSide.vue:66:50
 
 const teamPlayers = computed<Player[]>(() => game.value.players.filter(player => player.side.current === props.side));
 
-const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {
-  if (playerA.isAlive && !playerB.isAlive) {
-    return -1;
-  }
-  return 1;
-}));
+const aliveFirstTeamPlayers = computed<Player[]>(() => undefined);
 
 const alivePlayersText = computed<string>(() => {
killedBy: Game Team Side Component Game Team Side Players should render the werewolves players with alive players first when the side is werewolves.
statusReason: expected [] to have a length of 4 but got +0

[Killed] ConditionalExpression
game/GamePlaying/GameTeamSide/GameTeamSide.vue:67:7
 const teamPlayers = computed<Player[]>(() => game.value.players.filter(player => player.side.current === props.side));
 
 const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {
-  if (playerA.isAlive && !playerB.isAlive) {
+  if (false) {
     return -1;
   }
killedBy: Game Team Side Component Game Team Side Players should render the werewolves players with alive players first when the side is werewolves.
statusReason: expected _Player{ …(6) } to strictly equal _Player{ …(6) }

[Killed] BooleanLiteral
game/GamePlaying/GameTeamSide/GameTeamSide.vue:67:26
 const teamPlayers = computed<Player[]>(() => game.value.players.filter(player => player.side.current === props.side));
 
 const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {
-  if (playerA.isAlive && !playerB.isAlive) {
+  if (playerA.isAlive && playerB.isAlive) {
     return -1;
   }
killedBy: Game Team Side Component Game Team Side Players should render the werewolves players with alive players first when the side is werewolves.
statusReason: expected _Player{ …(6) } to strictly equal _Player{ …(6) }

[Killed] UnaryOperator
game/GamePlaying/GameTeamSide/GameTeamSide.vue:68:12
 
 const aliveFirstTeamPlayers = computed<Player[]>(() => teamPlayers.value.toSorted((playerA, playerB) => {
   if (playerA.isAlive && !playerB.isAlive) {
-    return -1;
+    return +1;
   }
   return 1;
killedBy: Game Team Side Component Game Team Side Players should render the werewolves players with alive players first when the side is werewolves.
statusReason: expected _Player{ …(6) } to strictly equal _Player{ …(6) }

[Killed] BlockStatement
game/GamePlaying/GameTeamSide/GameTeamSide.vue:73:49
   return 1;
 }));
 
-const alivePlayersText = computed<string>(() => {
-  const alivePlayers = teamPlayers.value.filter(player => player.isAlive);
-
-  return t(`components.GameTeamSide.aliveTeamPlayers`, {
-    alivePlayers: alivePlayers.length,
-    totalPlayers: teamPlayers.value.length,
-  });
-});
+const alivePlayersText = computed<string>(() => {});
 
 const sideSvgIconPath = computed<string>(() => {
killedBy: Game Team Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
game/GamePlaying/GameTeamSide/GameTeamSide.vue:74:49
 }));
 
 const alivePlayersText = computed<string>(() => {
-  const alivePlayers = teamPlayers.value.filter(player => player.isAlive);
+  const alivePlayers = teamPlayers.value.filter(() => undefined);
 
   return t(`components.GameTeamSide.aliveTeamPlayers`, {
killedBy: Game Team Side Component Alive text should render the number of alive werewolves when the side is werewolves.
statusReason: expected 'components.GameTeamSide.aliveTeamPlay…' to be 'components.GameTeamSide.aliveTeamPlay…' // Object.is equality

[Killed] MethodExpression
game/GamePlaying/GameTeamSide/GameTeamSide.vue:74:24
 }));
 
 const alivePlayersText = computed<string>(() => {
-  const alivePlayers = teamPlayers.value.filter(player => player.isAlive);
+  const alivePlayers = teamPlayers.value;
 
   return t(`components.GameTeamSide.aliveTeamPlayers`, {
killedBy: Game Team Side Component Alive text should render the number of alive werewolves when the side is werewolves.
statusReason: expected 'components.GameTeamSide.aliveTeamPlay…' to be 'components.GameTeamSide.aliveTeamPlay…' // Object.is equality

[Killed] BlockStatement
game/GamePlaying/GameTeamSide/GameTeamSide.vue:82:48
   });
 });
 
-const sideSvgIconPath = computed<string>(() => {
-  if (props.side === "villagers") {
-    return "/svg/role/villager.svg";
-  }
-  return "/svg/role/werewolf.svg";
-});
+const sideSvgIconPath = computed<string>(() => {});
 </script>
killedBy: Game Team Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game/GamePlaying/GameTeamSide/GameTeamSide.vue:83:35
 });
 
 const sideSvgIconPath = computed<string>(() => {
-  if (props.side === "villagers") {
-    return "/svg/role/villager.svg";
-  }
+  if (props.side === "villagers") {}
   return "/svg/role/werewolf.svg";
 });
killedBy: Game Team Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game/GamePlaying/GameTeamSide/GameTeamSide.vue:83:7
 });
 
 const sideSvgIconPath = computed<string>(() => {
-  if (props.side === "villagers") {
+  if (false) {
     return "/svg/role/villager.svg";
   }
killedBy: Game Team Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
game/GamePlaying/GameTeamSide/GameTeamSide.vue:84:12
 
 const sideSvgIconPath = computed<string>(() => {
   if (props.side === "villagers") {
-    return "/svg/role/villager.svg";
+    return "";
   }
   return "/svg/role/werewolf.svg";
killedBy: Game Team Side Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Component > should match snapshot when rendered. 1` mismatched
