[Killed] ArrowFunction
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:87:39
 
 const { t } = useI18n();
 
-const roleImageAlt = computed<string>(() => t("components.GameTeamSidePlayer.roleImageAlt", { playerName: props.player.name }));
+const roleImageAlt = computed<string>(() => undefined);
 
 const playerSideGlowClass = computed<string>(() => {
killedBy: Game Team Side Player Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:87:93
 
 const { t } = useI18n();
 
-const roleImageAlt = computed<string>(() => t("components.GameTeamSidePlayer.roleImageAlt", { playerName: props.player.name }));
+const roleImageAlt = computed<string>(() => t("components.GameTeamSidePlayer.roleImageAlt", {}));
 
 const playerSideGlowClass = computed<string>(() => {
killedBy: Game Team Side Player Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:89:52
 
 const roleImageAlt = computed<string>(() => t("components.GameTeamSidePlayer.roleImageAlt", { playerName: props.player.name }));
 
-const playerSideGlowClass = computed<string>(() => {
-  const { player } = props;
-  if (!player.isAlive) {
-    return "";
-  }
-  return player.side.current === "werewolves" ? "glow:border-red-500" : "glow:border-green-500";
-});
+const playerSideGlowClass = computed<string>(() => {});
 
 const roleImageClasses = computed<string>(() => {
killedBy: Game Team Side Player Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:91:24
 
 const playerSideGlowClass = computed<string>(() => {
   const { player } = props;
-  if (!player.isAlive) {
-    return "";
-  }
+  if (!player.isAlive) {}
   return player.side.current === "werewolves" ? "glow:border-red-500" : "glow:border-green-500";
 });
killedBy: Game Team Side Player Component Game Team Side Player should not glow when player is dead.
statusReason: expected [ 'border-2', 'border-gray-700', …(4) ] to strictly equal [ 'border-2', 'border-gray-700', …(3) ]

[Killed] ConditionalExpression
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:91:7
 
 const playerSideGlowClass = computed<string>(() => {
   const { player } = props;
-  if (!player.isAlive) {
+  if (false) {
     return "";
   }
killedBy: Game Team Side Player Component Game Team Side Player should not glow when player is dead.
statusReason: expected [ 'border-2', 'border-gray-700', …(4) ] to strictly equal [ 'border-2', 'border-gray-700', …(3) ]

[Killed] StringLiteral
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:92:12
 const playerSideGlowClass = computed<string>(() => {
   const { player } = props;
   if (!player.isAlive) {
-    return "";
+    return "Stryker was here!";
   }
   return player.side.current === "werewolves" ? "glow:border-red-500" : "glow:border-green-500";
killedBy: Game Team Side Player Component Game Team Side Player should not glow when player is dead.
statusReason: expected [ 'border-2', 'border-gray-700', …(6) ] to strictly equal [ 'border-2', 'border-gray-700', …(3) ]

[Killed] ConditionalExpression
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:94:10
   if (!player.isAlive) {
     return "";
   }
-  return player.side.current === "werewolves" ? "glow:border-red-500" : "glow:border-green-500";
+  return false ? "glow:border-red-500" : "glow:border-green-500";
 });
 
killedBy: Game Team Side Player Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:94:10
   if (!player.isAlive) {
     return "";
   }
-  return player.side.current === "werewolves" ? "glow:border-red-500" : "glow:border-green-500";
+  return true ? "glow:border-red-500" : "glow:border-green-500";
 });
 
killedBy: Game Team Side Player Component Game Team Side Player should glow as green when side is villagers.
statusReason: expected false to be truthy

[Killed] BlockStatement
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:97:49
   return player.side.current === "werewolves" ? "glow:border-red-500" : "glow:border-green-500";
 });
 
-const roleImageClasses = computed<string>(() => {
-  const { player } = props;
-  let classes = playerSideGlowClass.value;
-  if (!player.isAlive) {
-    classes += " grayscale";
-  }
-  return classes;
-});
+const roleImageClasses = computed<string>(() => {});
 </script>
killedBy: Game Team Side Player Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:100:24
 const roleImageClasses = computed<string>(() => {
   const { player } = props;
   let classes = playerSideGlowClass.value;
-  if (!player.isAlive) {
-    classes += " grayscale";
-  }
+  if (!player.isAlive) {}
   return classes;
 });
killedBy: Game Team Side Player Component Game Team Side Player Player role image should have grayscale class when player is dead.
statusReason: expected false to be truthy

[Killed] BooleanLiteral
GamePlaying/GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayer.vue:100:7
 const roleImageClasses = computed<string>(() => {
   const { player } = props;
   let classes = playerSideGlowClass.value;
-  if (!player.isAlive) {
+  if (player.isAlive) {
     classes += " grayscale";
   }
killedBy: Game Team Side Player Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Component > should match snapshot when rendered. 1` mismatched
