[Killed] BlockStatement
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:28:109
 
 const img = useImage();
 
-const playerAttributeSourceSvgAndDescription = computed<PlayerAttributeSvgAndDescription | undefined>(() => {
-  const { attribute } = props;
-
-  const sourceSvgAndDescription = PLAYER_ATTRIBUTES_SOURCES_SVG_AND_DESCRIPTION[attribute.name][attribute.source];
-  if (!sourceSvgAndDescription) {
-    return undefined;
-  }
-  return {
-    svgPath: sourceSvgAndDescription.svgPath,
-    description: t(sourceSvgAndDescription.descriptionKey),
-  };
-});
+const playerAttributeSourceSvgAndDescription = computed<PlayerAttributeSvgAndDescription | undefined>(() => {});
 
 const playerAttributeDescription = computed<string>(() => {
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:32:7
   const { attribute } = props;
 
   const sourceSvgAndDescription = PLAYER_ATTRIBUTES_SOURCES_SVG_AND_DESCRIPTION[attribute.name][attribute.source];
-  if (!sourceSvgAndDescription) {
+  if (true) {
     return undefined;
   }
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:32:7
   const { attribute } = props;
 
   const sourceSvgAndDescription = PLAYER_ATTRIBUTES_SOURCES_SVG_AND_DESCRIPTION[attribute.name][attribute.source];
-  if (!sourceSvgAndDescription) {
+  if (false) {
     return undefined;
   }
killedBy: Game Team Side Player Attribute Component Player Attribute Icon 'should render unknown icon when playe…'
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:41:59
   };
 });
 
-const playerAttributeDescription = computed<string>(() => {
-  if (!playerAttributeSourceSvgAndDescription.value) {
-    return t(`components.GameTeamSidePlayerAttribute.unknownPlayerAttribute`);
-  }
-  return playerAttributeSourceSvgAndDescription.value.description;
-});
+const playerAttributeDescription = computed<string>(() => {});
 
 const playerAttributeSvgPath = computed<string>(() => {
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:42:7
 });
 
 const playerAttributeDescription = computed<string>(() => {
-  if (!playerAttributeSourceSvgAndDescription.value) {
+  if (playerAttributeSourceSvgAndDescription.value) {
     return t(`components.GameTeamSidePlayerAttribute.unknownPlayerAttribute`);
   }
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:42:54
 });
 
 const playerAttributeDescription = computed<string>(() => {
-  if (!playerAttributeSourceSvgAndDescription.value) {
-    return t(`components.GameTeamSidePlayerAttribute.unknownPlayerAttribute`);
-  }
+  if (!playerAttributeSourceSvgAndDescription.value) {}
   return playerAttributeSourceSvgAndDescription.value.description;
 });
killedBy: Game Team Side Player Attribute Component Player Attribute Icon 'should render unknown icon when playe…'
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:48:55
   return playerAttributeSourceSvgAndDescription.value.description;
 });
 
-const playerAttributeSvgPath = computed<string>(() => {
-  if (!playerAttributeSourceSvgAndDescription.value) {
-    return "svg/misc/question-mark.svg";
-  }
-  return playerAttributeSourceSvgAndDescription.value.svgPath;
-});
+const playerAttributeSvgPath = computed<string>(() => {});
 
 const tooltipPosition = computed<"left" | "right">(() => {
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:49:7
 });
 
 const playerAttributeSvgPath = computed<string>(() => {
-  if (!playerAttributeSourceSvgAndDescription.value) {
+  if (true) {
     return "svg/misc/question-mark.svg";
   }
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:49:7
 });
 
 const playerAttributeSvgPath = computed<string>(() => {
-  if (!playerAttributeSourceSvgAndDescription.value) {
+  if (playerAttributeSourceSvgAndDescription.value) {
     return "svg/misc/question-mark.svg";
   }
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:55:58
   return playerAttributeSourceSvgAndDescription.value.svgPath;
 });
 
-const tooltipPosition = computed<"left" | "right">(() => {
-  const { side } = props.player;
-
-  return side.current === "werewolves" ? "left" : "right";
-});
+const tooltipPosition = computed<"left" | "right">(() => {});
 
 const playerAttributeTooltipOptions = computed<TooltipOptions>(() => {
killedBy: Game Team Side Player Attribute Component Player Attribute Icon should have tooltip on right position when player is from villagers side.
statusReason: expected { position: undefined } to strictly equal { position: 'right' }

[Killed] ConditionalExpression
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:58:10
 const tooltipPosition = computed<"left" | "right">(() => {
   const { side } = props.player;
 
-  return side.current === "werewolves" ? "left" : "right";
+  return false ? "left" : "right";
 });
 
killedBy: Game Team Side Player Attribute Component Player Attribute Icon should have tooltip on left position when player is from werewolves side.
statusReason: expected { position: 'right' } to strictly equal { position: 'left' }

[Killed] EqualityOperator
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:58:10
 const tooltipPosition = computed<"left" | "right">(() => {
   const { side } = props.player;
 
-  return side.current === "werewolves" ? "left" : "right";
+  return side.current !== "werewolves" ? "left" : "right";
 });
 
killedBy: Game Team Side Player Attribute Component Player Attribute Icon should have tooltip on right position when player is from villagers side.
statusReason: expected { position: 'left' } to strictly equal { position: 'right' }

[Killed] BlockStatement
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:61:70
   return side.current === "werewolves" ? "left" : "right";
 });
 
-const playerAttributeTooltipOptions = computed<TooltipOptions>(() => {
-  const imgUrl = img(playerAttributeSvgPath.value);
-
-  return {
-    value: `<div class="flex flex-col items-center">
-                <img width="75" src="${imgUrl}" alt="${playerAttributeDescription.value}" class="mb-3"/>
-                <div class="text-center">${playerAttributeDescription.value}</div>
-            </div>`,
-    fitContent: false,
-    escape: false,
-  };
-});
+const playerAttributeTooltipOptions = computed<TooltipOptions>(() => {});
 </script>
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:65:12
   const imgUrl = img(playerAttributeSvgPath.value);
 
   return {
-    value: `<div class="flex flex-col items-center">
-                <img width="75" src="${imgUrl}" alt="${playerAttributeDescription.value}" class="mb-3"/>
-                <div class="text-center">${playerAttributeDescription.value}</div>
-            </div>`,
+    value: ``,
     fitContent: false,
     escape: false,
killedBy: Game Team Side Player Attribute Component should match snapshot when rendered.
statusReason: Snapshot `Game Team Side Player Attribute Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:69:17
                 <img width="75" src="${imgUrl}" alt="${playerAttributeDescription.value}" class="mb-3"/>
                 <div class="text-center">${playerAttributeDescription.value}</div>
             </div>`,
-    fitContent: false,
+    fitContent: true,
     escape: false,
   };
killedBy: Game Team Side Player Attribute Component Player Attribute Icon should have tooltip on right position when player is from villagers side.
statusReason: expected { …(3) } to strictly equal { …(3) }

[Killed] BooleanLiteral
GameTeamSide/GameTeamSidePlayer/GameTeamSidePlayerAttribute/GameTeamSidePlayerAttribute.vue:70:13
                 <div class="text-center">${playerAttributeDescription.value}</div>
             </div>`,
     fitContent: false,
-    escape: false,
+    escape: true,
   };
 });
killedBy: Game Team Side Player Attribute Component Player Attribute Icon should have tooltip on right position when player is from villagers side.
statusReason: expected { …(3) } to strictly equal { …(3) }
