[Killed] BooleanLiteral
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:37:56
 const { setPlayersToCreateGameDto } = createGameDtoStore;
 const { isMinimumPlayersReached } = useCreateGameDtoValidation(createGameDto);
 
-const isLoadingGetRandomGameComposition = ref<boolean>(false);
+const isLoadingGetRandomGameComposition = ref<boolean>(true);
 
 const containerTooltip = computed<string | undefined>(() => {
killedBy: Game Lobby Random Composition Button Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Random Composition Button Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:39:61
 
 const isLoadingGetRandomGameComposition = ref<boolean>(false);
 
-const containerTooltip = computed<string | undefined>(() => {
-  if (!isMinimumPlayersReached.value) {
-    return t("components.GameLobbyRandomCompositionButton.minPlayersNotReached");
-  }
-  return undefined;
-});
+const containerTooltip = computed<string | undefined>(() => {});
 
 async function handleRandomCompositionButtonClick(): Promise<void> {
killedBy: Game Lobby Random Composition Button Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Random Composition Button Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:40:7
 const isLoadingGetRandomGameComposition = ref<boolean>(false);
 
 const containerTooltip = computed<string | undefined>(() => {
-  if (!isMinimumPlayersReached.value) {
+  if (true) {
     return t("components.GameLobbyRandomCompositionButton.minPlayersNotReached");
   }
killedBy: Game Lobby Random Composition Button Component Button container should not assign tooltip when button is enabled.
statusReason: expected 'components.GameLobbyRandomComposition…' to be undefined

[Killed] BlockStatement
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:40:39
 const isLoadingGetRandomGameComposition = ref<boolean>(false);
 
 const containerTooltip = computed<string | undefined>(() => {
-  if (!isMinimumPlayersReached.value) {
-    return t("components.GameLobbyRandomCompositionButton.minPlayersNotReached");
-  }
+  if (!isMinimumPlayersReached.value) {}
   return undefined;
 });
killedBy: Game Lobby Random Composition Button Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Random Composition Button Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:46:68
   return undefined;
 });
 
-async function handleRandomCompositionButtonClick(): Promise<void> {
-  isLoadingGetRandomGameComposition.value = true;
-  const randomGameComposition = await fetchRandomGameComposition({
-    players: createGameDto.value.players,
-    excludedRoles: [
-      "thief",
-      "actor",
-      "prejudiced-manipulator",
-    ],
-  });
-  if (randomGameComposition !== null) {
-    setPlayersToCreateGameDto(randomGameComposition);
-  }
-  isLoadingGetRandomGameComposition.value = false;
-}
+async function handleRandomCompositionButtonClick(): Promise<void> {}
 </script>
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should fetch random game composition when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BooleanLiteral
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:47:45
 });
 
 async function handleRandomCompositionButtonClick(): Promise<void> {
-  isLoadingGetRandomGameComposition.value = true;
+  isLoadingGetRandomGameComposition.value = false;
   const randomGameComposition = await fetchRandomGameComposition({
     players: createGameDto.value.players,
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should be loading when fetch is in progress.
statusReason: expect(received).toBeTrue()

Expected value to be true:
  true
Received:
  false

[Killed] ObjectLiteral
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:48:66
 
 async function handleRandomCompositionButtonClick(): Promise<void> {
   isLoadingGetRandomGameComposition.value = true;
-  const randomGameComposition = await fetchRandomGameComposition({
-    players: createGameDto.value.players,
-    excludedRoles: [
-      "thief",
-      "actor",
-      "prejudiced-manipulator",
-    ],
-  });
+  const randomGameComposition = await fetchRandomGameComposition({});
   if (randomGameComposition !== null) {
     setPlayersToCreateGameDto(randomGameComposition);
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should fetch random game composition when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "excludedRoles": Array [
      "thief",
      "actor",
      "prejudiced-manipulator",

[Killed] StringLiteral
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:51:7
   const randomGameComposition = await fetchRandomGameComposition({
     players: createGameDto.value.players,
     excludedRoles: [
-      "thief",
+      "",
       "actor",
       "prejudiced-manipulator",
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should fetch random game composition when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "excludedRoles": Array [
      "thief",
      "actor",
      "prejudiced-manipulator",

[Killed] StringLiteral
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:52:7
     players: createGameDto.value.players,
     excludedRoles: [
       "thief",
-      "actor",
+      "",
       "prejudiced-manipulator",
     ],
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should fetch random game composition when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "excludedRoles": Array [
      "thief",
      "actor",
      "prejudiced-manipulator",

[Killed] ConditionalExpression
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:56:7
       "prejudiced-manipulator",
     ],
   });
-  if (randomGameComposition !== null) {
+  if (false) {
     setPlayersToCreateGameDto(randomGameComposition);
   }
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should set fetched random game composition to create game dto when fetched.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] EqualityOperator
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:56:7
       "prejudiced-manipulator",
     ],
   });
-  if (randomGameComposition !== null) {
+  if (randomGameComposition === null) {
     setPlayersToCreateGameDto(randomGameComposition);
   }
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should set fetched random game composition to create game dto when fetched.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BooleanLiteral
game-lobby/GameLobbyFooter/GameLobbyRandomCompositionButton/GameLobbyRandomCompositionButton.vue:59:45
   if (randomGameComposition !== null) {
     setPlayersToCreateGameDto(randomGameComposition);
   }
-  isLoadingGetRandomGameComposition.value = false;
+  isLoadingGetRandomGameComposition.value = true;
 }
 </script>
killedBy: Game Lobby Random Composition Button Component Button container Button Click on button should not be loading when fetch returned.
statusReason: expected 'true' to be 'false' // Object.is equality
