[Killed] BooleanLiteral
game-lobby/GameLobbyFooter/GameLobbyStartGameButton/GameLobbyStartGameButton.vue:38:42
 const { createGameDto } = storeToRefs(createGameDtoStore);
 const { canCreateGame, gameCreationValidationErrors } = useCreateGameDtoValidation(createGameDto);
 
-const isLoadingCreateGame = ref<boolean>(false);
+const isLoadingCreateGame = ref<boolean>(true);
 
 const containerTooltip = computed<string | undefined>(() => gameCreationValidationErrors.value[0]);
killedBy: Game Lobby Start Game Button Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Start Game Button Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
game-lobby/GameLobbyFooter/GameLobbyStartGameButton/GameLobbyStartGameButton.vue:40:55
 
 const isLoadingCreateGame = ref<boolean>(false);
 
-const containerTooltip = computed<string | undefined>(() => gameCreationValidationErrors.value[0]);
+const containerTooltip = computed<string | undefined>(() => undefined);
 
 async function handleStartGameButtonClick(): Promise<void> {
killedBy: Game Lobby Start Game Button Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Start Game Button Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-lobby/GameLobbyFooter/GameLobbyStartGameButton/GameLobbyStartGameButton.vue:42:60
 
 const containerTooltip = computed<string | undefined>(() => gameCreationValidationErrors.value[0]);
 
-async function handleStartGameButtonClick(): Promise<void> {
-  isLoadingCreateGame.value = true;
-  const createdGame = await createGame(createGameDto.value);
-  if (createdGame) {
-    await navigateTo(`/game/${createdGame._id}`);
-    addSuccessToast({ summary: t("components.GameLobbyStartGameButton.gameCreated") });
-  }
-  isLoadingCreateGame.value = false;
-}
+async function handleStartGameButtonClick(): Promise<void> {}
 </script>
killedBy: Game Lobby Start Game Button Component Button Click on button should create game when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BooleanLiteral
game-lobby/GameLobbyFooter/GameLobbyStartGameButton/GameLobbyStartGameButton.vue:43:31
 const containerTooltip = computed<string | undefined>(() => gameCreationValidationErrors.value[0]);
 
 async function handleStartGameButtonClick(): Promise<void> {
-  isLoadingCreateGame.value = true;
+  isLoadingCreateGame.value = false;
   const createdGame = await createGame(createGameDto.value);
   if (createdGame) {
killedBy: Game Lobby Start Game Button Component Button Click on button should be loading when fetch is in progress.
statusReason: expect(received).toBeTrue()

Expected value to be true:
  true
Received:
  false

[Killed] BlockStatement
game-lobby/GameLobbyFooter/GameLobbyStartGameButton/GameLobbyStartGameButton.vue:45:20
 async function handleStartGameButtonClick(): Promise<void> {
   isLoadingCreateGame.value = true;
   const createdGame = await createGame(createGameDto.value);
-  if (createdGame) {
-    await navigateTo(`/game/${createdGame._id}`);
-    addSuccessToast({ summary: t("components.GameLobbyStartGameButton.gameCreated") });
-  }
+  if (createdGame) {}
   isLoadingCreateGame.value = false;
 }
killedBy: Game Lobby Start Game Button Component Button Click on button should navigate to game with id in params when game is created.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
game-lobby/GameLobbyFooter/GameLobbyStartGameButton/GameLobbyStartGameButton.vue:45:7
 async function handleStartGameButtonClick(): Promise<void> {
   isLoadingCreateGame.value = true;
   const createdGame = await createGame(createGameDto.value);
-  if (createdGame) {
+  if (true) {
     await navigateTo(`/game/${createdGame._id}`);
     addSuccessToast({ summary: t("components.GameLobbyStartGameButton.gameCreated") });
killedBy: Game Lobby Start Game Button Component Button Click on button should not be loading when fetch returned.
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BooleanLiteral
game-lobby/GameLobbyFooter/GameLobbyStartGameButton/GameLobbyStartGameButton.vue:49:31
     await navigateTo(`/game/${createdGame._id}`);
     addSuccessToast({ summary: t("components.GameLobbyStartGameButton.gameCreated") });
   }
-  isLoadingCreateGame.value = false;
+  isLoadingCreateGame.value = true;
 }
 </script>
killedBy: Game Lobby Start Game Button Component Button Click on button should not be loading when fetch returned.
statusReason: expected 'true' to be 'false' // Object.is equality
