[Killed] StringLiteral
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:46:38
 
 const createGameDtoStore = useCreateGameDtoStore();
 
-const playerInputValue = ref<string>("");
+const playerInputValue = ref<string>("Stryker was here!");
 
 const gameLobbyPlayerInput = ref<GameLobbyPlayerInputExposed | null>(null);
killedBy: Game Lobby Header Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Header Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:50:43
 
 const gameLobbyPlayerInput = ref<GameLobbyPlayerInputExposed | null>(null);
 
-function addPlayerToCreateGameDto(): void {
-  if (gameLobbyPlayerInput.value === null) {
-    throw createError("Game Lobby Player Input is not initialized");
-  }
-  if (gameLobbyPlayerInput.value.isAddButtonDisabled) {
-    return;
-  }
-  const trimmedPlayerInputValue = playerInputValue.value.trim();
-  playerInputValue.value = "";
-  if (!trimmedPlayerInputValue) {
-    return;
-  }
-  const playerToAdd: CreateGamePlayerDto = CreateGamePlayerDto.create({
-    name: trimmedPlayerInputValue,
-    role: {},
-    side: {},
-  });
-  createGameDtoStore.addPlayerToCreateGameDto(playerToAdd);
-}
+function addPlayerToCreateGameDto(): void {}
 
 function handleGameOptionsButtonClick(): void {
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should not empty input when game lobby player input ref is not set.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:51:7
 const gameLobbyPlayerInput = ref<GameLobbyPlayerInputExposed | null>(null);
 
 function addPlayerToCreateGameDto(): void {
-  if (gameLobbyPlayerInput.value === null) {
+  if (false) {
     throw createError("Game Lobby Player Input is not initialized");
   }
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should not empty input when game lobby player input ref is not set.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:51:7
 const gameLobbyPlayerInput = ref<GameLobbyPlayerInputExposed | null>(null);
 
 function addPlayerToCreateGameDto(): void {
-  if (gameLobbyPlayerInput.value === null) {
+  if (true) {
     throw createError("Game Lobby Player Input is not initialized");
   }
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should add player when form is valid and submitted.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:54:7
   if (gameLobbyPlayerInput.value === null) {
     throw createError("Game Lobby Player Input is not initialized");
   }
-  if (gameLobbyPlayerInput.value.isAddButtonDisabled) {
+  if (true) {
     return;
   }
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should add player when form is valid and submitted.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:54:7
   if (gameLobbyPlayerInput.value === null) {
     throw createError("Game Lobby Player Input is not initialized");
   }
-  if (gameLobbyPlayerInput.value.isAddButtonDisabled) {
+  if (false) {
     return;
   }
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should not empty input when add button is disabled.
statusReason: expected '' to be 'Player 1' // Object.is equality

[Killed] MethodExpression
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:57:35
   if (gameLobbyPlayerInput.value.isAddButtonDisabled) {
     return;
   }
-  const trimmedPlayerInputValue = playerInputValue.value.trim();
+  const trimmedPlayerInputValue = playerInputValue.value;
   playerInputValue.value = "";
   if (!trimmedPlayerInputValue) {
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should not add player when trimmed input is empty.
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      _CreateGamePlayerDto {

[Killed] ConditionalExpression
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:59:7
   }
   const trimmedPlayerInputValue = playerInputValue.value.trim();
   playerInputValue.value = "";
-  if (!trimmedPlayerInputValue) {
+  if (true) {
     return;
   }
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should add player when form is valid and submitted.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:59:7
   }
   const trimmedPlayerInputValue = playerInputValue.value.trim();
   playerInputValue.value = "";
-  if (!trimmedPlayerInputValue) {
+  if (false) {
     return;
   }
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should not add player when trimmed input is empty.
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      _CreateGamePlayerDto {

[Killed] ObjectLiteral
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:62:71
   if (!trimmedPlayerInputValue) {
     return;
   }
-  const playerToAdd: CreateGamePlayerDto = CreateGamePlayerDto.create({
-    name: trimmedPlayerInputValue,
-    role: {},
-    side: {},
-  });
+  const playerToAdd: CreateGamePlayerDto = CreateGamePlayerDto.create({});
   createGameDtoStore.addPlayerToCreateGameDto(playerToAdd);
 }
killedBy: Game Lobby Header Component Game Lobby Player Input Form Add Player Form should add player when form is valid and submitted.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  _CreateGamePlayerDto {
    "group": undefined,
    "name": "Player 1",
    "role": _CreateGamePlayerRoleDto {
      "name": undefined,

[Killed] BlockStatement
pages/game-lobby/GameLobbyHeader/GameLobbyHeader.vue:70:47
   createGameDtoStore.addPlayerToCreateGameDto(playerToAdd);
 }
 
-function handleGameOptionsButtonClick(): void {
-  emit("gameOptionsButtonClick");
-}
+function handleGameOptionsButtonClick(): void {}
 </script>
killedBy: Game Lobby Header Component Game Lobby Player Input Form Setup Buttons should emit 'gameOptionsButtonClick' event when options button is clicked.
statusReason: expected undefined to be truthy
