[Killed] BlockStatement
GameLobbyHeader/GameLobbyHeaderSetupButtons/GameLobbyHeaderOptionsButton/GameLobbyHeaderOptionsButton.vue:17:31
 
 const emit = defineEmits<GameLobbyHeaderOptionsButtonEmits>();
 
-function clickHandler(): void {
-  emit("gameOptionsButtonClick");
-}
+function clickHandler(): void {}
 </script>
killedBy: Game Lobby Header Options Button Component Options Button Click on button should emit 'gameOptionsButtonClick' event when clicked.
statusReason: expected undefined to be truthy
