[Killed] EqualityOperator
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:68:106
 
 const inputValue = defineModel<string>({ required: true });
 
-const doesPlayerNameExistInGame = computed<boolean>(() => createGameDto.value.players.some(({ name }) => name === inputValue.value.trim()));
+const doesPlayerNameExistInGame = computed<boolean>(() => createGameDto.value.players.some(({ name }) => name !== inputValue.value.trim()));
 
 const hasPlayerNameReachedMaxLength = computed<boolean>(() => inputValue.value.trim().length >= MAX_PLAYER_NAME_LENGTH);
killedBy: Game Lobby Player Input Component Add button should be enabled when input value is not empty and create game dto has not reached max players.
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ArrowFunction
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:68:92
 
 const inputValue = defineModel<string>({ required: true });
 
-const doesPlayerNameExistInGame = computed<boolean>(() => createGameDto.value.players.some(({ name }) => name === inputValue.value.trim()));
+const doesPlayerNameExistInGame = computed<boolean>(() => createGameDto.value.players.some(() => undefined));
 
 const hasPlayerNameReachedMaxLength = computed<boolean>(() => inputValue.value.trim().length >= MAX_PLAYER_NAME_LENGTH);
killedBy: Game Lobby Player Input Component Text input should have invalid class when player name exists in game.
statusReason: expect(received).toBeTrue()

Expected value to be true:
  true
Received:
  false

[Killed] ArrowFunction
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:70:57
 
 const doesPlayerNameExistInGame = computed<boolean>(() => createGameDto.value.players.some(({ name }) => name === inputValue.value.trim()));
 
-const hasPlayerNameReachedMaxLength = computed<boolean>(() => inputValue.value.trim().length >= MAX_PLAYER_NAME_LENGTH);
+const hasPlayerNameReachedMaxLength = computed<boolean>(() => undefined);
 
 const doesGameHaveMaxPlayers = computed<boolean>(() => createGameDto.value.players.length >= MAX_PLAYERS_IN_GAME);
killedBy: Game Lobby Player Input Component Help Text should translate player name max length help message when player name is too long.
statusReason: expected 'components.GameLobbyPlayerInput.pleas…' to be 'components.GameLobbyPlayerInput.playe…' // Object.is equality

[Killed] ConditionalExpression
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:70:63
 
 const doesPlayerNameExistInGame = computed<boolean>(() => createGameDto.value.players.some(({ name }) => name === inputValue.value.trim()));
 
-const hasPlayerNameReachedMaxLength = computed<boolean>(() => inputValue.value.trim().length >= MAX_PLAYER_NAME_LENGTH);
+const hasPlayerNameReachedMaxLength = computed<boolean>(() => true);
 
 const doesGameHaveMaxPlayers = computed<boolean>(() => createGameDto.value.players.length >= MAX_PLAYERS_IN_GAME);
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:72:56
 
 const hasPlayerNameReachedMaxLength = computed<boolean>(() => inputValue.value.trim().length >= MAX_PLAYER_NAME_LENGTH);
 
-const doesGameHaveMaxPlayers = computed<boolean>(() => createGameDto.value.players.length >= MAX_PLAYERS_IN_GAME);
+const doesGameHaveMaxPlayers = computed<boolean>(() => createGameDto.value.players.length < MAX_PLAYERS_IN_GAME);
 
 const isInputDisabled = computed<boolean>(() => doesGameHaveMaxPlayers.value);
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:72:56
 
 const hasPlayerNameReachedMaxLength = computed<boolean>(() => inputValue.value.trim().length >= MAX_PLAYER_NAME_LENGTH);
 
-const doesGameHaveMaxPlayers = computed<boolean>(() => createGameDto.value.players.length >= MAX_PLAYERS_IN_GAME);
+const doesGameHaveMaxPlayers = computed<boolean>(() => true);
 
 const isInputDisabled = computed<boolean>(() => doesGameHaveMaxPlayers.value);
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:74:43
 
 const doesGameHaveMaxPlayers = computed<boolean>(() => createGameDto.value.players.length >= MAX_PLAYERS_IN_GAME);
 
-const isInputDisabled = computed<boolean>(() => doesGameHaveMaxPlayers.value);
+const isInputDisabled = computed<boolean>(() => undefined);
 
 const isAddButtonDisabled = computed<boolean>(() => doesPlayerNameExistInGame.value || isInputDisabled.value);
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:76:53
 
 const isInputDisabled = computed<boolean>(() => doesGameHaveMaxPlayers.value);
 
-const isAddButtonDisabled = computed<boolean>(() => doesPlayerNameExistInGame.value || isInputDisabled.value);
+const isAddButtonDisabled = computed<boolean>(() => true);
 
 const playerNameInputHelpText = computed<string>(() => {
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:76:47
 
 const isInputDisabled = computed<boolean>(() => doesGameHaveMaxPlayers.value);
 
-const isAddButtonDisabled = computed<boolean>(() => doesPlayerNameExistInGame.value || isInputDisabled.value);
+const isAddButtonDisabled = computed<boolean>(() => undefined);
 
 const playerNameInputHelpText = computed<string>(() => {
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:78:56
 
 const isAddButtonDisabled = computed<boolean>(() => doesPlayerNameExistInGame.value || isInputDisabled.value);
 
-const playerNameInputHelpText = computed<string>(() => {
-  if (doesGameHaveMaxPlayers.value) {
-    return t("components.GameLobbyPlayerInput.maxPlayersReached");
-  }
-  if (doesPlayerNameExistInGame.value) {
-    return t("components.GameLobbyPlayerInput.playerNameIsAlreadyTaken");
-  }
-  if (hasPlayerNameReachedMaxLength.value) {
-    return t("components.GameLobbyPlayerInput.playerNameMaxLengthReached");
-  }
-  return t("components.GameLobbyPlayerInput.pleaseEnterPlayerName");
-});
+const playerNameInputHelpText = computed<string>(() => {});
 
 defineExpose({ isAddButtonDisabled });
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:79:37
 const isAddButtonDisabled = computed<boolean>(() => doesPlayerNameExistInGame.value || isInputDisabled.value);
 
 const playerNameInputHelpText = computed<string>(() => {
-  if (doesGameHaveMaxPlayers.value) {
-    return t("components.GameLobbyPlayerInput.maxPlayersReached");
-  }
+  if (doesGameHaveMaxPlayers.value) {}
   if (doesPlayerNameExistInGame.value) {
     return t("components.GameLobbyPlayerInput.playerNameIsAlreadyTaken");
killedBy: Game Lobby Player Input Component Help Text should translate max players reached help message when max players are reached in game.
statusReason: expected 'components.GameLobbyPlayerInput.pleas…' to be 'components.GameLobbyPlayerInput.maxPl…' // Object.is equality

[Killed] ConditionalExpression
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:79:7
 const isAddButtonDisabled = computed<boolean>(() => doesPlayerNameExistInGame.value || isInputDisabled.value);
 
 const playerNameInputHelpText = computed<string>(() => {
-  if (doesGameHaveMaxPlayers.value) {
+  if (false) {
     return t("components.GameLobbyPlayerInput.maxPlayersReached");
   }
killedBy: Game Lobby Player Input Component Help Text should translate max players reached help message when max players are reached in game.
statusReason: expected 'components.GameLobbyPlayerInput.pleas…' to be 'components.GameLobbyPlayerInput.maxPl…' // Object.is equality

[Killed] ConditionalExpression
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:82:7
   if (doesGameHaveMaxPlayers.value) {
     return t("components.GameLobbyPlayerInput.maxPlayersReached");
   }
-  if (doesPlayerNameExistInGame.value) {
+  if (false) {
     return t("components.GameLobbyPlayerInput.playerNameIsAlreadyTaken");
   }
killedBy: Game Lobby Player Input Component Help Text should translate player name exists help message when player name exists in game.
statusReason: expected 'components.GameLobbyPlayerInput.pleas…' to be 'components.GameLobbyPlayerInput.playe…' // Object.is equality

[Killed] BlockStatement
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:82:40
   if (doesGameHaveMaxPlayers.value) {
     return t("components.GameLobbyPlayerInput.maxPlayersReached");
   }
-  if (doesPlayerNameExistInGame.value) {
-    return t("components.GameLobbyPlayerInput.playerNameIsAlreadyTaken");
-  }
+  if (doesPlayerNameExistInGame.value) {}
   if (hasPlayerNameReachedMaxLength.value) {
     return t("components.GameLobbyPlayerInput.playerNameMaxLengthReached");
killedBy: Game Lobby Player Input Component Help Text should translate player name exists help message when player name exists in game.
statusReason: expected 'components.GameLobbyPlayerInput.pleas…' to be 'components.GameLobbyPlayerInput.playe…' // Object.is equality

[Killed] ConditionalExpression
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:85:7
   if (doesPlayerNameExistInGame.value) {
     return t("components.GameLobbyPlayerInput.playerNameIsAlreadyTaken");
   }
-  if (hasPlayerNameReachedMaxLength.value) {
+  if (true) {
     return t("components.GameLobbyPlayerInput.playerNameMaxLengthReached");
   }
killedBy: Game Lobby Player Input Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Input Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game-lobby/GameLobbyHeader/GameLobbyPlayerInput/GameLobbyPlayerInput.vue:85:7
   if (doesPlayerNameExistInGame.value) {
     return t("components.GameLobbyPlayerInput.playerNameIsAlreadyTaken");
   }
-  if (hasPlayerNameReachedMaxLength.value) {
+  if (false) {
     return t("components.GameLobbyPlayerInput.playerNameMaxLengthReached");
   }
killedBy: Game Lobby Player Input Component Help Text should translate player name max length help message when player name is too long.
statusReason: expected 'components.GameLobbyPlayerInput.pleas…' to be 'components.GameLobbyPlayerInput.playe…' // Object.is equality
