[Killed] BlockStatement
pages/game-lobby/GameLobbyOptionsHub/GameLobbyOptionsHub.vue:42:23
 
 const isVisible = ref<boolean>(false);
 
-function open(): void {
-  isVisible.value = true;
-}
+function open(): void {}
 
 function close(): void {
killedBy: Game Lobby Options Hub Component Dialog open should set dialog to visible when opened.
statusReason: expected false to be truthy

[Killed] BooleanLiteral
pages/game-lobby/GameLobbyOptionsHub/GameLobbyOptionsHub.vue:43:21
 const isVisible = ref<boolean>(false);
 
 function open(): void {
-  isVisible.value = true;
+  isVisible.value = false;
 }
 
killedBy: Game Lobby Options Hub Component Dialog open should set dialog to visible when opened.
statusReason: expected false to be truthy
