[Killed] ArrowFunction
GameLobbyOptionsHub/GameLobbyOptionsHubTabView/GameLobbyOptionsHubCompositionTab/GameLobbyOptionsHubCompositionTab.vue:35:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isCompositionHiddenValue = computed<boolean>({
-  get: () => createGameDto.value.options.composition.isHidden,
+  get: () => undefined,
   set: value => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHub/GameLobbyOptionsHubTabView/GameLobbyOptionsHubCompositionTab/GameLobbyOptionsHubCompositionTab.vue:36:17
 
 const isCompositionHiddenValue = computed<boolean>({
   get: () => createGameDto.value.options.composition.isHidden,
-  set: value => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.composition.isHidden = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: value => {},
 });
 
killedBy: Game Lobby Options Hub Composition Tab Component Is Composition hidden option should update create game dto when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHub/GameLobbyOptionsHubTabView/GameLobbyOptionsHubCompositionTab/GameLobbyOptionsHubCompositionTab.vue:43:63
   },
 });
 
-const isCompositionHiddenDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isCompositionHiddenValue.value);
-
-  return t(`components.GameLobbyOptionsHubCompositionTab.options.isHidden.descriptions.${booleanAsAffirmative}`);
-});
+const isCompositionHiddenDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Composition Tab Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Composition Tab Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHub/GameLobbyOptionsHubTabView/GameLobbyOptionsHubCompositionTab/GameLobbyOptionsHubCompositionTab.vue:46:12
 const isCompositionHiddenDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(isCompositionHiddenValue.value);
 
-  return t(`components.GameLobbyOptionsHubCompositionTab.options.isHidden.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Composition Tab Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Composition Tab Component > should match snapshot when rendered. 1` mismatched
