[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabActor/GameLobbyOptionsHubRolesTabActor.vue:43:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isActorPowerlessOnWerewolvesSideValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.actor.isPowerlessOnWerewolvesSide,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Actor Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Actor Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabActor/GameLobbyOptionsHubRolesTabActor.vue:44:28
 
 const isActorPowerlessOnWerewolvesSideValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.actor.isPowerlessOnWerewolvesSide,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.actor.isPowerlessOnWerewolvesSide = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Actor Component Is powerless on werewolves side option should update create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabActor/GameLobbyOptionsHubRolesTabActor.vue:51:76
   },
 });
 
-const isActorPowerlessOnWerewolvesSideDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isActorPowerlessOnWerewolvesSideValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabActor.options.isPowerlessOnWerewolvesSide.descriptions.${booleanAsAffirmative}`);
-});
+const isActorPowerlessOnWerewolvesSideDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Actor Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Actor Component > should match snapshot when rendered. 1` mismatched
