[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabBearTamer/GameLobbyOptionsHubRolesTabBearTamer.vue:43:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const doesBearTamerGrowlOnWerewolvesSideValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.bearTamer.doesGrowlOnWerewolvesSide,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Tab Bear Tamer Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab Bear Tamer Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabBearTamer/GameLobbyOptionsHubRolesTabBearTamer.vue:44:28
 
 const doesBearTamerGrowlOnWerewolvesSideValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.bearTamer.doesGrowlOnWerewolvesSide,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.bearTamer.doesGrowlOnWerewolvesSide = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Tab Bear Tamer Component Does Growl on Werewolves Side option should update create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabBearTamer/GameLobbyOptionsHubRolesTabBearTamer.vue:51:78
   },
 });
 
-const doesBearTamerGrowlOnWerewolvesSideDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(doesBearTamerGrowlOnWerewolvesSideValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabBearTamer.options.doesGrowlOnWerewolvesSide.descriptions.${booleanAsAffirmative}`);
-});
+const doesBearTamerGrowlOnWerewolvesSideDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Tab Bear Tamer Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab Bear Tamer Component > should match snapshot when rendered. 1` mismatched
