[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabBigBadWolf/GameLobbyOptionsHubRolesTabBigBadWolf.vue:43:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isBigBadWolfPowerlessIfWerewolfDiesValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.bigBadWolf.isPowerlessIfWerewolfDies,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabBigBadWolf/GameLobbyOptionsHubRolesTabBigBadWolf.vue:44:28
 
 const isBigBadWolfPowerlessIfWerewolfDiesValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.bigBadWolf.isPowerlessIfWerewolfDies,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.bigBadWolf.isPowerlessIfWerewolfDies = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Big Bad Wolf Component Is Powerless if one Werewolf dies option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabBigBadWolf/GameLobbyOptionsHubRolesTabBigBadWolf.vue:51:79
   },
 });
 
-const isBigBadWolfPowerlessIfWerewolfDiesDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isBigBadWolfPowerlessIfWerewolfDiesValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabBigBadWolf.options.isPowerlessIfWerewolfDies.descriptions.${booleanAsAffirmative}`);
-});
+const isBigBadWolfPowerlessIfWerewolfDiesDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Big Bad Wolf Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Big Bad Wolf Component > should match snapshot when rendered. 1` mismatched
