[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:55:55
 const { t } = useI18n();
 const { convertBooleanAsAffirmativeString } = useStrings();
 
-const mustCupidWinWithLoversValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.cupid.mustWinWithLovers,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.cupid.mustWinWithLovers = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const mustCupidWinWithLoversValue = computed<boolean>({});
 
 const doLoversRevealRoleToEachOtherValue = computed<boolean>({
killedBy: Game Lobby Options Hub Roles Tab Cupid Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:56:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const mustCupidWinWithLoversValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.cupid.mustWinWithLovers,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Cupid Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Cupid Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:57:28
 
 const mustCupidWinWithLoversValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.cupid.mustWinWithLovers,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.cupid.mustWinWithLovers = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Cupid Component Cupid must win with Lovers option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:64:62
   },
 });
 
-const doLoversRevealRoleToEachOtherValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.cupid.lovers.doRevealRoleToEachOther,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.cupid.lovers.doRevealRoleToEachOther = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const doLoversRevealRoleToEachOtherValue = computed<boolean>({});
 
 const mustCupidWinWithLoversDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Cupid Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:65:8
 });
 
 const doLoversRevealRoleToEachOtherValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.cupid.lovers.doRevealRoleToEachOther,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:66:28
 
 const doLoversRevealRoleToEachOtherValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.cupid.lovers.doRevealRoleToEachOther,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.cupid.lovers.doRevealRoleToEachOther = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Cupid Component Do Lovers reveal role to each other option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:73:66
   },
 });
 
-const mustCupidWinWithLoversDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(mustCupidWinWithLoversValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabCupid.options.mustWinWithLovers.descriptions.${booleanAsAffirmative}`);
-});
+const mustCupidWinWithLoversDescription = computed<string>(() => {});
 
 const doLoversRevealRoleToEachOtherDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabCupid/GameLobbyOptionsHubRolesTabCupid.vue:79:73
   return t(`components.GameLobbyOptionsHubRolesTabCupid.options.mustWinWithLovers.descriptions.${booleanAsAffirmative}`);
 });
 
-const doLoversRevealRoleToEachOtherDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(doLoversRevealRoleToEachOtherValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabCupid.options.lovers.doRevealRoleToEachOther.descriptions.${booleanAsAffirmative}`);
-});
+const doLoversRevealRoleToEachOtherDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched
