[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabDefender/GameLobbyOptionsHubRolesTabDefender.vue:42:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const canDefenderProtectTwiceValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.defender.canProtectTwice,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Defender Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Defender Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabDefender/GameLobbyOptionsHubRolesTabDefender.vue:43:28
 
 const canDefenderProtectTwiceValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.defender.canProtectTwice,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.defender.canProtectTwice = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Defender Component Can Defender protect twice option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabDefender/GameLobbyOptionsHubRolesTabDefender.vue:50:67
   },
 });
 
-const canDefenderProtectTwiceDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(canDefenderProtectTwiceValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabDefender.options.canProtectTwice.descriptions.${booleanAsAffirmative}`);
-});
+const canDefenderProtectTwiceDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Defender Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Defender Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabDefender/GameLobbyOptionsHubRolesTabDefender.vue:53:12
 const canDefenderProtectTwiceDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(canDefenderProtectTwiceValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabDefender.options.canProtectTwice.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Roles Tab Defender Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Defender Component > should match snapshot when rendered. 1` mismatched
