[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:75:64
 const { t } = useI18n();
 const { convertBooleanAsAffirmativeString } = useStrings();
 
-const elderLivesCountAgainstWerewolvesValue = computed<number>({
-  get: () => createGameDto.value.options.roles.elder.livesCountAgainstWerewolves,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.elder.livesCountAgainstWerewolves = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const elderLivesCountAgainstWerewolvesValue = computed<number>({});
 
 const doesElderTakeHisRevengeValue = computed<boolean>({
killedBy: Game Lobby Options Hub Roles Tab Elder Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:76:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const elderLivesCountAgainstWerewolvesValue = computed<number>({
-  get: () => createGameDto.value.options.roles.elder.livesCountAgainstWerewolves,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab Elder Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Elder Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:77:34
 
 const elderLivesCountAgainstWerewolvesValue = computed<number>({
   get: () => createGameDto.value.options.roles.elder.livesCountAgainstWerewolves,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.elder.livesCountAgainstWerewolves = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Elder Component Elder Lives against Werewolves options should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:78:9
 const elderLivesCountAgainstWerewolvesValue = computed<number>({
   get: () => createGameDto.value.options.roles.elder.livesCountAgainstWerewolves,
   set: (value: number | null) => {
-    if (value === null) {
+    if (false) {
       return;
     }
killedBy: Game Lobby Options Hub Roles Tab Elder Component Elder Lives against Werewolves options should not update the create game dto store when the option is changed by the input number and the value is null
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      _CreateGameDto {

[Killed] ConditionalExpression
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:78:9
 const elderLivesCountAgainstWerewolvesValue = computed<number>({
   get: () => createGameDto.value.options.roles.elder.livesCountAgainstWerewolves,
   set: (value: number | null) => {
-    if (value === null) {
+    if (true) {
       return;
     }
killedBy: Game Lobby Options Hub Roles Tab Elder Component Elder Lives against Werewolves options should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:88:8
 });
 
 const doesElderTakeHisRevengeValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.elder.doesTakeHisRevenge,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Elder Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Elder Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:89:28
 
 const doesElderTakeHisRevengeValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.elder.doesTakeHisRevenge,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.elder.doesTakeHisRevenge = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Elder Component Elder takes his revenge option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:96:76
   },
 });
 
-const elderLivesCountAgainstWerewolvesDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabElder.options.livesCountAgainstWerewolves.description";
-
-  return t(tKey, { livesCount: elderLivesCountAgainstWerewolvesValue.value }, elderLivesCountAgainstWerewolvesValue.value);
-});
+const elderLivesCountAgainstWerewolvesDescription = computed<string>(() => {});
 
 const doesElderTakeHisRevengeDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Elder Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Elder Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:99:18
 const elderLivesCountAgainstWerewolvesDescription = computed<string>(() => {
   const tKey = "components.GameLobbyOptionsHubRolesTabElder.options.livesCountAgainstWerewolves.description";
 
-  return t(tKey, { livesCount: elderLivesCountAgainstWerewolvesValue.value }, elderLivesCountAgainstWerewolvesValue.value);
+  return t(tKey, {}, elderLivesCountAgainstWerewolvesValue.value);
 });
 
killedBy: Game Lobby Options Hub Roles Tab Elder Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Elder Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabElder/GameLobbyOptionsHubRolesTabElder.vue:102:67
   return t(tKey, { livesCount: elderLivesCountAgainstWerewolvesValue.value }, elderLivesCountAgainstWerewolvesValue.value);
 });
 
-const doesElderTakeHisRevengeDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(doesElderTakeHisRevengeValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabElder.options.doesTakeHisRevenge.descriptions.${booleanAsAffirmative}`);
-});
+const doesElderTakeHisRevengeDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Elder Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Elder Component > should match snapshot when rendered. 1` mismatched
