[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabFox/GameLobbyOptionsHubRolesTabFox.vue:41:63
 const { t } = useI18n();
 const { convertBooleanAsAffirmativeString } = useStrings();
 
-const isFoxPowerlessIfMissesWerewolfValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.fox.isPowerlessIfMissesWerewolf,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.fox.isPowerlessIfMissesWerewolf = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const isFoxPowerlessIfMissesWerewolfValue = computed<boolean>({});
 
 const isFoxPowerlessIfMissesWerewolfDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Fox Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabFox/GameLobbyOptionsHubRolesTabFox.vue:42:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isFoxPowerlessIfMissesWerewolfValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.fox.isPowerlessIfMissesWerewolf,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Fox Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Fox Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabFox/GameLobbyOptionsHubRolesTabFox.vue:43:28
 
 const isFoxPowerlessIfMissesWerewolfValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.fox.isPowerlessIfMissesWerewolf,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.fox.isPowerlessIfMissesWerewolf = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Fox Component Fox Powerless if misses Werewolf option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabFox/GameLobbyOptionsHubRolesTabFox.vue:50:74
   },
 });
 
-const isFoxPowerlessIfMissesWerewolfDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isFoxPowerlessIfMissesWerewolfValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabFox.options.isPowerlessIfMissesWerewolf.descriptions.${booleanAsAffirmative}`);
-});
+const isFoxPowerlessIfMissesWerewolfDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Fox Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Fox Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabFox/GameLobbyOptionsHubRolesTabFox.vue:53:12
 const isFoxPowerlessIfMissesWerewolfDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(isFoxPowerlessIfMissesWerewolfValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabFox.options.isPowerlessIfMissesWerewolf.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Roles Tab Fox Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Fox Component > should match snapshot when rendered. 1` mismatched
