[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabGeneral/GameLobbyOptionsHubRolesTabGeneral.vue:63:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const doSkipCallIfNoTargetValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.doSkipCallIfNoTarget,
+  get: () => undefined,
   set: value => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab General Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab General Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabGeneral/GameLobbyOptionsHubRolesTabGeneral.vue:64:17
 
 const doSkipCallIfNoTargetValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.doSkipCallIfNoTarget,
-  set: value => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.doSkipCallIfNoTarget = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: value => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab General Component Do Skip call if no target option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabGeneral/GameLobbyOptionsHubRolesTabGeneral.vue:72:8
 });
 
 const areRevealedOnDeathValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.areRevealedOnDeath,
+  get: () => undefined,
   set: value => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab General Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab General Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabGeneral/GameLobbyOptionsHubRolesTabGeneral.vue:73:17
 
 const areRevealedOnDeathValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.areRevealedOnDeath,
-  set: value => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.areRevealedOnDeath = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: value => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab General Component Are revealed on death option should update create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabGeneral/GameLobbyOptionsHubRolesTabGeneral.vue:80:64
   },
 });
 
-const doSkipCallIfNoTargetDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(doSkipCallIfNoTargetValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabGeneral.options.doSkipCallIfNoTarget.descriptions.${booleanAsAffirmative}`);
-});
+const doSkipCallIfNoTargetDescription = computed<string>(() => {});
 
 const areRevealedOnDeathDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab General Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab General Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabGeneral/GameLobbyOptionsHubRolesTabGeneral.vue:86:62
   return t(`components.GameLobbyOptionsHubRolesTabGeneral.options.doSkipCallIfNoTarget.descriptions.${booleanAsAffirmative}`);
 });
 
-const areRevealedOnDeathDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(areRevealedOnDeathValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabGeneral.options.areRevealedOnDeath.descriptions.${booleanAsAffirmative}`);
-});
+const areRevealedOnDeathDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab General Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab General Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabGeneral/GameLobbyOptionsHubRolesTabGeneral.vue:89:12
 const areRevealedOnDeathDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(areRevealedOnDeathValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabGeneral.options.areRevealedOnDeath.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched
