[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabIdiot/GameLobbyOptionsHubRolesTabIdiot.vue:42:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const doesIdiotDieOnElderDeathValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.idiot.doesDieOnElderDeath,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabIdiot/GameLobbyOptionsHubRolesTabIdiot.vue:43:28
 
 const doesIdiotDieOnElderDeathValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.idiot.doesDieOnElderDeath,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.idiot.doesDieOnElderDeath = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Idiot Component Die on Elder death option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabIdiot/GameLobbyOptionsHubRolesTabIdiot.vue:50:68
   },
 });
 
-const doesIdiotDieOnElderDeathDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(doesIdiotDieOnElderDeathValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabIdiot.options.doesDieOnElderDeath.descriptions.${booleanAsAffirmative}`);
-});
+const doesIdiotDieOnElderDeathDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabIdiot/GameLobbyOptionsHubRolesTabIdiot.vue:53:12
 const doesIdiotDieOnElderDeathDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(doesIdiotDieOnElderDeathValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabIdiot.options.doesDieOnElderDeath.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Roles Tab Idiot Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Idiot Component > should match snapshot when rendered. 1` mismatched
