[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabLittleGirl/GameLobbyOptionsHubRolesTabLittleGirl.vue:41:64
 const { t } = useI18n();
 const { convertBooleanAsAffirmativeString } = useStrings();
 
-const isLittleGirlProtectedByDefenderValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.littleGirl.isProtectedByDefender,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.littleGirl.isProtectedByDefender = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const isLittleGirlProtectedByDefenderValue = computed<boolean>({});
 
 const isLittleGirlProtectedByDefenderDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabLittleGirl/GameLobbyOptionsHubRolesTabLittleGirl.vue:42:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isLittleGirlProtectedByDefenderValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.littleGirl.isProtectedByDefender,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Little Girl Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Little Girl Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabLittleGirl/GameLobbyOptionsHubRolesTabLittleGirl.vue:43:28
 
 const isLittleGirlProtectedByDefenderValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.littleGirl.isProtectedByDefender,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.littleGirl.isProtectedByDefender = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Little Girl Component Is Protected by Defender Option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabLittleGirl/GameLobbyOptionsHubRolesTabLittleGirl.vue:50:75
   },
 });
 
-const isLittleGirlProtectedByDefenderDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isLittleGirlProtectedByDefenderValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabLittleGirl.options.isProtectedByDefender.descriptions.${booleanAsAffirmative}`);
-});
+const isLittleGirlProtectedByDefenderDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched
