[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:77:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const piedPiperCharmedPeopleCountPerNightValue = computed<number>({
-  get: () => createGameDto.value.options.roles.piedPiper.charmedPeopleCountPerNight,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Pied Piper Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:78:34
 
 const piedPiperCharmedPeopleCountPerNightValue = computed<number>({
   get: () => createGameDto.value.options.roles.piedPiper.charmedPeopleCountPerNight,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.piedPiper.charmedPeopleCountPerNight = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component Charmed People count per night option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:79:25
 const piedPiperCharmedPeopleCountPerNightValue = computed<number>({
   get: () => createGameDto.value.options.roles.piedPiper.charmedPeopleCountPerNight,
   set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
+    if (value === null) {}
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
     localCreateGameDto.options.roles.piedPiper.charmedPeopleCountPerNight = value;
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component Charmed People count per night option should not update the create game dto store when the option is changed by the input number and the value is 
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      _CreateGameDto {

[Killed] EqualityOperator
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:79:9
 const piedPiperCharmedPeopleCountPerNightValue = computed<number>({
   get: () => createGameDto.value.options.roles.piedPiper.charmedPeopleCountPerNight,
   set: (value: number | null) => {
-    if (value === null) {
+    if (value !== null) {
       return;
     }
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component Charmed People count per night option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:88:69
   },
 });
 
-const isPiedPiperPowerlessOnWerewolvesSideValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.piedPiper.isPowerlessOnWerewolvesSide,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.piedPiper.isPowerlessOnWerewolvesSide = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const isPiedPiperPowerlessOnWerewolvesSideValue = computed<boolean>({});
 
 const piedPiperCharmedPeopleCountPerNightDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:89:8
 });
 
 const isPiedPiperPowerlessOnWerewolvesSideValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.piedPiper.isPowerlessOnWerewolvesSide,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Pied Piper Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:90:28
 
 const isPiedPiperPowerlessOnWerewolvesSideValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.piedPiper.isPowerlessOnWerewolvesSide,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.piedPiper.isPowerlessOnWerewolvesSide = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component Is powerless on Werewolves Side should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:97:79
   },
 });
 
-const piedPiperCharmedPeopleCountPerNightDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabPiedPiper.options.charmedPeopleCountPerNight.description";
-
-  return t(tKey, { count: piedPiperCharmedPeopleCountPerNightValue.value });
-});
+const piedPiperCharmedPeopleCountPerNightDescription = computed<string>(() => {});
 
 const isPiedPiperPowerlessOnWerewolvesSideDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Pied Piper Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:98:16
 });
 
 const piedPiperCharmedPeopleCountPerNightDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabPiedPiper.options.charmedPeopleCountPerNight.description";
+  const tKey = "";
 
   return t(tKey, { count: piedPiperCharmedPeopleCountPerNightValue.value });
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Pied Piper Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:100:18
 const piedPiperCharmedPeopleCountPerNightDescription = computed<string>(() => {
   const tKey = "components.GameLobbyOptionsHubRolesTabPiedPiper.options.charmedPeopleCountPerNight.description";
 
-  return t(tKey, { count: piedPiperCharmedPeopleCountPerNightValue.value });
+  return t(tKey, {});
 });
 
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Pied Piper Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPiedPiper/GameLobbyOptionsHubRolesTabPiedPiper.vue:103:80
   return t(tKey, { count: piedPiperCharmedPeopleCountPerNightValue.value });
 });
 
-const isPiedPiperPowerlessOnWerewolvesSideDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isPiedPiperPowerlessOnWerewolvesSideValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabPiedPiper.options.isPowerlessOnWerewolvesSide.descriptions.${booleanAsAffirmative}`);
-});
+const isPiedPiperPowerlessOnWerewolvesSideDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Pied Piper Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Pied Piper Component > should match snapshot when rendered. 1` mismatched
