[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPrejudicedManipulator/GameLobbyOptionsHubRolesTabPrejudicedManipulator.vue:43:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isPrejudicedManipulatorPowerlessOnWerewolvesSideValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.prejudicedManipulator.isPowerlessOnWerewolvesSide,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Prejudiced Manipulator Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Prejudiced Manipulator Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPrejudicedManipulator/GameLobbyOptionsHubRolesTabPrejudicedManipulator.vue:44:28
 
 const isPrejudicedManipulatorPowerlessOnWerewolvesSideValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.prejudicedManipulator.isPowerlessOnWerewolvesSide,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.prejudicedManipulator.isPowerlessOnWerewolvesSide = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Prejudiced Manipulator Component Is powerless on Werewolves Side option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabPrejudicedManipulator/GameLobbyOptionsHubRolesTabPrejudicedManipulator.vue:51:92
   },
 });
 
-const isPrejudicedManipulatorPowerlessOnWerewolvesSideDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isPrejudicedManipulatorPowerlessOnWerewolvesSideValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabPrejudicedManipulator.options.isPowerlessOnWerewolvesSide.descriptions.${booleanAsAffirmative}`);
-});
+const isPrejudicedManipulatorPowerlessOnWerewolvesSideDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Prejudiced Manipulator Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Prejudiced Manipulator Component > should match snapshot when rendered. 1` mismatched
