[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabScandalmonger/GameLobbyOptionsHubRolesTabScandalmonger.vue:59:8
 const { t } = useI18n();
 
 const scandalmongerMarkPenaltyValue = computed<number>({
-  get: () => createGameDto.value.options.roles.scandalmonger.markPenalty,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab Scandalmonger Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Scandalmonger Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabScandalmonger/GameLobbyOptionsHubRolesTabScandalmonger.vue:60:34
 
 const scandalmongerMarkPenaltyValue = computed<number>({
   get: () => createGameDto.value.options.roles.scandalmonger.markPenalty,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.scandalmonger.markPenalty = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Scandalmonger Component Mark Penalty option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabScandalmonger/GameLobbyOptionsHubRolesTabScandalmonger.vue:70:68
   },
 });
 
-const scandalmongerMarkPenaltyDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabScandalmonger.options.markPenalty.description";
-
-  return t(tKey, { markPenalty: scandalmongerMarkPenaltyValue.value }, scandalmongerMarkPenaltyValue.value);
-});
+const scandalmongerMarkPenaltyDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Scandalmonger Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Scandalmonger Component > should match snapshot when rendered. 1` mismatched
