[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSeer/GameLobbyOptionsHubRolesTabSeer.vue:56:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isSeerTalkativeValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.seer.isTalkative,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSeer/GameLobbyOptionsHubRolesTabSeer.vue:57:28
 
 const isSeerTalkativeValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.seer.isTalkative,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.seer.isTalkative = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Seer Component Is talkative option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSeer/GameLobbyOptionsHubRolesTabSeer.vue:65:8
 });
 
 const canSeerSeeRolesValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.seer.canSeeRoles,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSeer/GameLobbyOptionsHubRolesTabSeer.vue:66:28
 
 const canSeerSeeRolesValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.seer.canSeeRoles,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.seer.canSeeRoles = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Seer Component Can see Roles option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSeer/GameLobbyOptionsHubRolesTabSeer.vue:73:59
   },
 });
 
-const isSeerTalkativeDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isSeerTalkativeValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabSeer.options.isTalkative.descriptions.${booleanAsAffirmative}`);
-});
+const isSeerTalkativeDescription = computed<string>(() => {});
 
 const canSeerSeeRolesDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSeer/GameLobbyOptionsHubRolesTabSeer.vue:79:59
   return t(`components.GameLobbyOptionsHubRolesTabSeer.options.isTalkative.descriptions.${booleanAsAffirmative}`);
 });
 
-const canSeerSeeRolesDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(canSeerSeeRolesValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabSeer.options.canSeeRoles.descriptions.${booleanAsAffirmative}`);
-});
+const canSeerSeeRolesDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched
