[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:87:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isSheriffEnabledValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.sheriff.isEnabled,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:88:28
 
 const isSheriffEnabledValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.sheriff.isEnabled,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.isEnabled = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component Is enabled option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:96:8
 });
 
 const mustSheriffSettleVotesValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.sheriff.mustSettleTieInVotes,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:97:28
 
 const mustSheriffSettleVotesValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.sheriff.mustSettleTieInVotes,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.mustSettleTieInVotes = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component Must settle Votes options should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:105:8
 });
 
 const doesSheriffHaveDoubledVoteValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.sheriff.hasDoubledVote,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:106:28
 
 const doesSheriffHaveDoubledVoteValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.sheriff.hasDoubledVote,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.hasDoubledVote = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component Has Doubled Vote option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:113:60
   },
 });
 
-const isSheriffEnabledDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isSheriffEnabledValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabSheriff.options.isEnabled.descriptions.${booleanAsAffirmative}`);
-});
+const isSheriffEnabledDescription = computed<string>(() => {});
 
 const mustSheriffSettleVotesDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:119:66
   return t(`components.GameLobbyOptionsHubRolesTabSheriff.options.isEnabled.descriptions.${booleanAsAffirmative}`);
 });
 
-const mustSheriffSettleVotesDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(mustSheriffSettleVotesValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabSheriff.options.mustSettleTieInVotes.descriptions.${booleanAsAffirmative}`);
-});
+const mustSheriffSettleVotesDescription = computed<string>(() => {});
 
 const doesSheriffHaveDoubledVoteDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:122:12
 const mustSheriffSettleVotesDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(mustSheriffSettleVotesValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabSheriff.options.mustSettleTieInVotes.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriff.vue:125:70
   return t(`components.GameLobbyOptionsHubRolesTabSheriff.options.mustSettleTieInVotes.descriptions.${booleanAsAffirmative}`);
 });
 
-const doesSheriffHaveDoubledVoteDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(doesSheriffHaveDoubledVoteValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabSheriff.options.hasDoubledVote.descriptions.${booleanAsAffirmative}`);
-});
+const doesSheriffHaveDoubledVoteDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Sheriff Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Component > should match snapshot when rendered. 1` mismatched
