[Killed] ObjectLiteral
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:58:51
 
 const { t } = useI18n();
 
-const sheriffElectionTurnValue = computed<number>({
-  get: () => createGameDto.value.options.roles.sheriff.electedAt.turn,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.electedAt.turn = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const sheriffElectionTurnValue = computed<number>({});
 
 const sheriffPhaseNameElectionValueAsBoolean = computed<boolean>({
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:59:8
 const { t } = useI18n();
 
 const sheriffElectionTurnValue = computed<number>({
-  get: () => createGameDto.value.options.roles.sheriff.electedAt.turn,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Election Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:60:34
 
 const sheriffElectionTurnValue = computed<number>({
   get: () => createGameDto.value.options.roles.sheriff.electedAt.turn,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.electedAt.turn = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component Election time option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ObjectLiteral
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:70:66
   },
 });
 
-const sheriffPhaseNameElectionValueAsBoolean = computed<boolean>({
-  get: () => createGameDto.value.options.roles.sheriff.electedAt.phaseName === "day",
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.electedAt.phaseName = value ? "day" : "night";
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const sheriffPhaseNameElectionValueAsBoolean = computed<boolean>({});
 
 const sheriffElectionTurnDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ConditionalExpression
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:71:14
 });
 
 const sheriffPhaseNameElectionValueAsBoolean = computed<boolean>({
-  get: () => createGameDto.value.options.roles.sheriff.electedAt.phaseName === "day",
+  get: () => true,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Election Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:71:14
 });
 
 const sheriffPhaseNameElectionValueAsBoolean = computed<boolean>({
-  get: () => createGameDto.value.options.roles.sheriff.electedAt.phaseName === "day",
+  get: () => createGameDto.value.options.roles.sheriff.electedAt.phaseName !== "day",
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Election Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:72:28
 
 const sheriffPhaseNameElectionValueAsBoolean = computed<boolean>({
   get: () => createGameDto.value.options.roles.sheriff.electedAt.phaseName === "day",
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.electedAt.phaseName = value ? "day" : "night";
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component Election time option should update the create game dto store when the option is toggled on day phase change.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] StringLiteral
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:74:84
   get: () => createGameDto.value.options.roles.sheriff.electedAt.phaseName === "day",
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.sheriff.electedAt.phaseName = value ? "day" : "night";
+    localCreateGameDto.options.roles.sheriff.electedAt.phaseName = value ? "day" : "";
     setCreateGameDto(localCreateGameDto);
   },
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component Election time option should update the create game dto store when the option is toggled on night phase change.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  _CreateGameDto {
    "additionalCards": undefined,
    "options": _GameOptions {
      "composition": _CompositionGameOptions {
        "isHidden": false,

[Killed] BlockStatement
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:79:63
   },
 });
 
-const sheriffElectionTurnDescription = computed<string>(() => {
-  const phaseLabel = t(`shared.game.definitePhase.${createGameDto.value.options.roles.sheriff.electedAt.phaseName}`);
-
-  return t("components.GameLobbyOptionsHubRolesTabSheriffElection.options.electedAt.description", {
-    turn: sheriffElectionTurnValue.value,
-    phase: phaseLabel.toLowerCase(),
-  });
-});
+const sheriffElectionTurnDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Election Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:80:24
 });
 
 const sheriffElectionTurnDescription = computed<string>(() => {
-  const phaseLabel = t(`shared.game.definitePhase.${createGameDto.value.options.roles.sheriff.electedAt.phaseName}`);
+  const phaseLabel = t(``);
 
   return t("components.GameLobbyOptionsHubRolesTabSheriffElection.options.electedAt.description", {
killedBy: Game Lobby Options Hub Roles Tab Sheriff Election Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Sheriff Election Component > should match snapshot when rendered. 1` mismatched

[Killed] MethodExpression
GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabSheriff/GameLobbyOptionsHubRolesTabSheriffElection/GameLobbyOptionsHubRolesTabSheriffElection.vue:84:12
 
   return t("components.GameLobbyOptionsHubRolesTabSheriffElection.options.electedAt.description", {
     turn: sheriffElectionTurnValue.value,
-    phase: phaseLabel.toLowerCase(),
+    phase: phaseLabel.toUpperCase(),
   });
 });
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched
