[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabStutteringJudge/GameLobbyOptionsHubRolesTabStutteringJudge.vue:59:8
 const { t } = useI18n();
 
 const stutteringJudgeVoteRequestsCountValue = computed<number>({
-  get: () => createGameDto.value.options.roles.stutteringJudge.voteRequestsCount,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab Stuttering Judge Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Stuttering Judge Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabStutteringJudge/GameLobbyOptionsHubRolesTabStutteringJudge.vue:60:34
 
 const stutteringJudgeVoteRequestsCountValue = computed<number>({
   get: () => createGameDto.value.options.roles.stutteringJudge.voteRequestsCount,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.stutteringJudge.voteRequestsCount = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Stuttering Judge Component Vote Requests Count option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabStutteringJudge/GameLobbyOptionsHubRolesTabStutteringJudge.vue:70:76
   },
 });
 
-const stutteringJudgeVoteRequestsCountDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabStutteringJudge.options.voteRequestsCount.description";
-
-  return t(tKey, { count: stutteringJudgeVoteRequestsCountValue.value });
-});
+const stutteringJudgeVoteRequestsCountDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Stuttering Judge Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Stuttering Judge Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabStutteringJudge/GameLobbyOptionsHubRolesTabStutteringJudge.vue:71:16
 });
 
 const stutteringJudgeVoteRequestsCountDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabStutteringJudge.options.voteRequestsCount.description";
+  const tKey = "";
 
   return t(tKey, { count: stutteringJudgeVoteRequestsCountValue.value });
killedBy: Game Lobby Options Hub Roles Tab Stuttering Judge Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Stuttering Judge Component > should match snapshot when rendered. 1` mismatched
