[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThief/GameLobbyOptionsHubRolesTabThief.vue:57:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const mustThiefChooseBetweenWerewolvesValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.thief.mustChooseBetweenWerewolves,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Thief Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Thief Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThief/GameLobbyOptionsHubRolesTabThief.vue:58:28
 
 const mustThiefChooseBetweenWerewolvesValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.thief.mustChooseBetweenWerewolves,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.thief.mustChooseBetweenWerewolves = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Thief Component Must choose between Werewolves option should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThief/GameLobbyOptionsHubRolesTabThief.vue:66:8
 });
 
 const isThiefChosenCardRevealedValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.thief.isChosenCardRevealed,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Thief Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Thief Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThief/GameLobbyOptionsHubRolesTabThief.vue:67:28
 
 const isThiefChosenCardRevealedValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.thief.isChosenCardRevealed,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.thief.isChosenCardRevealed = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Thief Component Is Chosen Card revealed should update the create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThief/GameLobbyOptionsHubRolesTabThief.vue:74:76
   },
 });
 
-const mustThiefChooseBetweenWerewolvesDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(mustThiefChooseBetweenWerewolvesValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabThief.options.mustChooseBetweenWerewolves.descriptions.${booleanAsAffirmative}`);
-});
+const mustThiefChooseBetweenWerewolvesDescription = computed<string>(() => {});
 
 const isThiefChosenCardRevealedDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Thief Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Thief Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThief/GameLobbyOptionsHubRolesTabThief.vue:80:69
   return t(`components.GameLobbyOptionsHubRolesTabThief.options.mustChooseBetweenWerewolves.descriptions.${booleanAsAffirmative}`);
 });
 
-const isThiefChosenCardRevealedDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isThiefChosenCardRevealedValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabThief.options.isChosenCardRevealed.descriptions.${booleanAsAffirmative}`);
-});
+const isThiefChosenCardRevealedDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Thief Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Thief Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThief/GameLobbyOptionsHubRolesTabThief.vue:83:12
 const isThiefChosenCardRevealedDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(isThiefChosenCardRevealedValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabThief.options.isChosenCardRevealed.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Roles Tab Thief Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Thief Component > should match snapshot when rendered. 1` mismatched
