[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThreeBrothers/GameLobbyOptionsHubRolesTabThreeBrothers.vue:59:8
 const { t } = useI18n();
 
 const threeBrothersWakingUpIntervalValue = computed<number>({
-  get: () => createGameDto.value.options.roles.threeBrothers.wakingUpInterval,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab Three Brothers Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Three Brothers Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThreeBrothers/GameLobbyOptionsHubRolesTabThreeBrothers.vue:60:34
 
 const threeBrothersWakingUpIntervalValue = computed<number>({
   get: () => createGameDto.value.options.roles.threeBrothers.wakingUpInterval,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.threeBrothers.wakingUpInterval = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Three Brothers Component Waking up Interval option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThreeBrothers/GameLobbyOptionsHubRolesTabThreeBrothers.vue:70:73
   },
 });
 
-const threeBrothersWakingUpIntervalDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabThreeBrothers.options.wakingUpInterval.description";
-
-  return t(tKey, { interval: threeBrothersWakingUpIntervalValue.value }, threeBrothersWakingUpIntervalValue.value);
-});
+const threeBrothersWakingUpIntervalDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Three Brothers Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Three Brothers Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThreeBrothers/GameLobbyOptionsHubRolesTabThreeBrothers.vue:71:16
 });
 
 const threeBrothersWakingUpIntervalDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabThreeBrothers.options.wakingUpInterval.description";
+  const tKey = "";
 
   return t(tKey, { interval: threeBrothersWakingUpIntervalValue.value }, threeBrothersWakingUpIntervalValue.value);
killedBy: Game Lobby Options Hub Roles Tab Three Brothers Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Three Brothers Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabThreeBrothers/GameLobbyOptionsHubRolesTabThreeBrothers.vue:73:18
 const threeBrothersWakingUpIntervalDescription = computed<string>(() => {
   const tKey = "components.GameLobbyOptionsHubRolesTabThreeBrothers.options.wakingUpInterval.description";
 
-  return t(tKey, { interval: threeBrothersWakingUpIntervalValue.value }, threeBrothersWakingUpIntervalValue.value);
+  return t(tKey, {}, threeBrothersWakingUpIntervalValue.value);
 });
 </script>
killedBy: Game Lobby Options Hub Roles Tab Three Brothers Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Three Brothers Component > should match snapshot when rendered. 1` mismatched
