[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabTwoSisters/GameLobbyOptionsHubRolesTabTwoSisters.vue:59:8
 const { t } = useI18n();
 
 const twoSistersWakingUpIntervalValue = computed<number>({
-  get: () => createGameDto.value.options.roles.twoSisters.wakingUpInterval,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab Two Sisters Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Two Sisters Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabTwoSisters/GameLobbyOptionsHubRolesTabTwoSisters.vue:60:34
 
 const twoSistersWakingUpIntervalValue = computed<number>({
   get: () => createGameDto.value.options.roles.twoSisters.wakingUpInterval,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.twoSisters.wakingUpInterval = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Two Sisters Component Waking up Interval option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabTwoSisters/GameLobbyOptionsHubRolesTabTwoSisters.vue:70:70
   },
 });
 
-const twoSistersWakingUpIntervalDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabTwoSisters.options.wakingUpInterval.description";
-
-  return t(tKey, { interval: twoSistersWakingUpIntervalValue.value }, twoSistersWakingUpIntervalValue.value);
-});
+const twoSistersWakingUpIntervalDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Two Sisters Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Two Sisters Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabTwoSisters/GameLobbyOptionsHubRolesTabTwoSisters.vue:71:16
 });
 
 const twoSistersWakingUpIntervalDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabTwoSisters.options.wakingUpInterval.description";
+  const tKey = "";
 
   return t(tKey, { interval: twoSistersWakingUpIntervalValue.value }, twoSistersWakingUpIntervalValue.value);
killedBy: Game Lobby Options Hub Roles Tab Two Sisters Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Two Sisters Component > should match snapshot when rendered. 1` mismatched
