[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWhiteWerewolf/GameLobbyOptionsHubRolesTabWhiteWerewolf.vue:59:8
 const { t } = useI18n();
 
 const whiteWerewolfWakingUpIntervalValue = computed<number>({
-  get: () => createGameDto.value.options.roles.whiteWerewolf.wakingUpInterval,
+  get: () => undefined,
   set: (value: number | null) => {
     if (value === null) {
killedBy: Game Lobby Options Hub Roles Tab White Werewolf Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab White Werewolf Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWhiteWerewolf/GameLobbyOptionsHubRolesTabWhiteWerewolf.vue:60:34
 
 const whiteWerewolfWakingUpIntervalValue = computed<number>({
   get: () => createGameDto.value.options.roles.whiteWerewolf.wakingUpInterval,
-  set: (value: number | null) => {
-    if (value === null) {
-      return;
-    }
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.whiteWerewolf.wakingUpInterval = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: number | null) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab White Werewolf Component Waking up Interval option should update the create game dto store when the option is changed by the input number.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWhiteWerewolf/GameLobbyOptionsHubRolesTabWhiteWerewolf.vue:70:73
   },
 });
 
-const whiteWerewolfWakingUpIntervalDescription = computed<string>(() => {
-  const tKey = "components.GameLobbyOptionsHubRolesTabWhiteWerewolf.options.wakingUpInterval.description";
-
-  return t(tKey, { interval: whiteWerewolfWakingUpIntervalValue.value }, whiteWerewolfWakingUpIntervalValue.value);
-});
+const whiteWerewolfWakingUpIntervalDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab White Werewolf Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab White Werewolf Component > should match snapshot when rendered. 1` mismatched
