[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWildChild/GameLobbyOptionsHubRolesTabWildChild.vue:41:66
 const { t } = useI18n();
 const { convertBooleanAsAffirmativeString } = useStrings();
 
-const isWildChildTransformationRevealedValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.wildChild.isTransformationRevealed,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.wildChild.isTransformationRevealed = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const isWildChildTransformationRevealedValue = computed<boolean>({});
 
 const isWildChildTransformationRevealedDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Wild Child Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWildChild/GameLobbyOptionsHubRolesTabWildChild.vue:42:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isWildChildTransformationRevealedValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.wildChild.isTransformationRevealed,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Wild Child Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Wild Child Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWildChild/GameLobbyOptionsHubRolesTabWildChild.vue:43:28
 
 const isWildChildTransformationRevealedValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.wildChild.isTransformationRevealed,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.wildChild.isTransformationRevealed = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Wild Child Component Is Transformation revealed option should update the create game dto store when the option is changed by the affirmative toggle button.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWildChild/GameLobbyOptionsHubRolesTabWildChild.vue:50:77
   },
 });
 
-const isWildChildTransformationRevealedDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isWildChildTransformationRevealedValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabWildChild.options.isTransformationRevealed.descriptions.${booleanAsAffirmative}`);
-});
+const isWildChildTransformationRevealedDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Wild Child Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Wild Child Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWildChild/GameLobbyOptionsHubRolesTabWildChild.vue:53:12
 const isWildChildTransformationRevealedDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(isWildChildTransformationRevealedValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabWildChild.options.isTransformationRevealed.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Roles Tab Wild Child Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Wild Child Component > should match snapshot when rendered. 1` mismatched
