[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWitch/GameLobbyOptionsHubRolesTabWitch.vue:42:63
 
 const { convertBooleanAsAffirmativeString } = useStrings();
 
-const doesWitchKnowWerewolvesTargetsValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.witch.doesKnowWerewolvesTargets,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.witch.doesKnowWerewolvesTargets = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const doesWitchKnowWerewolvesTargetsValue = computed<boolean>({});
 
 const doesWitchKnowWerewolvesTargetsDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Witch Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWitch/GameLobbyOptionsHubRolesTabWitch.vue:43:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const doesWitchKnowWerewolvesTargetsValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.witch.doesKnowWerewolvesTargets,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Witch Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Witch Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWitch/GameLobbyOptionsHubRolesTabWitch.vue:44:28
 
 const doesWitchKnowWerewolvesTargetsValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.witch.doesKnowWerewolvesTargets,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.witch.doesKnowWerewolvesTargets = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Witch Component Does know Werewolves targets option should update the create game dto store when the option is changed by the affirmative toggle button.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWitch/GameLobbyOptionsHubRolesTabWitch.vue:51:74
   },
 });
 
-const doesWitchKnowWerewolvesTargetsDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(doesWitchKnowWerewolvesTargetsValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabWitch.options.doesKnowWerewolvesTargets.descriptions.${booleanAsAffirmative}`);
-});
+const doesWitchKnowWerewolvesTargetsDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Witch Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Witch Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWitch/GameLobbyOptionsHubRolesTabWitch.vue:54:12
 const doesWitchKnowWerewolvesTargetsDescription = computed<string>(() => {
   const booleanAsAffirmative = convertBooleanAsAffirmativeString(doesWitchKnowWerewolvesTargetsValue.value);
 
-  return t(`components.GameLobbyOptionsHubRolesTabWitch.options.doesKnowWerewolvesTargets.descriptions.${booleanAsAffirmative}`);
+  return t(``);
 });
 </script>
killedBy: Game Lobby Options Hub Roles Tab Witch Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Witch Component > should match snapshot when rendered. 1` mismatched
