[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:56:62
 
 const { convertBooleanAsAffirmativeString } = useStrings();
 
-const isWolfHoundChosenSideRevealedValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.wolfHound.isChosenSideRevealed,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.wolfHound.isChosenSideRevealed = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const isWolfHoundChosenSideRevealedValue = computed<boolean>({});
 
 const isWolfHoundSideRandomlyChosenValue = computed<boolean>({
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:57:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const isWolfHoundChosenSideRevealedValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.wolfHound.isChosenSideRevealed,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Wolf Hound Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:58:28
 
 const isWolfHoundChosenSideRevealedValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.wolfHound.isChosenSideRevealed,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.wolfHound.isChosenSideRevealed = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component Is Chosen Side Revealed option should update the create game dto store when the option is changed by the affirmative toggle button.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ObjectLiteral
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:65:62
   },
 });
 
-const isWolfHoundSideRandomlyChosenValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.wolfHound.isSideRandomlyChosen,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.wolfHound.isSideRandomlyChosen = value;
-    setCreateGameDto(localCreateGameDto);
-  },
-});
+const isWolfHoundSideRandomlyChosenValue = computed<boolean>({});
 
 const isWolfHoundChosenSideRevealedDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ArrowFunction
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:66:8
 });
 
 const isWolfHoundSideRandomlyChosenValue = computed<boolean>({
-  get: () => createGameDto.value.options.roles.wolfHound.isSideRandomlyChosen,
+  get: () => undefined,
   set: (value: boolean) => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Wolf Hound Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:67:28
 
 const isWolfHoundSideRandomlyChosenValue = computed<boolean>({
   get: () => createGameDto.value.options.roles.wolfHound.isSideRandomlyChosen,
-  set: (value: boolean) => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.roles.wolfHound.isSideRandomlyChosen = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: (value: boolean) => {},
 });
 
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component Is Side randomly chosen option should update the create game dto store when the option is changed by the affirmative toggle button.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:74:73
   },
 });
 
-const isWolfHoundChosenSideRevealedDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isWolfHoundChosenSideRevealedValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabWolfHound.options.isChosenSideRevealed.descriptions.${booleanAsAffirmative}`);
-});
+const isWolfHoundChosenSideRevealedDescription = computed<string>(() => {});
 
 const isWolfHoundSideRandomlyChosenDescription = computed<string>(() => {
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Wolf Hound Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHubTabView/GameLobbyOptionsHubRolesTab/GameLobbyOptionsHubRolesTabWolfHound/GameLobbyOptionsHubRolesTabWolfHound.vue:80:73
   return t(`components.GameLobbyOptionsHubRolesTabWolfHound.options.isChosenSideRevealed.descriptions.${booleanAsAffirmative}`);
 });
 
-const isWolfHoundSideRandomlyChosenDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(isWolfHoundSideRandomlyChosenValue.value);
-
-  return t(`components.GameLobbyOptionsHubRolesTabWolfHound.options.isSideRandomlyChosen.descriptions.${booleanAsAffirmative}`);
-});
+const isWolfHoundSideRandomlyChosenDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Roles Tab Wolf Hound Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Roles Tab Wolf Hound Component > should match snapshot when rendered. 1` mismatched
