[Killed] ArrowFunction
GameLobbyOptionsHub/GameLobbyOptionsHubTabView/GameLobbyOptionsHubVotesTab/GameLobbyOptionsHubVotesTab.vue:35:8
 const { convertBooleanAsAffirmativeString } = useStrings();
 
 const canVotesBeSkippedValue = computed<boolean>({
-  get: () => createGameDto.value.options.votes.canBeSkipped,
+  get: () => undefined,
   set: value => {
     const localCreateGameDto = CreateGameDto.create(createGameDto.value);
killedBy: Game Lobby Options Hub Votes Tab Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Votes Tab Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyOptionsHub/GameLobbyOptionsHubTabView/GameLobbyOptionsHubVotesTab/GameLobbyOptionsHubVotesTab.vue:36:17
 
 const canVotesBeSkippedValue = computed<boolean>({
   get: () => createGameDto.value.options.votes.canBeSkipped,
-  set: value => {
-    const localCreateGameDto = CreateGameDto.create(createGameDto.value);
-    localCreateGameDto.options.votes.canBeSkipped = value;
-    setCreateGameDto(localCreateGameDto);
-  },
+  set: value => {},
 });
 
killedBy: Game Lobby Options Hub Votes Tab Component Can Votes be Skipped option should update create game dto store when the option is toggled.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyOptionsHub/GameLobbyOptionsHubTabView/GameLobbyOptionsHubVotesTab/GameLobbyOptionsHubVotesTab.vue:43:61
   },
 });
 
-const canVotesBeSkippedDescription = computed<string>(() => {
-  const booleanAsAffirmative = convertBooleanAsAffirmativeString(canVotesBeSkippedValue.value);
-
-  return t(`components.GameLobbyOptionsHubVotesTab.options.canBeSkipped.descriptions.${booleanAsAffirmative}`);
-});
+const canVotesBeSkippedDescription = computed<string>(() => {});
 </script>
killedBy: Game Lobby Options Hub Votes Tab Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Votes Tab Component > should match snapshot when rendered. 1` mismatched
