[Killed] BlockStatement
game-lobby/GameLobbyPlayersParty/GameLobbyPlayerCard/GameLobbyPlayerCard.vue:47:51
 
 const createGameDtoStore = useCreateGameDtoStore();
 
-const playerCardRoleText = computed<string>(() => {
-  if (props.player.role.name === undefined) {
-    return t("components.GameLobbyPlayerCard.roleNotSelected");
-  }
-  return getRoleNameLabel(props.player.role.name);
-});
+const playerCardRoleText = computed<string>(() => {});
 
 function removePlayerFromCreateGameDto(): void {
killedBy: Game Lobby Player Card Component Role should translate role not selected when player doesn't have role yet.
statusReason: expected '' to be 'components.GameLobbyPlayerCard.roleNo…' // Object.is equality

[Killed] BlockStatement
game-lobby/GameLobbyPlayersParty/GameLobbyPlayerCard/GameLobbyPlayerCard.vue:48:45
 const createGameDtoStore = useCreateGameDtoStore();
 
 const playerCardRoleText = computed<string>(() => {
-  if (props.player.role.name === undefined) {
-    return t("components.GameLobbyPlayerCard.roleNotSelected");
-  }
+  if (props.player.role.name === undefined) {}
   return getRoleNameLabel(props.player.role.name);
 });
killedBy: Game Lobby Player Card Component Role should translate role not selected when player doesn't have role yet.
statusReason: expected '' to be 'components.GameLobbyPlayerCard.roleNo…' // Object.is equality

[Killed] EqualityOperator
game-lobby/GameLobbyPlayersParty/GameLobbyPlayerCard/GameLobbyPlayerCard.vue:48:7
 const createGameDtoStore = useCreateGameDtoStore();
 
 const playerCardRoleText = computed<string>(() => {
-  if (props.player.role.name === undefined) {
+  if (props.player.role.name !== undefined) {
     return t("components.GameLobbyPlayerCard.roleNotSelected");
   }
killedBy: Game Lobby Player Card Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Player Card Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
game-lobby/GameLobbyPlayersParty/GameLobbyPlayerCard/GameLobbyPlayerCard.vue:49:14
 
 const playerCardRoleText = computed<string>(() => {
   if (props.player.role.name === undefined) {
-    return t("components.GameLobbyPlayerCard.roleNotSelected");
+    return t("");
   }
   return getRoleNameLabel(props.player.role.name);
killedBy: Game Lobby Player Card Component Role should translate role not selected when player doesn't have role yet.
statusReason: expected '' to be 'components.GameLobbyPlayerCard.roleNo…' // Object.is equality

[Killed] BlockStatement
game-lobby/GameLobbyPlayersParty/GameLobbyPlayerCard/GameLobbyPlayerCard.vue:54:48
   return getRoleNameLabel(props.player.role.name);
 });
 
-function removePlayerFromCreateGameDto(): void {
-  createGameDtoStore.removePlayerFromCreateGameDto(props.player.name);
-}
+function removePlayerFromCreateGameDto(): void {}
 
 function pickRoleForPlayer(): void {
killedBy: Game Lobby Player Card Component Delete button should remove player from party when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
game-lobby/GameLobbyPlayersParty/GameLobbyPlayerCard/GameLobbyPlayerCard.vue:58:36
   createGameDtoStore.removePlayerFromCreateGameDto(props.player.name);
 }
 
-function pickRoleForPlayer(): void {
-  emit("pickRoleForPlayer", props.player);
-}
+function pickRoleForPlayer(): void {}
 </script>
 
killedBy: Game Lobby Player Card Component Emits should emit pickRoleForPlayer event when player card is selected.
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
game-lobby/GameLobbyPlayersParty/GameLobbyPlayerCard/GameLobbyPlayerCard.vue:59:8
 }
 
 function pickRoleForPlayer(): void {
-  emit("pickRoleForPlayer", props.player);
+  emit("", props.player);
 }
 </script>
killedBy: Game Lobby Player Card Component Emits should emit pickRoleForPlayer event when player card is selected.
statusReason: Target cannot be null or undefined.
