[Killed] BlockStatement
pages/game-lobby/GameLobbyPlayersParty/GameLobbyPlayersParty.vue:48:64
 
 const { createGameDto } = storeToRefs(createGameDtoStore);
 
-function pickRoleForPlayer(player?: CreateGamePlayerDto): void {
-  if (!player) {
-    return;
-  }
-  emit("pickRoleForPlayer", player);
-}
+function pickRoleForPlayer(player?: CreateGamePlayerDto): void {}
 </script>
killedBy: Game Lobby Players Party Component Emits should emit pickRoleForPlayer event when game lobby player card emits pick role for player event.
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
pages/game-lobby/GameLobbyPlayersParty/GameLobbyPlayersParty.vue:49:16
 const { createGameDto } = storeToRefs(createGameDtoStore);
 
 function pickRoleForPlayer(player?: CreateGamePlayerDto): void {
-  if (!player) {
-    return;
-  }
+  if (!player) {}
   emit("pickRoleForPlayer", player);
 }
killedBy: Game Lobby Players Party Component Emits should not emit pickRoleForPlayer event when game lobby player card emits pick role for player event with undefined player.
statusReason: expected [ [ undefined ] ] to be undefined

[Killed] ConditionalExpression
pages/game-lobby/GameLobbyPlayersParty/GameLobbyPlayersParty.vue:49:7
 const { createGameDto } = storeToRefs(createGameDtoStore);
 
 function pickRoleForPlayer(player?: CreateGamePlayerDto): void {
-  if (!player) {
+  if (false) {
     return;
   }
killedBy: Game Lobby Players Party Component Emits should not emit pickRoleForPlayer event when game lobby player card emits pick role for player event with undefined player.
statusReason: expected [ [ undefined ] ] to be undefined

[Killed] StringLiteral
pages/game-lobby/GameLobbyPlayersParty/GameLobbyPlayersParty.vue:52:8
   if (!player) {
     return;
   }
-  emit("pickRoleForPlayer", player);
+  emit("", player);
 }
 </script>
killedBy: Game Lobby Players Party Component Emits should emit pickRoleForPlayer event when game lobby player card emits pick role for player event.
statusReason: Target cannot be null or undefined.
