[Killed] BlockStatement
pages/game-lobby/GameLobbyRolePicker/GameLobbyRolePicker.vue:69:69
 const localPlayer = ref<CreateGamePlayerDto>();
 const pickedRole = ref<Role>();
 
-function openToPickRoleForPlayer(player: CreateGamePlayerDto): void {
-  localPlayer.value = CreateGamePlayerDto.create(player);
-  pickedRole.value = undefined;
-  isVisible.value = true;
-}
+function openToPickRoleForPlayer(player: CreateGamePlayerDto): void {}
 
 function pickRole(role: Role): void {
killedBy: Game Lobby Role Picker Component Dialog open should set dialog to visible when freshly opened.
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] BooleanLiteral
pages/game-lobby/GameLobbyRolePicker/GameLobbyRolePicker.vue:72:21
 function openToPickRoleForPlayer(player: CreateGamePlayerDto): void {
   localPlayer.value = CreateGamePlayerDto.create(player);
   pickedRole.value = undefined;
-  isVisible.value = true;
+  isVisible.value = false;
 }
 
killedBy: Game Lobby Role Picker Component Dialog open should set dialog to visible when freshly opened.
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] BlockStatement
pages/game-lobby/GameLobbyRolePicker/GameLobbyRolePicker.vue:75:37
   isVisible.value = true;
 }
 
-function pickRole(role: Role): void {
-  pickedRole.value = role;
-}
+function pickRole(role: Role): void {}
 
 function close(): void {
killedBy: Game Lobby Role Picker Component Dialog open Game Lobby Role Picker Content should pick role when game lobby role picker grid emits role pick event.
statusReason: expected undefined to strictly equal _Role{ name: 'elder', …(7) }
