[Killed] ArrowFunction
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerDescription/GameLobbyRolePickerDescription.vue:44:7
 const gameLobbyRolePickerDescription = ref<HTMLElement | null>(null);
 const { y: yScroll } = useScroll(gameLobbyRolePickerDescription, { behavior: "smooth" });
 
-watch(() => props.pickedRole, () => {
+watch(() => undefined, () => {
   yScroll.value = 0;
 });
killedBy: Game Lobby Role Picker Description Component Main Content should scroll back to top when picked role is changed.
statusReason: expected 20 to be +0 // Object.is equality

[Killed] BlockStatement
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerDescription/GameLobbyRolePickerDescription.vue:44:37
 const gameLobbyRolePickerDescription = ref<HTMLElement | null>(null);
 const { y: yScroll } = useScroll(gameLobbyRolePickerDescription, { behavior: "smooth" });
 
-watch(() => props.pickedRole, () => {
-  yScroll.value = 0;
-});
+watch(() => props.pickedRole, () => {});
 </script>
killedBy: Game Lobby Role Picker Description Component Main Content should scroll back to top when picked role is changed.
statusReason: expected 20 to be +0 // Object.is equality
