[Killed] ArrowFunction
GameLobbyRolePickerDescription/GameLobbyRolePickerDescriptionContent/GameLobbyRolePickerDescriptionBoundaries/GameLobbyRolePickerDescriptionBoundaries.vue:66:51
 
 const { t } = useI18n();
 
-const roleCountInCreateGameDto = computed<number>(() => getPlayersWithRoleNameInCreateGameDto(props.pickedRole.name).length);
+const roleCountInCreateGameDto = computed<number>(() => undefined);
 
 const isRoleMinInGameReached = computed<boolean>(() => isRoleMinReachedInCreateGameDto(props.pickedRole.name));
killedBy: Game Lobby Role Picker Description Boundaries Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Description Boundaries Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
GameLobbyRolePickerDescription/GameLobbyRolePickerDescriptionContent/GameLobbyRolePickerDescriptionBoundaries/GameLobbyRolePickerDescriptionBoundaries.vue:68:50
 
 const roleCountInCreateGameDto = computed<number>(() => getPlayersWithRoleNameInCreateGameDto(props.pickedRole.name).length);
 
-const isRoleMinInGameReached = computed<boolean>(() => isRoleMinReachedInCreateGameDto(props.pickedRole.name));
+const isRoleMinInGameReached = computed<boolean>(() => undefined);
 
 const roleLeftCountToReachMinInCreateGameDto = computed<number>(() => getRoleLeftCountToReachMinInCreateGameDto(props.pickedRole.name));
killedBy: Game Lobby Role Picker Description Boundaries Component Min in game not reached should not render min in game not reached when min is reached in create game dto.
statusReason: expected true to be falsy

[Killed] ArrowFunction
GameLobbyRolePickerDescription/GameLobbyRolePickerDescriptionContent/GameLobbyRolePickerDescriptionBoundaries/GameLobbyRolePickerDescriptionBoundaries.vue:70:65
 
 const isRoleMinInGameReached = computed<boolean>(() => isRoleMinReachedInCreateGameDto(props.pickedRole.name));
 
-const roleLeftCountToReachMinInCreateGameDto = computed<number>(() => getRoleLeftCountToReachMinInCreateGameDto(props.pickedRole.name));
+const roleLeftCountToReachMinInCreateGameDto = computed<number>(() => undefined);
 
 const isRoleMaxInGameReached = computed<boolean>(() => isRoleMaxReachedInCreateGameDto(props.pickedRole.name));
killedBy: Game Lobby Role Picker Description Boundaries Component Min in game not reached should render min in game not reached when min is not reached in create game dto and there is at least one role already.
statusReason: expected 'components.GameLobbyRolePickerDescrip…' to be 'components.GameLobbyRolePickerDescrip…' // Object.is equality

[Killed] ArrowFunction
GameLobbyRolePickerDescription/GameLobbyRolePickerDescriptionContent/GameLobbyRolePickerDescriptionBoundaries/GameLobbyRolePickerDescriptionBoundaries.vue:72:50
 
 const roleLeftCountToReachMinInCreateGameDto = computed<number>(() => getRoleLeftCountToReachMinInCreateGameDto(props.pickedRole.name));
 
-const isRoleMaxInGameReached = computed<boolean>(() => isRoleMaxReachedInCreateGameDto(props.pickedRole.name));
+const isRoleMaxInGameReached = computed<boolean>(() => undefined);
 </script>
killedBy: Game Lobby Role Picker Description Boundaries Component Role max reached should render role max reached when max is reached in create game dto.
statusReason: Cannot call text on an empty DOMWrapper.
