[Killed] ArrowFunction
GameLobbyRolePicker/GameLobbyRolePickerDescription/GameLobbyRolePickerDescriptionContent/GameLobbyRolePickerDescriptionContent.vue:57:27
 
 const { getRoleNameLabel } = useRoleName();
 
-const roleName = computed(() => getRoleNameLabel(props.pickedRole.name));
+const roleName = computed(() => undefined);
 </script>
killedBy: Game Lobby Role Picker Description Content Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Description Content Component > should match snapshot when rendered. 1` mismatched
