[Killed] ConditionalExpression
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:34:53
   getPlayersWithRoleNameInCreateGameDto,
 } = createGameDtoStore;
 
-const isPlayerRoleChanged = computed<boolean>(() => props.player?.role.name !== props.pickedRole?.name);
+const isPlayerRoleChanged = computed<boolean>(() => false);
 
 const canRoleBePicked = computed<boolean>(() => !!props.player && !!props.pickedRole && isPlayerRoleChanged.value);
killedBy: Game Lobby Role Picker Footer Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Footer Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:34:47
   getPlayersWithRoleNameInCreateGameDto,
 } = createGameDtoStore;
 
-const isPlayerRoleChanged = computed<boolean>(() => props.player?.role.name !== props.pickedRole?.name);
+const isPlayerRoleChanged = computed<boolean>(() => undefined);
 
 const canRoleBePicked = computed<boolean>(() => !!props.player && !!props.pickedRole && isPlayerRoleChanged.value);
killedBy: Game Lobby Role Picker Footer Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Footer Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:36:49
 
 const isPlayerRoleChanged = computed<boolean>(() => props.player?.role.name !== props.pickedRole?.name);
 
-const canRoleBePicked = computed<boolean>(() => !!props.player && !!props.pickedRole && isPlayerRoleChanged.value);
+const canRoleBePicked = computed<boolean>(() => true);
 
 function swapRoleWithFirstPlayerWithRole(pickedRole: Role, sourcePlayer: CreateGamePlayerDto): void {
killedBy: Game Lobby Role Picker Footer Component Button should be disabled when player is not defined.
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] ConditionalExpression
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:36:49
 
 const isPlayerRoleChanged = computed<boolean>(() => props.player?.role.name !== props.pickedRole?.name);
 
-const canRoleBePicked = computed<boolean>(() => !!props.player && !!props.pickedRole && isPlayerRoleChanged.value);
+const canRoleBePicked = computed<boolean>(() => true && isPlayerRoleChanged.value);
 
 function swapRoleWithFirstPlayerWithRole(pickedRole: Role, sourcePlayer: CreateGamePlayerDto): void {
killedBy: Game Lobby Role Picker Footer Component Button should be disabled when player is not defined.
statusReason: expected 'false' to be 'true' // Object.is equality

[Killed] BlockStatement
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:38:101
 
 const canRoleBePicked = computed<boolean>(() => !!props.player && !!props.pickedRole && isPlayerRoleChanged.value);
 
-function swapRoleWithFirstPlayerWithRole(pickedRole: Role, sourcePlayer: CreateGamePlayerDto): void {
-  const players = getPlayersWithRoleNameInCreateGameDto(pickedRole.name);
-  if (players.length === 0) {
-    return;
-  }
-  const firstPlayer = players[0];
-  const updatedPlayer = CreateGamePlayerDto.create({
-    ...firstPlayer,
-    role: { name: sourcePlayer.role.name },
-    side: {
-      original: sourcePlayer.side.original,
-      current: sourcePlayer.side.current,
-    },
-  });
-  updatePlayerInCreateGameDto(updatedPlayer);
-}
+function swapRoleWithFirstPlayerWithRole(pickedRole: Role, sourcePlayer: CreateGamePlayerDto): void {}
 
 function pickRoleForPlayer(): void {
killedBy: Game Lobby Role Picker Footer Component Button On click should swap player role and side when clicked and max is reached for this role.
statusReason: expected 1st "spy" call to have been called with [ _CreateGamePlayerDto{ …(4) } ]

[Killed] EqualityOperator
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:40:7
 
 function swapRoleWithFirstPlayerWithRole(pickedRole: Role, sourcePlayer: CreateGamePlayerDto): void {
   const players = getPlayersWithRoleNameInCreateGameDto(pickedRole.name);
-  if (players.length === 0) {
+  if (players.length !== 0) {
     return;
   }
killedBy: Game Lobby Role Picker Footer Component Button On click should swap player role and side when clicked and max is reached for this role.
statusReason: expected 1st "spy" call to have been called with [ _CreateGamePlayerDto{ …(4) } ]

[Killed] ConditionalExpression
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:40:7
 
 function swapRoleWithFirstPlayerWithRole(pickedRole: Role, sourcePlayer: CreateGamePlayerDto): void {
   const players = getPlayersWithRoleNameInCreateGameDto(pickedRole.name);
-  if (players.length === 0) {
+  if (true) {
     return;
   }
killedBy: Game Lobby Role Picker Footer Component Button On click should swap player role and side when clicked and max is reached for this role.
statusReason: expected 1st "spy" call to have been called with [ _CreateGamePlayerDto{ …(4) } ]

[Killed] BlockStatement
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:55:36
   updatePlayerInCreateGameDto(updatedPlayer);
 }
 
-function pickRoleForPlayer(): void {
-  if (!props.pickedRole || !props.player) {
-    return;
-  }
-  if (isRoleMaxReachedInCreateGameDto(props.pickedRole.name)) {
-    swapRoleWithFirstPlayerWithRole(props.pickedRole, props.player);
-  }
-  const updatedPlayer = CreateGamePlayerDto.create({
-    ...props.player,
-    role: { name: props.pickedRole.name },
-    side: {
-      original: props.pickedRole.side,
-      current: props.pickedRole.side,
-    },
-  });
-  updatePlayerInCreateGameDto(updatedPlayer);
-  emit("playerUpdate", updatedPlayer);
-}
+function pickRoleForPlayer(): void {}
 </script>
killedBy: Game Lobby Role Picker Footer Component Button On click should update player in create game dto when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BooleanLiteral
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:56:28
 }
 
 function pickRoleForPlayer(): void {
-  if (!props.pickedRole || !props.player) {
+  if (!props.pickedRole || props.player) {
     return;
   }
killedBy: Game Lobby Role Picker Footer Component Button On click should update player in create game dto when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:56:7
 }
 
 function pickRoleForPlayer(): void {
-  if (!props.pickedRole || !props.player) {
+  if (false) {
     return;
   }
killedBy: Game Lobby Role Picker Footer Component Button On click should not emit player update with updated player event when picked role is not defined.
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] BlockStatement
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:59:63
   if (!props.pickedRole || !props.player) {
     return;
   }
-  if (isRoleMaxReachedInCreateGameDto(props.pickedRole.name)) {
-    swapRoleWithFirstPlayerWithRole(props.pickedRole, props.player);
-  }
+  if (isRoleMaxReachedInCreateGameDto(props.pickedRole.name)) {}
   const updatedPlayer = CreateGamePlayerDto.create({
     ...props.player,
killedBy: Game Lobby Role Picker Footer Component Button On click should swap player role and side when clicked and max is reached for this role.
statusReason: expected 1st "spy" call to have been called with [ _CreateGamePlayerDto{ …(4) } ]

[Killed] ConditionalExpression
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerFooter/GameLobbyRolePickerFooter.vue:59:7
   if (!props.pickedRole || !props.player) {
     return;
   }
-  if (isRoleMaxReachedInCreateGameDto(props.pickedRole.name)) {
+  if (true) {
     swapRoleWithFirstPlayerWithRole(props.pickedRole, props.player);
   }
killedBy: Game Lobby Role Picker Footer Component Button On click should update player in create game dto when clicked.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 2 times
