[Killed] BlockStatement
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGrid.vue:39:37
 
 const { roles } = storeToRefs(rolesStore);
 
-function pickRole(role: Role): void {
-  emit("pickRole", role);
-}
+function pickRole(role: Role): void {}
 </script>
killedBy: Game Lobby Role Picker Grid Component Emits should emit pickRole event when role element emits a pick role event.
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGrid.vue:40:8
 const { roles } = storeToRefs(rolesStore);
 
 function pickRole(role: Role): void {
-  emit("pickRole", role);
+  emit("", role);
 }
 </script>
killedBy: Game Lobby Role Picker Grid Component Emits should emit pickRole event when role element emits a pick role event.
statusReason: Target cannot be null or undefined.
