[Killed] BlockStatement
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:68:42
 
 const { getRoleNameLabel } = useRoleName();
 
-const roleLabel = computed<string>(() => {
-  if (!props.role) {
-    return t("components.GameLobbyRolePickerGridElement.random");
-  }
-  return getRoleNameLabel(props.role.name);
-});
+const roleLabel = computed<string>(() => {});
 
 const isPicked = computed<boolean>(() => !!props.role && props.role.name === props.pickedRole?.name);
killedBy: Game Lobby Role Picker Grid Element Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Grid Element Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:69:7
 const { getRoleNameLabel } = useRoleName();
 
 const roleLabel = computed<string>(() => {
-  if (!props.role) {
+  if (false) {
     return t("components.GameLobbyRolePickerGridElement.random");
   }
killedBy: Game Lobby Role Picker Grid Element Component Button should not have bright border when role is not defined.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:69:20
 const { getRoleNameLabel } = useRoleName();
 
 const roleLabel = computed<string>(() => {
-  if (!props.role) {
-    return t("components.GameLobbyRolePickerGridElement.random");
-  }
+  if (!props.role) {}
   return getRoleNameLabel(props.role.name);
 });
killedBy: Game Lobby Role Picker Grid Element Component Button should not have bright border when role is not defined.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:75:58
   return getRoleNameLabel(props.role.name);
 });
 
-const isPicked = computed<boolean>(() => !!props.role && props.role.name === props.pickedRole?.name);
+const isPicked = computed<boolean>(() => !!props.role && true);
 
 function pickRole(): void {
killedBy: Game Lobby Role Picker Grid Element Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Grid Element Component > should match snapshot when rendered. 1` mismatched

[Killed] LogicalOperator
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:75:42
   return getRoleNameLabel(props.role.name);
 });
 
-const isPicked = computed<boolean>(() => !!props.role && props.role.name === props.pickedRole?.name);
+const isPicked = computed<boolean>(() => !!props.role || props.role.name === props.pickedRole?.name);
 
 function pickRole(): void {
killedBy: Game Lobby Role Picker Grid Element Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Grid Element Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:77:27
 
 const isPicked = computed<boolean>(() => !!props.role && props.role.name === props.pickedRole?.name);
 
-function pickRole(): void {
-  if (!roles.value) {
-    return;
-  }
-
-  if (!props.role) {
-    const rolesWithoutPickedRole = roles.value.filter(({ name }) => !props.pickedRole || name !== props.pickedRole.name);
-    const randomRole = draw(rolesWithoutPickedRole) as Role;
-    emit("pickRole", randomRole);
-
-    return;
-  }
-
-  emit("pickRole", props.role);
-}
+function pickRole(): void {}
 </script>
 
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit pickRole event when clicked on button.
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:78:7
 const isPicked = computed<boolean>(() => !!props.role && props.role.name === props.pickedRole?.name);
 
 function pickRole(): void {
-  if (!roles.value) {
+  if (false) {
     return;
   }
killedBy: Game Lobby Role Picker Grid Element Component Emits should not emit role pick event when roles are not defined in store.
statusReason: expected [ [ _Role{ name: 'seer', …(7) } ] ] to be undefined

[Killed] ConditionalExpression
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:78:7
 const isPicked = computed<boolean>(() => !!props.role && props.role.name === props.pickedRole?.name);
 
 function pickRole(): void {
-  if (!roles.value) {
+  if (true) {
     return;
   }
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit pickRole event when clicked on button.
statusReason: Target cannot be null or undefined.

[Killed] ConditionalExpression
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:82:7
     return;
   }
 
-  if (!props.role) {
+  if (false) {
     const rolesWithoutPickedRole = roles.value.filter(({ name }) => !props.pickedRole || name !== props.pickedRole.name);
     const randomRole = draw(rolesWithoutPickedRole) as Role;
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit random role when role is not defined and no role is picked yet.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:82:20
     return;
   }
 
-  if (!props.role) {
-    const rolesWithoutPickedRole = roles.value.filter(({ name }) => !props.pickedRole || name !== props.pickedRole.name);
-    const randomRole = draw(rolesWithoutPickedRole) as Role;
-    emit("pickRole", randomRole);
-
-    return;
-  }
+  if (!props.role) {}
 
   emit("pickRole", props.role);
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit random role when role is not defined and no role is picked yet.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] EqualityOperator
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:83:90
   }
 
   if (!props.role) {
-    const rolesWithoutPickedRole = roles.value.filter(({ name }) => !props.pickedRole || name !== props.pickedRole.name);
+    const rolesWithoutPickedRole = roles.value.filter(({ name }) => !props.pickedRole || name === props.pickedRole.name);
     const randomRole = draw(rolesWithoutPickedRole) as Role;
     emit("pickRole", randomRole);
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit random role which can't be the same as the picked role when role is not defined but picked role is defined.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Array [
    _Role {
      "additionalCardsEligibleRecipients": undefined,
      "maxInGame": 8,
      "minInGame": undefined,

[Killed] ConditionalExpression
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:83:69
   }
 
   if (!props.role) {
-    const rolesWithoutPickedRole = roles.value.filter(({ name }) => !props.pickedRole || name !== props.pickedRole.name);
+    const rolesWithoutPickedRole = roles.value.filter(({ name }) => true);
     const randomRole = draw(rolesWithoutPickedRole) as Role;
     emit("pickRole", randomRole);
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit random role which can't be the same as the picked role when role is not defined but picked role is defined.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Array [
    _Role {
      "additionalCardsEligibleRecipients": undefined,
      "maxInGame": 2,
      "minInGame": undefined,

[Killed] StringLiteral
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:85:10
   if (!props.role) {
     const rolesWithoutPickedRole = roles.value.filter(({ name }) => !props.pickedRole || name !== props.pickedRole.name);
     const randomRole = draw(rolesWithoutPickedRole) as Role;
-    emit("pickRole", randomRole);
+    emit("", randomRole);
 
     return;
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit random role when role is not defined and no role is picked yet.
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
GameLobbyRolePicker/GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElement.vue:90:8
     return;
   }
 
-  emit("pickRole", props.role);
+  emit("", props.role);
 }
 </script>
killedBy: Game Lobby Role Picker Grid Element Component Emits should emit pickRole event when clicked on button.
statusReason: Target cannot be null or undefined.
