[Killed] BlockStatement
GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElementBadges/GameLobbyRolePickerGridElementBadges.vue:44:53
   getRoleLeftCountToReachMinInCreateGameDto,
 } = createGameDtoStore;
 
-const countInCreateGameDto = computed<number>(() => {
-  if (!props.role) {
-    return 0;
-  }
-  return getPlayersWithRoleNameInCreateGameDto(props.role.name).length;
-});
+const countInCreateGameDto = computed<number>(() => {});
 
 const leftCountToReachMinInCreateGameDto = computed<number>(() => {
killedBy: Game Lobby Role Picker Grid Element Badges Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Grid Element Badges Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElementBadges/GameLobbyRolePickerGridElementBadges.vue:45:7
 } = createGameDtoStore;
 
 const countInCreateGameDto = computed<number>(() => {
-  if (!props.role) {
+  if (true) {
     return 0;
   }
killedBy: Game Lobby Role Picker Grid Element Badges Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Grid Element Badges Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElementBadges/GameLobbyRolePickerGridElementBadges.vue:45:20
 } = createGameDtoStore;
 
 const countInCreateGameDto = computed<number>(() => {
-  if (!props.role) {
-    return 0;
-  }
+  if (!props.role) {}
   return getPlayersWithRoleNameInCreateGameDto(props.role.name).length;
 });
killedBy: Game Lobby Role Picker Grid Element Badges Component Count in Party Badge should not render the count in party badge when role is not defined.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElementBadges/GameLobbyRolePickerGridElementBadges.vue:51:67
   return getPlayersWithRoleNameInCreateGameDto(props.role.name).length;
 });
 
-const leftCountToReachMinInCreateGameDto = computed<number>(() => {
-  if (!props.role) {
-    return 0;
-  }
-  return getRoleLeftCountToReachMinInCreateGameDto(props.role.name);
-});
+const leftCountToReachMinInCreateGameDto = computed<number>(() => {});
 </script>
killedBy: Game Lobby Role Picker Grid Element Badges Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Grid Element Badges Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElementBadges/GameLobbyRolePickerGridElementBadges.vue:52:7
 });
 
 const leftCountToReachMinInCreateGameDto = computed<number>(() => {
-  if (!props.role) {
+  if (true) {
     return 0;
   }
killedBy: Game Lobby Role Picker Grid Element Badges Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Grid Element Badges Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
GameLobbyRolePickerGrid/GameLobbyRolePickerGridElement/GameLobbyRolePickerGridElementBadges/GameLobbyRolePickerGridElementBadges.vue:52:7
 });
 
 const leftCountToReachMinInCreateGameDto = computed<number>(() => {
-  if (!props.role) {
+  if (false) {
     return 0;
   }
killedBy: Game Lobby Role Picker Grid Element Badges Component Count in Party Badge should not render the count in party badge when role is not defined.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
