[Killed] OptionalChaining
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerHeader/GameLobbyRolePickerHeader.vue:64:112
 
 const { t } = useI18n();
 
-const title = computed<string>(() => t("components.GameLobbyRolePickerHeader.pickRoleForPlayer", { playerName: props.player?.name }));
+const title = computed<string>(() => t("components.GameLobbyRolePickerHeader.pickRoleForPlayer", { playerName: props.player.name }));
 
 const currentRoleText = computed<string>(() => {
killedBy: Game Lobby Role Picker Header Component Current Role should translate no role text when player is not defined.
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ArrowFunction
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerHeader/GameLobbyRolePickerHeader.vue:64:32
 
 const { t } = useI18n();
 
-const title = computed<string>(() => t("components.GameLobbyRolePickerHeader.pickRoleForPlayer", { playerName: props.player?.name }));
+const title = computed<string>(() => undefined);
 
 const currentRoleText = computed<string>(() => {
killedBy: Game Lobby Role Picker Header Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Header Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerHeader/GameLobbyRolePickerHeader.vue:66:48
 
 const title = computed<string>(() => t("components.GameLobbyRolePickerHeader.pickRoleForPlayer", { playerName: props.player?.name }));
 
-const currentRoleText = computed<string>(() => {
-  if (!props.player?.role.name) {
-    return t("components.GameLobbyRolePickerHeader.noRole");
-  }
-  return getRoleNameLabel(props.player.role.name);
-});
+const currentRoleText = computed<string>(() => {});
 </script>
killedBy: Game Lobby Role Picker Header Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Header Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerHeader/GameLobbyRolePickerHeader.vue:67:7
 const title = computed<string>(() => t("components.GameLobbyRolePickerHeader.pickRoleForPlayer", { playerName: props.player?.name }));
 
 const currentRoleText = computed<string>(() => {
-  if (!props.player?.role.name) {
+  if (props.player?.role.name) {
     return t("components.GameLobbyRolePickerHeader.noRole");
   }
killedBy: Game Lobby Role Picker Header Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Header Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerHeader/GameLobbyRolePickerHeader.vue:67:7
 const title = computed<string>(() => t("components.GameLobbyRolePickerHeader.pickRoleForPlayer", { playerName: props.player?.name }));
 
 const currentRoleText = computed<string>(() => {
-  if (!props.player?.role.name) {
+  if (true) {
     return t("components.GameLobbyRolePickerHeader.noRole");
   }
killedBy: Game Lobby Role Picker Header Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Role Picker Header Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
game-lobby/GameLobbyRolePicker/GameLobbyRolePickerHeader/GameLobbyRolePickerHeader.vue:68:14
 
 const currentRoleText = computed<string>(() => {
   if (!props.player?.role.name) {
-    return t("components.GameLobbyRolePickerHeader.noRole");
+    return t("");
   }
   return getRoleNameLabel(props.player.role.name);
killedBy: Game Lobby Role Picker Header Component Current Role should translate no role text when player is not defined.
statusReason: expected '' to be 'components.GameLobbyRolePickerHeader.…' // Object.is equality
