[Killed] BlockStatement
shared/dialogs/DialogFooterCloseButtonOnly/DialogFooterCloseButtonOnly.vue:25:24
 
 const emit = defineEmits<DialogFooterCloseButtonOnlyEmits>();
 
-function close(): void {
-  emit("closeDialog");
-}
+function close(): void {}
 </script>
killedBy: Dialog Footer Close Button Only Component Close Button should emit close event when close button is clicked.
statusReason: expected undefined to be truthy

[Killed] StringLiteral
shared/dialogs/DialogFooterCloseButtonOnly/DialogFooterCloseButtonOnly.vue:26:8
 const emit = defineEmits<DialogFooterCloseButtonOnlyEmits>();
 
 function close(): void {
-  emit("closeDialog");
+  emit("");
 }
 </script>
killedBy: Dialog Footer Close Button Only Component Close Button should emit close event when close button is clicked.
statusReason: expected undefined to be truthy
