[Killed] StringLiteral
shared/external/BuyMeACoffeeButton/BuyMeACoffeeButton.vue:20:9
 
 const baseUri = "https://img.buymeacoffee.com/button-api";
 const urlQueryParams = objectToSnake({
-  text: "Buy me a coffee",
+  text: "",
   slug: "antoinezanardi",
   buttonColour: "46a6ff",
killedBy: Buy Me A Coffee Button Component should match snapshot when rendered.
statusReason: Snapshot `Buy Me A Coffee Button Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/external/BuyMeACoffeeButton/BuyMeACoffeeButton.vue:21:9
 const baseUri = "https://img.buymeacoffee.com/button-api";
 const urlQueryParams = objectToSnake({
   text: "Buy me a coffee",
-  slug: "antoinezanardi",
+  slug: "",
   buttonColour: "46a6ff",
   fontColour: "FFFFFF",
killedBy: Buy Me A Coffee Button Component should match snapshot when rendered.
statusReason: Snapshot `Buy Me A Coffee Button Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/external/BuyMeACoffeeButton/BuyMeACoffeeButton.vue:26:17
   fontColour: "FFFFFF",
   fontFamily: "Lato",
   outlineColour: "000000",
-  coffeeColour: "FFDD00",
+  coffeeColour: "",
 });
 const src = `${baseUri}/?${stringify(urlQueryParams)}`;
killedBy: Buy Me A Coffee Button Component should match snapshot when rendered.
statusReason: Snapshot `Buy Me A Coffee Button Component > should match snapshot when rendered. 1` mismatched
