[Killed] BlockStatement
shared/external/GitHubRepositoryButton/GitHubRepositoryButton.vue:24:43
 
 const { t } = useI18n();
 
-const textButton = computed<string>(() => {
-  if (props.textButton !== undefined) {
-    return props.textButton;
-  }
-  return t("components.GitHubRepositoryButton.thisProjectIsOpenSource");
-});
+const textButton = computed<string>(() => {});
 </script>
killedBy: App Component should render component without shallow and match snapshot when rendered.
statusReason: Snapshot `App Component > should render component without shallow and match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
shared/external/GitHubRepositoryButton/GitHubRepositoryButton.vue:25:7
 const { t } = useI18n();
 
 const textButton = computed<string>(() => {
-  if (props.textButton !== undefined) {
+  if (true) {
     return props.textButton;
   }
killedBy: App Component should render component without shallow and match snapshot when rendered.
statusReason: Snapshot `App Component > should render component without shallow and match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
shared/external/GitHubRepositoryButton/GitHubRepositoryButton.vue:25:7
 const { t } = useI18n();
 
 const textButton = computed<string>(() => {
-  if (props.textButton !== undefined) {
+  if (false) {
     return props.textButton;
   }
killedBy: GitHub Repository Button should match snapshot when rendered.
statusReason: Snapshot `GitHub Repository Button > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/external/GitHubRepositoryButton/GitHubRepositoryButton.vue:28:12
   if (props.textButton !== undefined) {
     return props.textButton;
   }
-  return t("components.GitHubRepositoryButton.thisProjectIsOpenSource");
+  return t("");
 });
 </script>
killedBy: App Component should render component without shallow and match snapshot when rendered.
statusReason: Snapshot `App Component > should render component without shallow and match snapshot when rendered. 1` mismatched
