[Killed] ArrowFunction
game/game-options/GameOptionRoleLegend/GameOptionRoleLegend.vue:26:32
 
 const { t } = useI18n();
 
-const title = computed<string>(() => t(`shared.role.name.${props.roleName}`));
+const title = computed<string>(() => undefined);
 </script>
killedBy: Game Lobby Options Hub Tab View Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Options Hub Tab View Component > should match snapshot when rendered. 1` mismatched
