[Killed] BlockStatement
game/game-phase/GamePhaseIcon/GamePhaseIcon.vue:14:42
 
 const props = defineProps<GamePhaseIconProps>();
 
-const phaseIcon = computed<string>(() => {
-  const phasesIcon: Record<GamePhaseName, string> = {
-    night: "fa fa-moon text-night",
-    day: "fa fa-sun text-day",
-  };
-
-  return phasesIcon[props.phase];
-});
+const phaseIcon = computed<string>(() => {});
 </script>
killedBy: Game Phase Icon Component should match snapshot when rendered.
statusReason: Snapshot `Game Phase Icon Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
game/game-phase/GamePhaseIcon/GamePhaseIcon.vue:15:53
 const props = defineProps<GamePhaseIconProps>();
 
 const phaseIcon = computed<string>(() => {
-  const phasesIcon: Record<GamePhaseName, string> = {
-    night: "fa fa-moon text-night",
-    day: "fa fa-sun text-day",
-  };
+  const phasesIcon: Record<GamePhaseName, string> = {};
 
   return phasesIcon[props.phase];
killedBy: Game Phase Icon Component should match snapshot when rendered.
statusReason: Snapshot `Game Phase Icon Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
game/game-phase/GamePhaseIcon/GamePhaseIcon.vue:16:12
 
 const phaseIcon = computed<string>(() => {
   const phasesIcon: Record<GamePhaseName, string> = {
-    night: "fa fa-moon text-night",
+    night: "",
     day: "fa fa-sun text-day",
   };
killedBy: Game Phase Icon Component Icon classes should display the night icon when the phase is night.
statusReason: expect(received).toContainValues(expected)

Expected object to contain all values:
  Array [
  "fa-moon",
  "text-night",
]
Received:

[Killed] StringLiteral
game/game-phase/GamePhaseIcon/GamePhaseIcon.vue:17:10
 const phaseIcon = computed<string>(() => {
   const phasesIcon: Record<GamePhaseName, string> = {
     night: "fa fa-moon text-night",
-    day: "fa fa-sun text-day",
+    day: "",
   };
 
killedBy: Game Phase Icon Component should match snapshot when rendered.
statusReason: Snapshot `Game Phase Icon Component > should match snapshot when rendered. 1` mismatched
