[Killed] ArrowFunction
game/player/PlayerCard/PlayerCard.vue:38:53
 
 const { t } = useI18n();
 
-const tooltipContent = computed<string | undefined>(() => (props.doesShowSelectorTooltip ? props.selectorAriaLabel : undefined));
+const tooltipContent = computed<string | undefined>(() => undefined);
 
 function getPlayerCardRoleImageAlt(): string {
killedBy: Player Card Component Selector Button should have tooltip with aria label as value when doesShowSelectorTooltip prop is true.
statusReason: expected undefined to be 'Select Player' // Object.is equality

[Killed] BlockStatement
game/player/PlayerCard/PlayerCard.vue:40:46
 
 const tooltipContent = computed<string | undefined>(() => (props.doesShowSelectorTooltip ? props.selectorAriaLabel : undefined));
 
-function getPlayerCardRoleImageAlt(): string {
-  return t("components.PlayerCard.playerCardRoleImageAlt", { playerName: props.playerName });
-}
+function getPlayerCardRoleImageAlt(): string {}
 
 function emitPlayerCardSelectorClickEvent(): void {
killedBy: Game Lobby Player Card Component should match snapshot when rendered without shallow.
statusReason: Snapshot `Game Lobby Player Card Component > should match snapshot when rendered without shallow. 1` mismatched

[Killed] StringLiteral
game/player/PlayerCard/PlayerCard.vue:41:12
 const tooltipContent = computed<string | undefined>(() => (props.doesShowSelectorTooltip ? props.selectorAriaLabel : undefined));
 
 function getPlayerCardRoleImageAlt(): string {
-  return t("components.PlayerCard.playerCardRoleImageAlt", { playerName: props.playerName });
+  return t("", { playerName: props.playerName });
 }
 
killedBy: Game Lobby Player Card Component should match snapshot when rendered without shallow.
statusReason: Snapshot `Game Lobby Player Card Component > should match snapshot when rendered without shallow. 1` mismatched

[Killed] BlockStatement
game/player/PlayerCard/PlayerCard.vue:44:51
   return t("components.PlayerCard.playerCardRoleImageAlt", { playerName: props.playerName });
 }
 
-function emitPlayerCardSelectorClickEvent(): void {
-  emit("playerCardSelectorClick");
-}
+function emitPlayerCardSelectorClickEvent(): void {}
 </script>
 
killedBy: Player Card Component Selector Button should emit playerCardSelectorClick event when clicked.
statusReason: Target cannot be null or undefined.

[Killed] StringLiteral
game/player/PlayerCard/PlayerCard.vue:45:8
 }
 
 function emitPlayerCardSelectorClickEvent(): void {
-  emit("playerCardSelectorClick");
+  emit("");
 }
 </script>
killedBy: Player Card Component Selector Button should emit playerCardSelectorClick event when clicked.
statusReason: Target cannot be null or undefined.
