[Killed] ConditionalExpression
shared/misc/OverflowTag/OverflowTag.vue:18:54
 
 const props = defineProps<OverflowTagProps>();
 
-const areEntitiesTruncated = computed<boolean>(() => props.entitiesCount > props.maximumEntitiesDisplayed);
+const areEntitiesTruncated = computed<boolean>(() => true);
 
 const truncatedEntitiesCount = computed<number>(() => props.entitiesCount - props.maximumEntitiesDisplayed);
killedBy: Overflow Tag Component Overflow Tag should not display the overflow number when the entities count is less than or equal to the maximum entities displayed.
statusReason: expected true to be falsy

[Killed] ArrowFunction
shared/misc/OverflowTag/OverflowTag.vue:18:48
 
 const props = defineProps<OverflowTagProps>();
 
-const areEntitiesTruncated = computed<boolean>(() => props.entitiesCount > props.maximumEntitiesDisplayed);
+const areEntitiesTruncated = computed<boolean>(() => undefined);
 
 const truncatedEntitiesCount = computed<number>(() => props.entitiesCount - props.maximumEntitiesDisplayed);
killedBy: Overflow Tag Component should match snapshot when rendered.
statusReason: Snapshot `Overflow Tag Component > should match snapshot when rendered. 1` mismatched

[Killed] ArithmeticOperator
shared/misc/OverflowTag/OverflowTag.vue:20:55
 
 const areEntitiesTruncated = computed<boolean>(() => props.entitiesCount > props.maximumEntitiesDisplayed);
 
-const truncatedEntitiesCount = computed<number>(() => props.entitiesCount - props.maximumEntitiesDisplayed);
+const truncatedEntitiesCount = computed<number>(() => props.entitiesCount + props.maximumEntitiesDisplayed);
 
 const truncatedEntitiesCountText = computed<string>(() => `+ ${truncatedEntitiesCount.value}`);
killedBy: Overflow Tag Component should match snapshot when rendered.
statusReason: Snapshot `Overflow Tag Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
shared/misc/OverflowTag/OverflowTag.vue:20:49
 
 const areEntitiesTruncated = computed<boolean>(() => props.entitiesCount > props.maximumEntitiesDisplayed);
 
-const truncatedEntitiesCount = computed<number>(() => props.entitiesCount - props.maximumEntitiesDisplayed);
+const truncatedEntitiesCount = computed<number>(() => undefined);
 
 const truncatedEntitiesCountText = computed<string>(() => `+ ${truncatedEntitiesCount.value}`);
killedBy: Overflow Tag Component should match snapshot when rendered.
statusReason: Snapshot `Overflow Tag Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrowFunction
shared/misc/OverflowTag/OverflowTag.vue:22:53
 
 const truncatedEntitiesCount = computed<number>(() => props.entitiesCount - props.maximumEntitiesDisplayed);
 
-const truncatedEntitiesCountText = computed<string>(() => `+ ${truncatedEntitiesCount.value}`);
+const truncatedEntitiesCountText = computed<string>(() => undefined);
 </script>
killedBy: Overflow Tag Component should match snapshot when rendered.
statusReason: Snapshot `Overflow Tag Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/misc/OverflowTag/OverflowTag.vue:22:59
 
 const truncatedEntitiesCount = computed<number>(() => props.entitiesCount - props.maximumEntitiesDisplayed);
 
-const truncatedEntitiesCountText = computed<string>(() => `+ ${truncatedEntitiesCount.value}`);
+const truncatedEntitiesCountText = computed<string>(() => ``);
 </script>
killedBy: Overflow Tag Component should match snapshot when rendered.
statusReason: Snapshot `Overflow Tag Component > should match snapshot when rendered. 1` mismatched
