[Killed] BlockStatement
shared/role/RoleDescriptionLines/RoleDescriptionLines.vue:24:55
 
 const { t, messages, locale } = useI18n();
 
-const roleDescriptionLines = computed<string[]>(() => {
-  type SharedMessages = Record<"role", Record<"descriptions", Record<RoleName, Record<string, string>>>>;
-
-  const sharedMessages = messages.value[locale.value].shared as SharedMessages;
-  const roleDescriptionMessages = sharedMessages.role.descriptions[props.role.name] as Record<string, string> | undefined;
-  if (!roleDescriptionMessages) {
-    return [];
-  }
-  return Object.keys(roleDescriptionMessages).map(key => t(`shared.role.descriptions.${props.role.name}.${key}`));
-});
+const roleDescriptionLines = computed<string[]>(() => {});
 </script>
killedBy: Role Description Lines Component should match snapshot when rendered.
statusReason: Snapshot `Role Description Lines Component > should match snapshot when rendered. 1` mismatched

[Killed] BooleanLiteral
shared/role/RoleDescriptionLines/RoleDescriptionLines.vue:29:7
 
   const sharedMessages = messages.value[locale.value].shared as SharedMessages;
   const roleDescriptionMessages = sharedMessages.role.descriptions[props.role.name] as Record<string, string> | undefined;
-  if (!roleDescriptionMessages) {
+  if (roleDescriptionMessages) {
     return [];
   }
killedBy: Role Description Lines Component should match snapshot when rendered.
statusReason: Snapshot `Role Description Lines Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
shared/role/RoleDescriptionLines/RoleDescriptionLines.vue:29:7
 
   const sharedMessages = messages.value[locale.value].shared as SharedMessages;
   const roleDescriptionMessages = sharedMessages.role.descriptions[props.role.name] as Record<string, string> | undefined;
-  if (!roleDescriptionMessages) {
+  if (true) {
     return [];
   }
killedBy: Role Description Lines Component should match snapshot when rendered.
statusReason: Snapshot `Role Description Lines Component > should match snapshot when rendered. 1` mismatched

[Killed] ArrayDeclaration
shared/role/RoleDescriptionLines/RoleDescriptionLines.vue:30:12
   const sharedMessages = messages.value[locale.value].shared as SharedMessages;
   const roleDescriptionMessages = sharedMessages.role.descriptions[props.role.name] as Record<string, string> | undefined;
   if (!roleDescriptionMessages) {
-    return [];
+    return ["Stryker was here"];
   }
   return Object.keys(roleDescriptionMessages).map(key => t(`shared.role.descriptions.${props.role.name}.${key}`));
killedBy: Role Description Lines Component Description Lines should not display role description lines when rendered if role description is not set in messages.
statusReason: expected [ DOMWrapper{ …(2) } ] to have a length of +0 but got 1

[Killed] ArrowFunction
shared/role/RoleDescriptionLines/RoleDescriptionLines.vue:32:51
   if (!roleDescriptionMessages) {
     return [];
   }
-  return Object.keys(roleDescriptionMessages).map(key => t(`shared.role.descriptions.${props.role.name}.${key}`));
+  return Object.keys(roleDescriptionMessages).map(() => undefined);
 });
 </script>
killedBy: Role Description Lines Component should match snapshot when rendered.
statusReason: Snapshot `Role Description Lines Component > should match snapshot when rendered. 1` mismatched
