[Killed] BooleanLiteral
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:43:32
   definition: "normal",
 });
 
-const isFlipped = ref<boolean>(false);
+const isFlipped = ref<boolean>(true);
 const frontRoleName = ref<RoleName | undefined>();
 const backRoleName = ref<RoleName | undefined>();
killedBy: Game Lobby Player Card Component should match snapshot when rendered without shallow.
statusReason: Snapshot `Game Lobby Player Card Component > should match snapshot when rendered without shallow. 1` mismatched

[Killed] BlockStatement
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:47:17
 const frontRoleName = ref<RoleName | undefined>();
 const backRoleName = ref<RoleName | undefined>();
 
-onMounted(() => {
-  frontRoleName.value = props.roleName;
-});
+onMounted(() => {});
 
 watch(() => props.roleName, roleName => {
killedBy: Role Flipping Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Flipping Image Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:51:41
   frontRoleName.value = props.roleName;
 });
 
-watch(() => props.roleName, roleName => {
-  if (isFlipped.value) {
-    frontRoleName.value = roleName;
-    isFlipped.value = false;
-
-    return;
-  }
-  backRoleName.value = roleName;
-  isFlipped.value = true;
-});
+watch(() => props.roleName, roleName => {});
 </script>
killedBy: Role Flipping Image Component Flip Container Front Role Image should set front image role as the new role when the role is updated twice in props.
statusReason: expected 'werewolf' to be 'seer' // Object.is equality

[Killed] ArrowFunction
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:51:7
   frontRoleName.value = props.roleName;
 });
 
-watch(() => props.roleName, roleName => {
+watch(() => undefined, roleName => {
   if (isFlipped.value) {
     frontRoleName.value = roleName;
killedBy: Role Flipping Image Component Flip Container Front Role Image should set front image role as the new role when the role is updated twice in props.
statusReason: expected 'werewolf' to be 'seer' // Object.is equality

[Killed] BlockStatement
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:52:24
 });
 
 watch(() => props.roleName, roleName => {
-  if (isFlipped.value) {
-    frontRoleName.value = roleName;
-    isFlipped.value = false;
-
-    return;
-  }
+  if (isFlipped.value) {}
   backRoleName.value = roleName;
   isFlipped.value = true;
killedBy: Role Flipping Image Component Flip Container Front Role Image should set back flip to false when the role is updated twice in props.
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ConditionalExpression
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:52:7
 });
 
 watch(() => props.roleName, roleName => {
-  if (isFlipped.value) {
+  if (false) {
     frontRoleName.value = roleName;
     isFlipped.value = false;
killedBy: Role Flipping Image Component Flip Container Front Role Image should set back flip to false when the role is updated twice in props.
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BooleanLiteral
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:54:23
 watch(() => props.roleName, roleName => {
   if (isFlipped.value) {
     frontRoleName.value = roleName;
-    isFlipped.value = false;
+    isFlipped.value = true;
 
     return;
killedBy: Role Flipping Image Component Flip Container Front Role Image should set back flip to false when the role is updated twice in props.
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] BooleanLiteral
role/RoleImage/RoleFlippingImage/RoleFlippingImage.vue:59:21
     return;
   }
   backRoleName.value = roleName;
-  isFlipped.value = true;
+  isFlipped.value = false;
 });
 </script>
killedBy: Role Flipping Image Component Flip Container Front Role Image should set front image role as the new role when the role is updated twice in props.
statusReason: expected 'werewolf' to be 'seer' // Object.is equality
