[Killed] StringLiteral
shared/role/RoleImage/RoleImage.vue:26:22
 
 const runtimeConfig = useRuntimeConfig();
 
-const backImageSrc = "/img/role/back.jpeg";
+const backImageSrc = "";
 
 const roleImageSrc = computed<string>(() => {
killedBy: Role Image Component Image Src should have back src when prop role image is undefined.
statusReason: expected '' to be '/img/role/back.jpeg' // Object.is equality

[Killed] BlockStatement
shared/role/RoleImage/RoleImage.vue:28:45
 
 const backImageSrc = "/img/role/back.jpeg";
 
-const roleImageSrc = computed<string>(() => {
-  if (props.roleName === undefined) {
-    return backImageSrc;
-  }
-
-  const apiBaseUrl = removeTrailingSlashes(runtimeConfig.public.werewolvesAssistantApi.baseUrl);
-  const imageSuffix = props.definition === "normal" ? "" : `-${props.definition}`;
-
-  return `${apiBaseUrl}/public/assets/images/roles/${props.roleName}/${props.roleName}${imageSuffix}.jpeg`;
-});
+const roleImageSrc = computed<string>(() => {});
 
 const imageClasses = computed<string>(() => `h-[${props.sizes}px] w-[${props.sizes}px]`);
killedBy: Role Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Image Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
shared/role/RoleImage/RoleImage.vue:29:7
 const backImageSrc = "/img/role/back.jpeg";
 
 const roleImageSrc = computed<string>(() => {
-  if (props.roleName === undefined) {
+  if (props.roleName !== undefined) {
     return backImageSrc;
   }
killedBy: Role Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Image Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
shared/role/RoleImage/RoleImage.vue:29:7
 const backImageSrc = "/img/role/back.jpeg";
 
 const roleImageSrc = computed<string>(() => {
-  if (props.roleName === undefined) {
+  if (false) {
     return backImageSrc;
   }
killedBy: Role Image Component Image Src should have back src when prop role image is undefined.
statusReason: expected 'http://127.0.0.1/public/assets/images…' to be '/img/role/back.jpeg' // Object.is equality

[Killed] EqualityOperator
shared/role/RoleImage/RoleImage.vue:34:23
   }
 
   const apiBaseUrl = removeTrailingSlashes(runtimeConfig.public.werewolvesAssistantApi.baseUrl);
-  const imageSuffix = props.definition === "normal" ? "" : `-${props.definition}`;
+  const imageSuffix = props.definition !== "normal" ? "" : `-${props.definition}`;
 
   return `${apiBaseUrl}/public/assets/images/roles/${props.roleName}/${props.roleName}${imageSuffix}.jpeg`;
killedBy: Role Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Image Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
shared/role/RoleImage/RoleImage.vue:34:23
   }
 
   const apiBaseUrl = removeTrailingSlashes(runtimeConfig.public.werewolvesAssistantApi.baseUrl);
-  const imageSuffix = props.definition === "normal" ? "" : `-${props.definition}`;
+  const imageSuffix = true ? "" : `-${props.definition}`;
 
   return `${apiBaseUrl}/public/assets/images/roles/${props.roleName}/${props.roleName}${imageSuffix}.jpeg`;
killedBy: Role Image Component Image Src should have small suffix for src when definition from props is small.
statusReason: expected 'http://127.0.0.1/public/assets/images…' to be 'http://127.0.0.1/public/assets/images…' // Object.is equality

[Killed] ArrowFunction
shared/role/RoleImage/RoleImage.vue:39:39
   return `${apiBaseUrl}/public/assets/images/roles/${props.roleName}/${props.roleName}${imageSuffix}.jpeg`;
 });
 
-const imageClasses = computed<string>(() => `h-[${props.sizes}px] w-[${props.sizes}px]`);
+const imageClasses = computed<string>(() => undefined);
 
 const imageAlt = computed<string>(() => {
killedBy: Role Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Image Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
shared/role/RoleImage/RoleImage.vue:41:41
 
 const imageClasses = computed<string>(() => `h-[${props.sizes}px] w-[${props.sizes}px]`);
 
-const imageAlt = computed<string>(() => {
-  if (props.alt !== undefined) {
-    return props.alt;
-  }
-  if (props.roleName !== undefined) {
-    return t(`shared.role.name.${props.roleName}`);
-  }
-  return t("components.RoleImage.back");
-});
+const imageAlt = computed<string>(() => {});
 </script>
killedBy: Role Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Image Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
shared/role/RoleImage/RoleImage.vue:42:7
 const imageClasses = computed<string>(() => `h-[${props.sizes}px] w-[${props.sizes}px]`);
 
 const imageAlt = computed<string>(() => {
-  if (props.alt !== undefined) {
+  if (false) {
     return props.alt;
   }
killedBy: Role Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Image Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
shared/role/RoleImage/RoleImage.vue:42:7
 const imageClasses = computed<string>(() => `h-[${props.sizes}px] w-[${props.sizes}px]`);
 
 const imageAlt = computed<string>(() => {
-  if (props.alt !== undefined) {
+  if (props.alt === undefined) {
     return props.alt;
   }
killedBy: Role Image Component should match snapshot when rendered.
statusReason: Snapshot `Role Image Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
shared/role/RoleImage/RoleImage.vue:45:37
   if (props.alt !== undefined) {
     return props.alt;
   }
-  if (props.roleName !== undefined) {
-    return t(`shared.role.name.${props.roleName}`);
-  }
+  if (props.roleName !== undefined) {}
   return t("components.RoleImage.back");
 });
killedBy: Role Image Component Image Alt should have alt from role name when alt from props is undefined but role name is defined.
statusReason: expected 'components.RoleImage.back' to be 'shared.role.name.werewolf' // Object.is equality

[Killed] EqualityOperator
shared/role/RoleImage/RoleImage.vue:45:7
   if (props.alt !== undefined) {
     return props.alt;
   }
-  if (props.roleName !== undefined) {
+  if (props.roleName === undefined) {
     return t(`shared.role.name.${props.roleName}`);
   }
killedBy: Role Image Component Image Alt should have alt from role name when alt from props is undefined but role name is defined.
statusReason: expected 'components.RoleImage.back' to be 'shared.role.name.werewolf' // Object.is equality

[Killed] StringLiteral
shared/role/RoleImage/RoleImage.vue:46:14
     return props.alt;
   }
   if (props.roleName !== undefined) {
-    return t(`shared.role.name.${props.roleName}`);
+    return t(``);
   }
   return t("components.RoleImage.back");
killedBy: Role Image Component Image Alt should have alt from role name when alt from props is undefined but role name is defined.
statusReason: expected '' to be 'shared.role.name.werewolf' // Object.is equality

[Killed] StringLiteral
shared/role/RoleImage/RoleImage.vue:48:12
   if (props.roleName !== undefined) {
     return t(`shared.role.name.${props.roleName}`);
   }
-  return t("components.RoleImage.back");
+  return t("");
 });
 </script>
killedBy: Role Image Component Image Alt should have back alt when alt from props is undefined and role name is undefined.
statusReason: expected '' to be 'components.RoleImage.back' // Object.is equality
