[Killed] BlockStatement
shared/role/RoleSideBadge/RoleSideBadge.vue:20:60
 
 const { t } = useI18n();
 
-const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
-  const roleTypesBadgeAttributes: Record<RoleSide, BadgeProps> = {
-    villagers: { severity: "success" },
-    werewolves: { severity: "danger" },
-  };
-
-  return roleTypesBadgeAttributes[props.roleSide];
-});
+const roleTypeBadgeAttributes = computed<BadgeProps>(() => {});
 
 const badgeValue = computed<string>(() => {
killedBy: Role Side Badge Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] ObjectLiteral
shared/role/RoleSideBadge/RoleSideBadge.vue:21:66
 const { t } = useI18n();
 
 const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
-  const roleTypesBadgeAttributes: Record<RoleSide, BadgeProps> = {
-    villagers: { severity: "success" },
-    werewolves: { severity: "danger" },
-  };
+  const roleTypesBadgeAttributes: Record<RoleSide, BadgeProps> = {};
 
   return roleTypesBadgeAttributes[props.roleSide];
killedBy: Role Side Badge Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] StringLiteral
shared/role/RoleSideBadge/RoleSideBadge.vue:22:28
 
 const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
   const roleTypesBadgeAttributes: Record<RoleSide, BadgeProps> = {
-    villagers: { severity: "success" },
+    villagers: { severity: "" },
     werewolves: { severity: "danger" },
   };
killedBy: Role Side Badge Component should match snapshot when rendered.
statusReason: Snapshot `Role Side Badge Component > should match snapshot when rendered. 1` mismatched

[Killed] ObjectLiteral
shared/role/RoleSideBadge/RoleSideBadge.vue:23:17
 const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
   const roleTypesBadgeAttributes: Record<RoleSide, BadgeProps> = {
     villagers: { severity: "success" },
-    werewolves: { severity: "danger" },
+    werewolves: {},
   };
 
killedBy: Role Side Badge Component Badge should set severity to danger when side is werewolves.
statusReason: expected undefined to be 'danger' // Object.is equality

[Killed] BlockStatement
shared/role/RoleSideBadge/RoleSideBadge.vue:29:43
   return roleTypesBadgeAttributes[props.roleSide];
 });
 
-const badgeValue = computed<string>(() => {
-  if (props.roleSide === "villagers") {
-    return t("components.RoleSideBadge.villagersSide");
-  }
-  return t("components.RoleSideBadge.werewolvesSide");
-});
+const badgeValue = computed<string>(() => {});
 </script>
killedBy: Role Side Badge Component should match snapshot when rendered.
statusReason: Snapshot `Role Side Badge Component > should match snapshot when rendered. 1` mismatched

[Killed] BlockStatement
shared/role/RoleSideBadge/RoleSideBadge.vue:30:39
 });
 
 const badgeValue = computed<string>(() => {
-  if (props.roleSide === "villagers") {
-    return t("components.RoleSideBadge.villagersSide");
-  }
+  if (props.roleSide === "villagers") {}
   return t("components.RoleSideBadge.werewolvesSide");
 });
killedBy: Role Side Badge Component should match snapshot when rendered.
statusReason: Snapshot `Role Side Badge Component > should match snapshot when rendered. 1` mismatched

[Killed] EqualityOperator
shared/role/RoleSideBadge/RoleSideBadge.vue:30:7
 });
 
 const badgeValue = computed<string>(() => {
-  if (props.roleSide === "villagers") {
+  if (props.roleSide !== "villagers") {
     return t("components.RoleSideBadge.villagersSide");
   }
killedBy: Role Side Badge Component should match snapshot when rendered.
statusReason: Snapshot `Role Side Badge Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/role/RoleSideBadge/RoleSideBadge.vue:31:14
 
 const badgeValue = computed<string>(() => {
   if (props.roleSide === "villagers") {
-    return t("components.RoleSideBadge.villagersSide");
+    return t("");
   }
   return t("components.RoleSideBadge.werewolvesSide");
killedBy: Role Side Badge Component should match snapshot when rendered.
statusReason: Snapshot `Role Side Badge Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/role/RoleSideBadge/RoleSideBadge.vue:33:12
   if (props.roleSide === "villagers") {
     return t("components.RoleSideBadge.villagersSide");
   }
-  return t("components.RoleSideBadge.werewolvesSide");
+  return t("");
 });
 </script>
killedBy: Role Side Badge Component Badge should translate role side when side is werewolves.
statusReason: expected '' to be 'components.RoleSideBadge.werewolvesSi…' // Object.is equality
