[Killed] BlockStatement
shared/role/RoleTypeBadge/RoleTypeBadge.vue:19:60
 
 const props = defineProps<RoleTypeBadgeProps>();
 
-const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
-  const roleTypesBadgeAttributes: Record<RoleType, BadgeProps> = {
-    villager: { severity: "success" },
-    werewolf: { severity: "danger" },
-    lonely: { severity: "info" },
-    ambiguous: { severity: "warning" },
-  };
-
-  return roleTypesBadgeAttributes[props.roleType];
-});
+const roleTypeBadgeAttributes = computed<BadgeProps>(() => {});
 </script>
killedBy: Role Type Badge Component should match snapshot when rendered.
statusReason: Hook timed out in 10000ms.
If this is a long-running hook, pass a timeout value as the last argument or configure it globally with "hookTimeout".

[Killed] StringLiteral
shared/role/RoleTypeBadge/RoleTypeBadge.vue:21:27
 
 const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
   const roleTypesBadgeAttributes: Record<RoleType, BadgeProps> = {
-    villager: { severity: "success" },
+    villager: { severity: "" },
     werewolf: { severity: "danger" },
     lonely: { severity: "info" },
killedBy: Role Type Badge Component Badge 'should have severity of success when …'
statusReason: expected '' to be 'success' // Object.is equality

[Killed] ObjectLiteral
shared/role/RoleTypeBadge/RoleTypeBadge.vue:22:15
 const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
   const roleTypesBadgeAttributes: Record<RoleType, BadgeProps> = {
     villager: { severity: "success" },
-    werewolf: { severity: "danger" },
+    werewolf: {},
     lonely: { severity: "info" },
     ambiguous: { severity: "warning" },
killedBy: Role Type Badge Component should match snapshot when rendered.
statusReason: Snapshot `Role Type Badge Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/role/RoleTypeBadge/RoleTypeBadge.vue:22:27
 const roleTypeBadgeAttributes = computed<BadgeProps>(() => {
   const roleTypesBadgeAttributes: Record<RoleType, BadgeProps> = {
     villager: { severity: "success" },
-    werewolf: { severity: "danger" },
+    werewolf: { severity: "" },
     lonely: { severity: "info" },
     ambiguous: { severity: "warning" },
killedBy: Role Type Badge Component should match snapshot when rendered.
statusReason: Snapshot `Role Type Badge Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
shared/role/RoleTypeBadge/RoleTypeBadge.vue:24:28
     villager: { severity: "success" },
     werewolf: { severity: "danger" },
     lonely: { severity: "info" },
-    ambiguous: { severity: "warning" },
+    ambiguous: { severity: "" },
   };
 
killedBy: Role Type Badge Component Badge 'should have severity of warning when …'
statusReason: expected '' to be 'warning' // Object.is equality
