[Killed] BlockStatement
composables/api/error/useWerewolvesAssistantApiError.ts:14:124
   const { addErrorToast } = useVuePrimeToasts();
   const { t } = useI18n();
 
-  function handleWerewolvesAssistantApiError({ response }: { response: FetchResponse<WerewolvesAssistantApiError> }): void {
-    const { _data: errorData } = response;
-    // eslint-disable-next-line no-console
-    console.error(errorData);
-    addErrorToast({
-      summary: t(`composables.useWerewolvesAssistantApiError.statusCode.${response.status}`),
-      detail: t(`composables.useWerewolvesAssistantApiError.checkConsoleForMoreDetails`),
-    });
-  }
+  function handleWerewolvesAssistantApiError({ response }: { response: FetchResponse<WerewolvesAssistantApiError> }): void {}
   return { handleWerewolvesAssistantApiError };
 }
killedBy: Use Werewolves Assistant Api Error Composable handleWerewolvesAssistantApiError should log error in console when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
