[Killed] ObjectLiteral
api/game/game-history-record/useFetchGameHistoryRecords.ts:13:97
 
   async function getGameHistoryRecords(gameId: string): Promise<ReturnType<typeof $fetch<GameHistoryRecord[]>> | null> {
     try {
-      return await fetchWerewolvesAssistantApi<GameHistoryRecord[]>(`/games/${gameId}/history`, { method: "GET" });
+      return await fetchWerewolvesAssistantApi<GameHistoryRecord[]>(`/games/${gameId}/history`, {});
     } catch (error) {
       return null;
killedBy: Use Fetch Game History Records getGameHistoryRecords should get game history records when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "/games/gameId/history",
  Object {
    "method": "GET",
  },
], but it was called with "/games/gameId/history"
