[Killed] LogicalOperator
api/game/game-history-record/useGameHistoryRecord.ts:17:12
       chosenCard,
     } = gameHistoryRecord.play;
 
-    return type === "vote" && !votes ||
+    return type === "vote" || !votes ||
       type === "target" && !targets ||
         type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
killedBy: Game Over History Record Action Component Action Text 'should have infected text when game h…'
statusReason: expected 'components.GameOverHistoryRecordActio…' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] ConditionalExpression
api/game/game-history-record/useGameHistoryRecord.ts:17:12
       chosenCard,
     } = gameHistoryRecord.play;
 
-    return type === "vote" && !votes ||
-      type === "target" && !targets ||
-        type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
-          type === "choose-card" && !chosenCard;
+    return true;
   }
   return { didSourceSkipped };
killedBy: Game Over History Record Action Component Action Text 'should have infected text when game h…'
statusReason: expected 'components.GameOverHistoryRecordActio…' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] LogicalOperator
api/game/game-history-record/useGameHistoryRecord.ts:18:7
     } = gameHistoryRecord.play;
 
     return type === "vote" && !votes ||
-      type === "target" && !targets ||
+      type === "target" || !targets ||
         type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
           type === "choose-card" && !chosenCard;
killedBy: Game Over History Record Action Component Action Text 'should have infected text when game h…'
statusReason: expected 'components.GameOverHistoryRecordActio…' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] ConditionalExpression
api/game/game-history-record/useGameHistoryRecord.ts:18:7
     } = gameHistoryRecord.play;
 
     return type === "vote" && !votes ||
-      type === "target" && !targets ||
+      true && !targets ||
         type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
           type === "choose-card" && !chosenCard;
killedBy: Game Over History Record Action Component Action Icon 'should have people icon when game his…'
statusReason: expected '/svg/game/player/player-attribute/pow…' to be '/svg/misc/people.svg' // Object.is equality

[Killed] LogicalOperator
api/game/game-history-record/useGameHistoryRecord.ts:19:9
 
     return type === "vote" && !votes ||
       type === "target" && !targets ||
-        type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
+        type === "request-another-vote" || didJudgeRequestAnotherVote === undefined ||
           type === "choose-card" && !chosenCard;
   }
killedBy: Game Over History Record Action Component Action Text 'should have infected text when game h…'
statusReason: expected 'components.GameOverHistoryRecordActio…' to be 'components.GameOverHistoryRecordActio…' // Object.is equality

[Killed] ConditionalExpression
api/game/game-history-record/useGameHistoryRecord.ts:19:44
 
     return type === "vote" && !votes ||
       type === "target" && !targets ||
-        type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
+        type === "request-another-vote" && true ||
           type === "choose-card" && !chosenCard;
   }
killedBy: Use Game History Record Spec didSourceSkipped 'should return false when called with …'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
api/game/game-history-record/useGameHistoryRecord.ts:20:11
     return type === "vote" && !votes ||
       type === "target" && !targets ||
         type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
-          type === "choose-card" && !chosenCard;
+          false;
   }
   return { didSourceSkipped };
killedBy: Use Game History Record Spec didSourceSkipped 'should return true when called with c…'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
api/game/game-history-record/useGameHistoryRecord.ts:20:11
     return type === "vote" && !votes ||
       type === "target" && !targets ||
         type === "request-another-vote" && didJudgeRequestAnotherVote === undefined ||
-          type === "choose-card" && !chosenCard;
+          type !== "choose-card" && !chosenCard;
   }
   return { didSourceSkipped };
killedBy: Game Over History Record Action Component Action Text 'should have infected text when game h…'
statusReason: expected 'components.GameOverHistoryRecordActio…' to be 'components.GameOverHistoryRecordActio…' // Object.is equality
