[Killed] EqualityOperator
composables/api/game/useCreateGameDtoValidation.ts:33:59
 
   const { t } = useI18n();
 
-  const isMinimumPlayersReached = computed<boolean>(() => createGameDto.value.players.length >= MIN_PLAYERS_IN_GAME);
+  const isMinimumPlayersReached = computed<boolean>(() => createGameDto.value.players.length > MIN_PLAYERS_IN_GAME);
 
   const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.every(player => player.role.name !== undefined));
killedBy: Use Create Game Dto Validation Composable isMinimumPlayersReached 'should return true when the number of…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:33:59
 
   const { t } = useI18n();
 
-  const isMinimumPlayersReached = computed<boolean>(() => createGameDto.value.players.length >= MIN_PLAYERS_IN_GAME);
+  const isMinimumPlayersReached = computed<boolean>(() => true);
 
   const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.every(player => player.role.name !== undefined));
killedBy: Game Lobby Random Composition Button Component should match snapshot when rendered.
statusReason: Snapshot `Game Lobby Random Composition Button Component > should match snapshot when rendered. 1` mismatched

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:35:50
 
   const isMinimumPlayersReached = computed<boolean>(() => createGameDto.value.players.length >= MIN_PLAYERS_IN_GAME);
 
-  const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.every(player => player.role.name !== undefined));
+  const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.some(player => player.role.name !== undefined));
 
   const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "villagers"));
killedBy: Use Create Game Dto Validation Composable areAllRolesSet 'should return false when not all role…'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
composables/api/game/useCreateGameDtoValidation.ts:35:94
 
   const isMinimumPlayersReached = computed<boolean>(() => createGameDto.value.players.length >= MIN_PLAYERS_IN_GAME);
 
-  const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.every(player => player.role.name !== undefined));
+  const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.every(player => player.role.name === undefined));
 
   const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "villagers"));
killedBy: Use Create Game Dto Validation Composable areAllRolesSet 'should return true when all roles amo…'
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
composables/api/game/useCreateGameDtoValidation.ts:37:100
 
   const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.every(player => player.role.name !== undefined));
 
-  const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "villagers"));
+  const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(() => undefined));
 
   const doesContainOneWerewolfSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "werewolves"));
killedBy: Use Create Game Dto Validation Composable doesContainOneVillagerSidedRole 'should return true when at least one …'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:37:110
 
   const areAllRolesSet = computed<boolean>(() => createGameDto.value.players.every(player => player.role.name !== undefined));
 
-  const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "villagers"));
+  const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => false));
 
   const doesContainOneWerewolfSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "werewolves"));
killedBy: Use Create Game Dto Validation Composable doesContainOneVillagerSidedRole 'should return true when at least one …'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:39:67
 
   const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "villagers"));
 
-  const doesContainOneWerewolfSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "werewolves"));
+  const doesContainOneWerewolfSidedRole = computed<boolean>(() => createGameDto.value.players.every(player => player.side.current === "werewolves"));
 
   const areRolesMinimumPlayersReached = computed<boolean>(() => {
killedBy: Use Create Game Dto Validation Composable doesContainOneWerewolfSidedRole 'should return true when at least one …'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
composables/api/game/useCreateGameDtoValidation.ts:39:110
 
   const doesContainOneVillagerSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "villagers"));
 
-  const doesContainOneWerewolfSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current === "werewolves"));
+  const doesContainOneWerewolfSidedRole = computed<boolean>(() => createGameDto.value.players.some(player => player.side.current !== "werewolves"));
 
   const areRolesMinimumPlayersReached = computed<boolean>(() => {
killedBy: Use Create Game Dto Validation Composable doesContainOneWerewolfSidedRole 'should return false when no player ha…'
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:43:14
 
   const areRolesMinimumPlayersReached = computed<boolean>(() => {
     if (!roles.value) {
-      return false;
+      return true;
     }
     const rolesWithMinimumPlayers = roles.value.filter((role): role is RoleWithMinInGame => role.minInGame !== undefined);
killedBy: Use Create Game Dto Validation Composable areRolesMinimumPlayersReached 'should return false when roles are se…'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
composables/api/game/useCreateGameDtoValidation.ts:45:93
     if (!roles.value) {
       return false;
     }
-    const rolesWithMinimumPlayers = roles.value.filter((role): role is RoleWithMinInGame => role.minInGame !== undefined);
+    const rolesWithMinimumPlayers = roles.value.filter((role): role is RoleWithMinInGame => role.minInGame === undefined);
 
     return rolesWithMinimumPlayers.every(role => isRolePresentAndMinimumPlayersReached(role));
killedBy: Use Create Game Dto Validation Composable areRolesMinimumPlayersReached 'should return true when all roles wit…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:45:93
     if (!roles.value) {
       return false;
     }
-    const rolesWithMinimumPlayers = roles.value.filter((role): role is RoleWithMinInGame => role.minInGame !== undefined);
+    const rolesWithMinimumPlayers = roles.value.filter((role): role is RoleWithMinInGame => false);
 
     return rolesWithMinimumPlayers.every(role => isRolePresentAndMinimumPlayersReached(role));
killedBy: Use Create Game Dto Validation Composable areRolesMinimumPlayersReached 'should return false when the minimum …'
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
composables/api/game/useCreateGameDtoValidation.ts:47:42
     }
     const rolesWithMinimumPlayers = roles.value.filter((role): role is RoleWithMinInGame => role.minInGame !== undefined);
 
-    return rolesWithMinimumPlayers.every(role => isRolePresentAndMinimumPlayersReached(role));
+    return rolesWithMinimumPlayers.every(() => undefined);
   });
 
killedBy: Use Create Game Dto Validation Composable areRolesMinimumPlayersReached 'should return true when all roles wit…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:47:12
     }
     const rolesWithMinimumPlayers = roles.value.filter((role): role is RoleWithMinInGame => role.minInGame !== undefined);
 
-    return rolesWithMinimumPlayers.every(role => isRolePresentAndMinimumPlayersReached(role));
+    return rolesWithMinimumPlayers.some(role => isRolePresentAndMinimumPlayersReached(role));
   });
 
killedBy: Use Create Game Dto Validation Composable areRolesMinimumPlayersReached 'should return false when the minimum …'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:69:71
   });
 
   const areAdditionalCardsSetForThiefIfPresent = computed<boolean>(() => {
-    const isThiefPresent = createGameDto.value.players.some(player => player.role.name === "thief");
+    const isThiefPresent = createGameDto.value.players.some(player => true);
     const areAdditionalCardsSetForThief = createGameDto.value.additionalCards?.some(card => card.recipient === "thief") === true;
     if (isThiefPresent) {
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForThiefIfPresent 'should return true when the thief is …'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:69:28
   });
 
   const areAdditionalCardsSetForThiefIfPresent = computed<boolean>(() => {
-    const isThiefPresent = createGameDto.value.players.some(player => player.role.name === "thief");
+    const isThiefPresent = createGameDto.value.players.every(player => player.role.name === "thief");
     const areAdditionalCardsSetForThief = createGameDto.value.additionalCards?.some(card => card.recipient === "thief") === true;
     if (isThiefPresent) {
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForThiefIfPresent 'should return false when the thief is…'
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:70:43
 
   const areAdditionalCardsSetForThiefIfPresent = computed<boolean>(() => {
     const isThiefPresent = createGameDto.value.players.some(player => player.role.name === "thief");
-    const areAdditionalCardsSetForThief = createGameDto.value.additionalCards?.some(card => card.recipient === "thief") === true;
+    const areAdditionalCardsSetForThief = createGameDto.value.additionalCards?.every(card => card.recipient === "thief") === true;
     if (isThiefPresent) {
       return areAdditionalCardsSetForThief;
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForThiefIfPresent 'should return true when the thief is …'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:70:43
 
   const areAdditionalCardsSetForThiefIfPresent = computed<boolean>(() => {
     const isThiefPresent = createGameDto.value.players.some(player => player.role.name === "thief");
-    const areAdditionalCardsSetForThief = createGameDto.value.additionalCards?.some(card => card.recipient === "thief") === true;
+    const areAdditionalCardsSetForThief = true;
     if (isThiefPresent) {
       return areAdditionalCardsSetForThief;
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForThiefIfPresent 'should return false when the thief is…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:71:9
   const areAdditionalCardsSetForThiefIfPresent = computed<boolean>(() => {
     const isThiefPresent = createGameDto.value.players.some(player => player.role.name === "thief");
     const areAdditionalCardsSetForThief = createGameDto.value.additionalCards?.some(card => card.recipient === "thief") === true;
-    if (isThiefPresent) {
+    if (true) {
       return areAdditionalCardsSetForThief;
     }
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForThiefIfPresent 'should return true when the thief is …'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:71:9
   const areAdditionalCardsSetForThiefIfPresent = computed<boolean>(() => {
     const isThiefPresent = createGameDto.value.players.some(player => player.role.name === "thief");
     const areAdditionalCardsSetForThief = createGameDto.value.additionalCards?.some(card => card.recipient === "thief") === true;
-    if (isThiefPresent) {
+    if (false) {
       return areAdditionalCardsSetForThief;
     }
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForThiefIfPresent 'should return false when the thief is…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:78:71
   });
 
   const areAdditionalCardsSetForActorIfPresent = computed<boolean>(() => {
-    const isActorPresent = createGameDto.value.players.some(player => player.role.name === "actor");
+    const isActorPresent = createGameDto.value.players.some(player => false);
     const areAdditionalCardsSetForActor = createGameDto.value.additionalCards?.some(card => card.recipient === "actor") === true;
     if (isActorPresent) {
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForActorIfPresent 'should return false when the actor is…'
statusReason: expected true to be false // Object.is equality

[Killed] ArrowFunction
composables/api/game/useCreateGameDtoValidation.ts:78:61
   });
 
   const areAdditionalCardsSetForActorIfPresent = computed<boolean>(() => {
-    const isActorPresent = createGameDto.value.players.some(player => player.role.name === "actor");
+    const isActorPresent = createGameDto.value.players.some(() => undefined);
     const areAdditionalCardsSetForActor = createGameDto.value.additionalCards?.some(card => card.recipient === "actor") === true;
     if (isActorPresent) {
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForActorIfPresent 'should return false when the actor is…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:79:93
 
   const areAdditionalCardsSetForActorIfPresent = computed<boolean>(() => {
     const isActorPresent = createGameDto.value.players.some(player => player.role.name === "actor");
-    const areAdditionalCardsSetForActor = createGameDto.value.additionalCards?.some(card => card.recipient === "actor") === true;
+    const areAdditionalCardsSetForActor = createGameDto.value.additionalCards?.some(card => false) === true;
     if (isActorPresent) {
       return areAdditionalCardsSetForActor;
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForActorIfPresent 'should return true when the actor is …'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:79:43
 
   const areAdditionalCardsSetForActorIfPresent = computed<boolean>(() => {
     const isActorPresent = createGameDto.value.players.some(player => player.role.name === "actor");
-    const areAdditionalCardsSetForActor = createGameDto.value.additionalCards?.some(card => card.recipient === "actor") === true;
+    const areAdditionalCardsSetForActor = false;
     if (isActorPresent) {
       return areAdditionalCardsSetForActor;
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForActorIfPresent 'should return true when the actor is …'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:80:9
   const areAdditionalCardsSetForActorIfPresent = computed<boolean>(() => {
     const isActorPresent = createGameDto.value.players.some(player => player.role.name === "actor");
     const areAdditionalCardsSetForActor = createGameDto.value.additionalCards?.some(card => card.recipient === "actor") === true;
-    if (isActorPresent) {
+    if (false) {
       return areAdditionalCardsSetForActor;
     }
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForActorIfPresent 'should return false when the actor is…'
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
composables/api/game/useCreateGameDtoValidation.ts:80:25
   const areAdditionalCardsSetForActorIfPresent = computed<boolean>(() => {
     const isActorPresent = createGameDto.value.players.some(player => player.role.name === "actor");
     const areAdditionalCardsSetForActor = createGameDto.value.additionalCards?.some(card => card.recipient === "actor") === true;
-    if (isActorPresent) {
-      return areAdditionalCardsSetForActor;
-    }
+    if (isActorPresent) {}
     return true;
   });
killedBy: Use Create Game Dto Validation Composable areAdditionalCardsSetForActorIfPresent 'should return false when the actor is…'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
composables/api/game/useCreateGameDtoValidation.ts:87:87
   });
 
   const arePlayerGroupsSetForPrejudicedManipulatorIfPresent = computed<boolean>(() => {
-    const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => player.role.name === "prejudiced-manipulator");
+    const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => player.role.name !== "prejudiced-manipulator");
     const arePlayerGroupsSet = createGameDto.value.players.every(player => player.group);
     if (isPrejudicedManipulatorPresent) {
killedBy: Use Create Game Dto Validation Composable canCreateGame 'should return true when game can be c…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:87:87
   });
 
   const arePlayerGroupsSetForPrejudicedManipulatorIfPresent = computed<boolean>(() => {
-    const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => player.role.name === "prejudiced-manipulator");
+    const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => true);
     const arePlayerGroupsSet = createGameDto.value.players.every(player => player.group);
     if (isPrejudicedManipulatorPresent) {
killedBy: Use Create Game Dto Validation Composable canCreateGame 'should return true when game can be c…'
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
composables/api/game/useCreateGameDtoValidation.ts:88:66
 
   const arePlayerGroupsSetForPrejudicedManipulatorIfPresent = computed<boolean>(() => {
     const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => player.role.name === "prejudiced-manipulator");
-    const arePlayerGroupsSet = createGameDto.value.players.every(player => player.group);
+    const arePlayerGroupsSet = createGameDto.value.players.every(() => undefined);
     if (isPrejudicedManipulatorPresent) {
       return arePlayerGroupsSet;
killedBy: Use Create Game Dto Validation Composable arePlayerGroupsSetForPrejudicedManipulatorIfPresent 'should return true when the prejudice…'
statusReason: expected false to be true // Object.is equality

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:88:32
 
   const arePlayerGroupsSetForPrejudicedManipulatorIfPresent = computed<boolean>(() => {
     const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => player.role.name === "prejudiced-manipulator");
-    const arePlayerGroupsSet = createGameDto.value.players.every(player => player.group);
+    const arePlayerGroupsSet = createGameDto.value.players.some(player => player.group);
     if (isPrejudicedManipulatorPresent) {
       return arePlayerGroupsSet;
killedBy: Use Create Game Dto Validation Composable arePlayerGroupsSetForPrejudicedManipulatorIfPresent 'should return false when the prejudic…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:89:9
   const arePlayerGroupsSetForPrejudicedManipulatorIfPresent = computed<boolean>(() => {
     const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => player.role.name === "prejudiced-manipulator");
     const arePlayerGroupsSet = createGameDto.value.players.every(player => player.group);
-    if (isPrejudicedManipulatorPresent) {
+    if (true) {
       return arePlayerGroupsSet;
     }
killedBy: Use Create Game Dto Validation Composable canCreateGame 'should return true when game can be c…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:89:9
   const arePlayerGroupsSetForPrejudicedManipulatorIfPresent = computed<boolean>(() => {
     const isPrejudicedManipulatorPresent = createGameDto.value.players.some(player => player.role.name === "prejudiced-manipulator");
     const arePlayerGroupsSet = createGameDto.value.players.every(player => player.group);
-    if (isPrejudicedManipulatorPresent) {
+    if (false) {
       return arePlayerGroupsSet;
     }
killedBy: Use Create Game Dto Validation Composable arePlayerGroupsSetForPrejudicedManipulatorIfPresent 'should return false when the prejudic…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:95:49
     return true;
   });
 
-  const canCreateGame = computed<boolean>(() => isMinimumPlayersReached.value &&
-    areAllRolesSet.value &&
-    doesContainOneVillagerSidedRole.value &&
-    doesContainOneWerewolfSidedRole.value &&
-    areRolesMinimumPlayersReached.value &&
-    areAdditionalCardsSetForThiefIfPresent.value &&
-    areAdditionalCardsSetForActorIfPresent.value &&
-    arePlayerGroupsSetForPrejudicedManipulatorIfPresent.value);
+  const canCreateGame = computed<boolean>(() => false);
 
   const gameCreationValidationErrors = computed<string[]>(() => {
killedBy: Use Create Game Dto Validation Composable canCreateGame 'should return true when game can be c…'
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
composables/api/game/useCreateGameDtoValidation.ts:95:49
     return true;
   });
 
-  const canCreateGame = computed<boolean>(() => isMinimumPlayersReached.value &&
-    areAllRolesSet.value &&
-    doesContainOneVillagerSidedRole.value &&
-    doesContainOneWerewolfSidedRole.value &&
+  const canCreateGame = computed<boolean>(() => isMinimumPlayersReached.value && areAllRolesSet.value && doesContainOneVillagerSidedRole.value || doesContainOneWerewolfSidedRole.value &&
     areRolesMinimumPlayersReached.value &&
     areAdditionalCardsSetForThiefIfPresent.value &&
killedBy: Use Create Game Dto Validation Composable canCreateGame 'should return false when the minimum …'
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:106:81
 
   const gameCreationValidationErrors = computed<string[]>(() => {
     const errors: Record<string, boolean> = {
-      [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: !isMinimumPlayersReached.value,
+      [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: isMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [] to include 'composables.useCreateGameDtoValidatio…'

[Killed] StringLiteral
composables/api/game/useCreateGameDtoValidation.ts:106:10
 
   const gameCreationValidationErrors = computed<string[]>(() => {
     const errors: Record<string, boolean> = {
-      [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: !isMinimumPlayersReached.value,
+      [t("")]: !isMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ '' ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:107:72
   const gameCreationValidationErrors = computed<string[]>(() => {
     const errors: Record<string, boolean> = {
       [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: !isMinimumPlayersReached.value,
-      [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
+      [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] StringLiteral
composables/api/game/useCreateGameDtoValidation.ts:107:10
   const gameCreationValidationErrors = computed<string[]>(() => {
     const errors: Record<string, boolean> = {
       [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: !isMinimumPlayersReached.value,
-      [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
+      [t("")]: !areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ '', …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:108:74
     const errors: Record<string, boolean> = {
       [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: !isMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
-      [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
+      [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: doesContainOneVillagerSidedRole.value,
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
       [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:109:74
       [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: !isMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
-      [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
+      [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: doesContainOneWerewolfSidedRole.value,
       [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [] to include 'composables.useCreateGameDtoValidatio…'
