[Killed] StringLiteral
composables/api/game/useCreateGameDtoValidation.ts:109:10
       [t("composables.useCreateGameDtoValidation.minimumOfPlayersNotReached")]: !isMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
-      [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
+      [t("")]: !doesContainOneWerewolfSidedRole.value,
       [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ '' ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:110:89
       [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
-      [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
+      [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: isTwoSistersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: !areAdditionalCardsSetForThiefIfPresent.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] StringLiteral
composables/api/game/useCreateGameDtoValidation.ts:110:10
       [t("composables.useCreateGameDtoValidation.notAllRolesAreSet")]: !areAllRolesSet.value,
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
-      [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
+      [t("")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: !areAdditionalCardsSetForThiefIfPresent.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(3) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:111:92
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
       [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
-      [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
+      [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: isThreeBrothersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: !areAdditionalCardsSetForThiefIfPresent.value,
       [t("composables.useCreateGameDtoValidation.actorAdditionalCardsNotSet")]: !areAdditionalCardsSetForActorIfPresent.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] StringLiteral
composables/api/game/useCreateGameDtoValidation.ts:111:10
       [t("composables.useCreateGameDtoValidation.noVillagerSidedRole")]: !doesContainOneVillagerSidedRole.value,
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
       [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
-      [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
+      [t("")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: !areAdditionalCardsSetForThiefIfPresent.value,
       [t("composables.useCreateGameDtoValidation.actorAdditionalCardsNotSet")]: !areAdditionalCardsSetForActorIfPresent.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(3) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:112:81
       [t("composables.useCreateGameDtoValidation.noWerewolfSidedRole")]: !doesContainOneWerewolfSidedRole.value,
       [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
-      [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: !areAdditionalCardsSetForThiefIfPresent.value,
+      [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: areAdditionalCardsSetForThiefIfPresent.value,
       [t("composables.useCreateGameDtoValidation.actorAdditionalCardsNotSet")]: !areAdditionalCardsSetForActorIfPresent.value,
       [t("composables.useCreateGameDtoValidation.prejudicedManipulatorGroupsNotSet")]: !arePlayerGroupsSetForPrejudicedManipulatorIfPresent.value,
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:113:81
       [t("composables.useCreateGameDtoValidation.twoSistersMinimumPlayersNotReached")]: !isTwoSistersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: !areAdditionalCardsSetForThiefIfPresent.value,
-      [t("composables.useCreateGameDtoValidation.actorAdditionalCardsNotSet")]: !areAdditionalCardsSetForActorIfPresent.value,
+      [t("composables.useCreateGameDtoValidation.actorAdditionalCardsNotSet")]: areAdditionalCardsSetForActorIfPresent.value,
       [t("composables.useCreateGameDtoValidation.prejudicedManipulatorGroupsNotSet")]: !arePlayerGroupsSetForPrejudicedManipulatorIfPresent.value,
     };
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] BooleanLiteral
composables/api/game/useCreateGameDtoValidation.ts:114:88
       [t("composables.useCreateGameDtoValidation.threeBrothersMinimumPlayersNotReached")]: !isThreeBrothersRolePresentAndMinimumPlayersReached.value,
       [t("composables.useCreateGameDtoValidation.thiefAdditionalCardsNotSet")]: !areAdditionalCardsSetForThiefIfPresent.value,
       [t("composables.useCreateGameDtoValidation.actorAdditionalCardsNotSet")]: !areAdditionalCardsSetForActorIfPresent.value,
-      [t("composables.useCreateGameDtoValidation.prejudicedManipulatorGroupsNotSet")]: !arePlayerGroupsSetForPrejudicedManipulatorIfPresent.value,
+      [t("composables.useCreateGameDtoValidation.prejudicedManipulatorGroupsNotSet")]: arePlayerGroupsSetForPrejudicedManipulatorIfPresent.value,
     };
 
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] ArrowFunction
composables/api/game/useCreateGameDtoValidation.ts:117:39
       [t("composables.useCreateGameDtoValidation.prejudicedManipulatorGroupsNotSet")]: !arePlayerGroupsSetForPrejudicedManipulatorIfPresent.value,
     };
 
-    return Object.keys(errors).filter((key: keyof typeof errors) => errors[key]);
+    return Object.keys(errors).filter(() => undefined);
   });
 
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [] to include 'composables.useCreateGameDtoValidatio…'

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:117:12
       [t("composables.useCreateGameDtoValidation.prejudicedManipulatorGroupsNotSet")]: !arePlayerGroupsSetForPrejudicedManipulatorIfPresent.value,
     };
 
-    return Object.keys(errors).filter((key: keyof typeof errors) => errors[key]);
+    return Object.keys(errors);
   });
 
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors should return empty array when game can be created.
statusReason: expected [ …(9) ] to strictly equal []

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:121:74
   });
 
   function isRolePresentAndMinimumPlayersReached(role: RoleWithMinInGame): boolean {
-    const playersWithRole = createGameDto.value.players.filter(player => player.role.name === role.name);
+    const playersWithRole = createGameDto.value.players.filter(player => true);
     const playersWithRoleCount = playersWithRole.length;
 
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] MethodExpression
composables/api/game/useCreateGameDtoValidation.ts:121:29
   });
 
   function isRolePresentAndMinimumPlayersReached(role: RoleWithMinInGame): boolean {
-    const playersWithRole = createGameDto.value.players.filter(player => player.role.name === role.name);
+    const playersWithRole = createGameDto.value.players;
     const playersWithRoleCount = playersWithRole.length;
 
killedBy: Use Create Game Dto Validation Composable gameCreationValidationErrors 'should contain specific error message…'
statusReason: expected [ …(2) ] to include 'composables.useCreateGameDtoValidatio…'

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:124:12
     const playersWithRole = createGameDto.value.players.filter(player => player.role.name === role.name);
     const playersWithRoleCount = playersWithRole.length;
 
-    return playersWithRoleCount === 0 || playersWithRoleCount >= role.minInGame;
+    return false;
   }
   return {
killedBy: Use Create Game Dto Validation Composable areRolesMinimumPlayersReached 'should return true when all roles wit…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useCreateGameDtoValidation.ts:124:12
     const playersWithRole = createGameDto.value.players.filter(player => player.role.name === role.name);
     const playersWithRoleCount = playersWithRole.length;
 
-    return playersWithRoleCount === 0 || playersWithRoleCount >= role.minInGame;
+    return false || playersWithRoleCount >= role.minInGame;
   }
   return {
killedBy: Use Create Game Dto Validation Composable areRolesMinimumPlayersReached 'should return true when all roles wit…'
statusReason: expected false to be true // Object.is equality
