[Killed] ObjectLiteral
composables/api/game/useFetchGames.ts:18:64
 
   async function createGame(createGameDto: CreateGameDto): Promise<ReturnType<typeof $fetch<Game>> | null> {
     try {
-      return await fetchWerewolvesAssistantApi<Game>(`/games`, {
-        method: "POST",
-        body: JSON.stringify(createGameDto),
-      });
+      return await fetchWerewolvesAssistantApi<Game>(`/games`, {});
     } catch (error) {
       return null;
killedBy: Use Fetch Game Composable createGame should create game when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "/games",
  Object {
    "method": "POST",
  },

[Killed] StringLiteral
composables/api/game/useFetchGames.ts:45:54
 
   async function makeGamePlay(gameId: string, makeGamePlayDto: MakeGamePlayDto): Promise<ReturnType<typeof $fetch<Game>> | null> {
     try {
-      return await fetchWerewolvesAssistantApi<Game>(`/games/${gameId}/play`, {
+      return await fetchWerewolvesAssistantApi<Game>(``, {
         method: "POST",
         body: JSON.stringify(makeGamePlayDto),
killedBy: Use Fetch Game Composable makeGamePlay should make game play when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "/games/game-id/play",
  Object {
    "body": "{}",
    "method": "POST",
  },

[Killed] ObjectLiteral
composables/api/game/useFetchGames.ts:45:79
 
   async function makeGamePlay(gameId: string, makeGamePlayDto: MakeGamePlayDto): Promise<ReturnType<typeof $fetch<Game>> | null> {
     try {
-      return await fetchWerewolvesAssistantApi<Game>(`/games/${gameId}/play`, {
-        method: "POST",
-        body: JSON.stringify(makeGamePlayDto),
-      });
+      return await fetchWerewolvesAssistantApi<Game>(`/games/${gameId}/play`, {});
     } catch (error) {
       return null;
killedBy: Use Fetch Game Composable makeGamePlay should make game play when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "/games/game-id/play",
  Object {
    "body": "{}",
    "method": "POST",
  },
