[Killed] ObjectLiteral
composables/api/game/useFetchRandomGameComposition.ts:24:119
   async function fetchRandomGameComposition(query: GetRandomGameCompositionQuery): Promise<ReturnType<typeof $fetch<CreateGamePlayerDto[] | null>>> {
     const stringifiedQuery = stringify(query);
 
-    return fetchWerewolvesAssistantApi<CreateGamePlayerDto[] | null>(`/games/random-composition?${stringifiedQuery}`, { method: "GET" });
+    return fetchWerewolvesAssistantApi<CreateGamePlayerDto[] | null>(`/games/random-composition?${stringifiedQuery}`, {});
   }
   return { fetchRandomGameComposition };
killedBy: Use Fetch Random Game Composition fetchRandomGameComposition should fetch random game composition when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  "/games/random-composition?stringifiedQuery",
  Object {
    "method": "GET",
  },
], but it was called with "/games/random-composition?stringifiedQuery"
