[Killed] ConditionalExpression
composables/api/game/useGameSource.ts:16:9
   const { getDefiniteRoleNameLabel } = useRoleName();
 
   function getDefiniteGameSourceNameLabel(gameSource: GameSource, count: number): string {
-    if (gameSource === "sheriff") {
+    if (false) {
       return t(`shared.game.player.attribute.definiteName.sheriff`, count);
     }
killedBy: Use Game Source Composable getDefiniteGameSourceNameLabel 'should translate game source when cal…'
statusReason: expected 'shared.role.definiteName.sheriff, 1' to be 'shared.game.player.attribute.definite…' // Object.is equality

[Killed] EqualityOperator
composables/api/game/useGameSource.ts:16:9
   const { getDefiniteRoleNameLabel } = useRoleName();
 
   function getDefiniteGameSourceNameLabel(gameSource: GameSource, count: number): string {
-    if (gameSource === "sheriff") {
+    if (gameSource !== "sheriff") {
       return t(`shared.game.player.attribute.definiteName.sheriff`, count);
     }
killedBy: Game Over History Record Source Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Source Component > should match snapshot when rendered. 1` mismatched

[Killed] StringLiteral
composables/api/game/useGameSource.ts:17:16
 
   function getDefiniteGameSourceNameLabel(gameSource: GameSource, count: number): string {
     if (gameSource === "sheriff") {
-      return t(`shared.game.player.attribute.definiteName.sheriff`, count);
+      return t(``, count);
     }
     if (PLAYER_GROUPS.includes(gameSource as PlayerGroup)) {
killedBy: Use Game Source Composable getDefiniteGameSourceNameLabel 'should translate game source when cal…'
statusReason: expected ', 1' to be 'shared.game.player.attribute.definite…' // Object.is equality

[Killed] BlockStatement
composables/api/game/useGameSource.ts:19:60
     if (gameSource === "sheriff") {
       return t(`shared.game.player.attribute.definiteName.sheriff`, count);
     }
-    if (PLAYER_GROUPS.includes(gameSource as PlayerGroup)) {
-      return t(`shared.game.player.group.definiteName.${gameSource}`, count);
-    }
+    if (PLAYER_GROUPS.includes(gameSource as PlayerGroup)) {}
     return getDefiniteRoleNameLabel(gameSource as RoleName, count);
   }
killedBy: Game Over History Record Source Component should match snapshot when rendered.
statusReason: Snapshot `Game Over History Record Source Component > should match snapshot when rendered. 1` mismatched

[Killed] ConditionalExpression
composables/api/game/useGameSource.ts:19:9
     if (gameSource === "sheriff") {
       return t(`shared.game.player.attribute.definiteName.sheriff`, count);
     }
-    if (PLAYER_GROUPS.includes(gameSource as PlayerGroup)) {
+    if (true) {
       return t(`shared.game.player.group.definiteName.${gameSource}`, count);
     }
killedBy: Use Game Source Composable getDefiniteGameSourceNameLabel 'should translate definite role name w…'
statusReason: expected 'shared.game.player.group.definiteName…' to be 'shared.role.definiteName.werewolf, 1' // Object.is equality
