[Killed] BooleanLiteral
composables/api/game/useMakeGamePlayDtoValidation.ts:18:14
 function useMakeGamePlayDtoValidation(makeGamePlayDto: Ref<MakeGamePlayDto>, game: Ref<Game>): UseMakeGamePlayDtoValidation {
   const isCurrentGamePlayVoteTypeAndValid = computed<boolean>(() => {
     if (game.value.currentPlay?.type !== "vote" || makeGamePlayDto.value.votes === undefined) {
-      return false;
+      return true;
     }
     const voteInteraction = game.value.currentPlay.source.interactions?.[0];
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayVoteTypeAndValid 'should return false when current play…'
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
composables/api/game/useMakeGamePlayDtoValidation.ts:22:14
     }
     const voteInteraction = game.value.currentPlay.source.interactions?.[0];
     if (voteInteraction === undefined) {
-      return false;
+      return true;
     }
     const { votes } = makeGamePlayDto.value;
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayVoteTypeAndValid 'should return false when interactions…'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
composables/api/game/useMakeGamePlayDtoValidation.ts:26:12
     }
     const { votes } = makeGamePlayDto.value;
 
-    return votes.length >= voteInteraction.boundaries.min;
+    return votes.length > voteInteraction.boundaries.min;
   });
 
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayVoteTypeAndValid 'should return true when votes are equ…'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
composables/api/game/useMakeGamePlayDtoValidation.ts:26:12
     }
     const { votes } = makeGamePlayDto.value;
 
-    return votes.length >= voteInteraction.boundaries.min;
+    return votes.length < voteInteraction.boundaries.min;
   });
 
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayVoteTypeAndValid 'should return false when votes don\'t…'
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
composables/api/game/useMakeGamePlayDtoValidation.ts:31:14
 
   const isCurrentGamePlayTargetTypeAndValid = computed<boolean>(() => {
     if (game.value.currentPlay?.type !== "target" || makeGamePlayDto.value.targets === undefined) {
-      return false;
+      return true;
     }
 
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayTargetTypeAndValid 'should return false when current play…'
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
composables/api/game/useMakeGamePlayDtoValidation.ts:36:14
 
     const targetInteraction = game.value.currentPlay.source.interactions?.[0];
     if (targetInteraction === undefined) {
-      return false;
+      return true;
     }
     const { targets } = makeGamePlayDto.value;
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayTargetTypeAndValid 'should return false when eligible tar…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useMakeGamePlayDtoValidation.ts:40:12
     }
     const { targets } = makeGamePlayDto.value;
 
-    return targets.length >= targetInteraction.boundaries.min;
+    return false;
   });
 
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayTargetTypeAndValid 'should return true when targets are e…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useMakeGamePlayDtoValidation.ts:40:12
     }
     const { targets } = makeGamePlayDto.value;
 
-    return targets.length >= targetInteraction.boundaries.min;
+    return true;
   });
 
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayTargetTypeAndValid 'should return false when targets don\…'
statusReason: expected true to be false // Object.is equality

[Killed] LogicalOperator
composables/api/game/useMakeGamePlayDtoValidation.ts:43:75
     return targets.length >= targetInteraction.boundaries.min;
   });
 
-  const isCurrentGamePlayChooseCardTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-card" && makeGamePlayDto.value.chosenCardId !== undefined);
+  const isCurrentGamePlayChooseCardTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-card" || makeGamePlayDto.value.chosenCardId !== undefined);
 
   const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-side" && makeGamePlayDto.value.chosenSide !== undefined);
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayChooseCardTypeAndValid 'should return false when current play…'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
composables/api/game/useMakeGamePlayDtoValidation.ts:43:125
     return targets.length >= targetInteraction.boundaries.min;
   });
 
-  const isCurrentGamePlayChooseCardTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-card" && makeGamePlayDto.value.chosenCardId !== undefined);
+  const isCurrentGamePlayChooseCardTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-card" && makeGamePlayDto.value.chosenCardId === undefined);
 
   const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-side" && makeGamePlayDto.value.chosenSide !== undefined);
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayChooseCardTypeAndValid 'should return false when chosen card …'
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
composables/api/game/useMakeGamePlayDtoValidation.ts:45:75
 
   const isCurrentGamePlayChooseCardTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-card" && makeGamePlayDto.value.chosenCardId !== undefined);
 
-  const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-side" && makeGamePlayDto.value.chosenSide !== undefined);
+  const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type !== "choose-side" && makeGamePlayDto.value.chosenSide !== undefined);
 
   const canCurrentPlayBeSkipped = computed<boolean>(() => game.value.currentPlay?.canBeSkipped === true);
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayChooseSideTypeAndValid 'should return false when current play…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useMakeGamePlayDtoValidation.ts:45:75
 
   const isCurrentGamePlayChooseCardTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-card" && makeGamePlayDto.value.chosenCardId !== undefined);
 
-  const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-side" && makeGamePlayDto.value.chosenSide !== undefined);
+  const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => false);
 
   const canCurrentPlayBeSkipped = computed<boolean>(() => game.value.currentPlay?.canBeSkipped === true);
killedBy: Use Make Game Play Dto Validation Composable isCurrentGamePlayChooseSideTypeAndValid 'should return true when chosen side i…'
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
composables/api/game/useMakeGamePlayDtoValidation.ts:47:100
 
   const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-side" && makeGamePlayDto.value.chosenSide !== undefined);
 
-  const canCurrentPlayBeSkipped = computed<boolean>(() => game.value.currentPlay?.canBeSkipped === true);
+  const canCurrentPlayBeSkipped = computed<boolean>(() => game.value.currentPlay?.canBeSkipped === false);
 
   const canMakeGamePlay = computed<boolean>(() => canCurrentPlayBeSkipped.value ||
killedBy: Use Make Game Play Dto Validation Composable canCurrentPlayBeSkipped should return false when current play can't be skipped.
statusReason: expected true to be falsy

[Killed] ConditionalExpression
composables/api/game/useMakeGamePlayDtoValidation.ts:47:59
 
   const isCurrentGamePlayChooseSideTypeAndValid = computed<boolean>(() => game.value.currentPlay?.type === "choose-side" && makeGamePlayDto.value.chosenSide !== undefined);
 
-  const canCurrentPlayBeSkipped = computed<boolean>(() => game.value.currentPlay?.canBeSkipped === true);
+  const canCurrentPlayBeSkipped = computed<boolean>(() => false);
 
   const canMakeGamePlay = computed<boolean>(() => canCurrentPlayBeSkipped.value ||
killedBy: Game Playground Footer Make Play Button Component Make Game Play Button should be enabled when make game play dto is valid.
statusReason: expected 'true' to be 'false' // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useMakeGamePlayDtoValidation.ts:49:51
 
   const canCurrentPlayBeSkipped = computed<boolean>(() => game.value.currentPlay?.canBeSkipped === true);
 
-  const canMakeGamePlay = computed<boolean>(() => canCurrentPlayBeSkipped.value ||
-    isCurrentGamePlayVoteTypeAndValid.value ||
-    isCurrentGamePlayTargetTypeAndValid.value ||
-    isCurrentGamePlayChooseCardTypeAndValid.value ||
-    isCurrentGamePlayChooseSideTypeAndValid.value);
+  const canMakeGamePlay = computed<boolean>(() => true);
 
   return {
killedBy: Use Make Game Play Dto Validation Composable canMakeGamePlay 'should return false when make game pl…'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
composables/api/game/useMakeGamePlayDtoValidation.ts:49:51
 
   const canCurrentPlayBeSkipped = computed<boolean>(() => game.value.currentPlay?.canBeSkipped === true);
 
-  const canMakeGamePlay = computed<boolean>(() => canCurrentPlayBeSkipped.value ||
-    isCurrentGamePlayVoteTypeAndValid.value ||
-    isCurrentGamePlayTargetTypeAndValid.value ||
-    isCurrentGamePlayChooseCardTypeAndValid.value ||
-    isCurrentGamePlayChooseSideTypeAndValid.value);
+  const canMakeGamePlay = computed<boolean>(() => false);
 
   return {
killedBy: Use Make Game Play Dto Validation Composable canMakeGamePlay 'should return true when current play …'
statusReason: expected false to be true // Object.is equality
