[Killed] StringLiteral
composables/api/useWerewolvesAssistantApi.ts:17:32
 
   const fetchWerewolvesAssistantApi = createFetch().create({
     baseURL: removeTrailingSlashes(baseUrl),
-    headers: { "Content-Type": "application/json" },
+    headers: { "Content-Type": "" },
     onResponseError: handleWerewolvesAssistantApiError,
   });
killedBy: Use Werewolves Assistant Api Composable fetchWerewolvesAssistantApi should create a fetch instance for Werewolves Assistant API when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "baseURL": "http://127.0.0.1",
    "headers": Object {
      "Content-Type": "application/json",
    },
