[Killed] BlockStatement
composables/vue-prime/useVuePrimeToasts.ts:17:57
 function useVuePrimeToasts(): UseVuePrimeToasts {
   const toast = useToast();
 
-  function addToast(options: ToastMessageOptions): void {
-    toast.add({
-      ...DEFAULT_VUE_PRIME_TOAST_OPTIONS,
-      ...options,
-    });
-  }
+  function addToast(options: ToastMessageOptions): void {}
 
   function addSuccessToast(options: ToastMessageOptions): void {
killedBy: Use Vue Prime Toasts Composable addToast should add a toast with default options when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
composables/vue-prime/useVuePrimeToasts.ts:24:64
     });
   }
 
-  function addSuccessToast(options: ToastMessageOptions): void {
-    addToast({ severity: "success", ...options });
-  }
+  function addSuccessToast(options: ToastMessageOptions): void {}
 
   function addInfoToast(options: ToastMessageOptions): void {
killedBy: Use Vue Prime Toasts Composable addSuccessToast should add a success toast with default options when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ObjectLiteral
composables/vue-prime/useVuePrimeToasts.ts:25:14
   }
 
   function addSuccessToast(options: ToastMessageOptions): void {
-    addToast({ severity: "success", ...options });
+    addToast({});
   }
 
killedBy: Use Vue Prime Toasts Composable addSuccessToast should add a success toast with default options when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "closable": true,
    "detail": "detail",
    "life": 4000,
    "severity": "success",

[Killed] BlockStatement
composables/vue-prime/useVuePrimeToasts.ts:28:61
     addToast({ severity: "success", ...options });
   }
 
-  function addInfoToast(options: ToastMessageOptions): void {
-    addToast({ severity: "info", ...options });
-  }
+  function addInfoToast(options: ToastMessageOptions): void {}
 
   function addWarnToast(options: ToastMessageOptions): void {
killedBy: Use Vue Prime Toasts Composable addInfoToast should add an info toast with default options when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
composables/vue-prime/useVuePrimeToasts.ts:32:61
     addToast({ severity: "info", ...options });
   }
 
-  function addWarnToast(options: ToastMessageOptions): void {
-    addToast({ severity: "warn", ...options });
-  }
+  function addWarnToast(options: ToastMessageOptions): void {}
 
   function addErrorToast(options: ToastMessageOptions): void {
killedBy: Use Vue Prime Toasts Composable addWarnToast should add a warn toast with default options when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
composables/vue-prime/useVuePrimeToasts.ts:36:62
     addToast({ severity: "warn", ...options });
   }
 
-  function addErrorToast(options: ToastMessageOptions): void {
-    addToast({ severity: "error", ...options });
-  }
+  function addErrorToast(options: ToastMessageOptions): void {}
   return {
     addToast,
killedBy: Use Vue Prime Toasts Composable addErrorToast should add an error toast with default options when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
