[Killed] StringLiteral
pages/about.vue:54:12
 const { t } = useI18n();
 
 useHead({
-  title: t("pages.about.whyAnAssistant"),
+  title: t(""),
   meta: [{ name: "description", content: t("pages.about.seoDescription") }],
 });
killedBy: About Page Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "pages.about.seoDescription",
        "name": "description",

[Killed] ArrayDeclaration
pages/about.vue:55:9
 
 useHead({
   title: t("pages.about.whyAnAssistant"),
-  meta: [{ name: "description", content: t("pages.about.seoDescription") }],
+  meta: [],
 });
 </script>
killedBy: About Page Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "pages.about.seoDescription",
        "name": "description",

[Killed] ObjectLiteral
pages/about.vue:55:10
 
 useHead({
   title: t("pages.about.whyAnAssistant"),
-  meta: [{ name: "description", content: t("pages.about.seoDescription") }],
+  meta: [{}],
 });
 </script>
killedBy: About Page Component should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "pages.about.seoDescription",
        "name": "description",
