[Killed] ObjectLiteral
pages/game/[id].vue:51:9
 
 const { t } = useI18n();
 
-useHead({
-  title: t("pages.game.playingGame"),
-  meta: [{ name: "robots", content: "noindex, nofollow" }],
-});
+useHead({});
 
 const { id } = route.params;
killedBy: Game Page should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "noindex, nofollow",
        "name": "robots",

[Killed] StringLiteral
pages/game/[id].vue:52:12
 const { t } = useI18n();
 
 useHead({
-  title: t("pages.game.playingGame"),
+  title: t(""),
   meta: [{ name: "robots", content: "noindex, nofollow" }],
 });
killedBy: Game Page should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "noindex, nofollow",
        "name": "robots",

[Killed] ArrayDeclaration
pages/game/[id].vue:53:9
 
 useHead({
   title: t("pages.game.playingGame"),
-  meta: [{ name: "robots", content: "noindex, nofollow" }],
+  meta: [],
 });
 
killedBy: Game Page should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "noindex, nofollow",
        "name": "robots",

[Killed] ObjectLiteral
pages/game/[id].vue:53:10
 
 useHead({
   title: t("pages.game.playingGame"),
-  meta: [{ name: "robots", content: "noindex, nofollow" }],
+  meta: [{}],
 });
 
killedBy: Game Page should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "noindex, nofollow",
        "name": "robots",

[Killed] BlockStatement
pages/game/[id].vue:58:73
 
 const { id } = route.params;
 
-const gameStatusComponentToRender = computed<GameStatusComponent>(() => {
-  const gameStatusComponents: Record<GameStatus, GameStatusComponent> = {
-    playing: GamePlaying,
-    over: GameOver,
-    canceled: GameCanceled,
-  };
-
-  return gameStatusComponents[game.value.status];
-});
+const gameStatusComponentToRender = computed<GameStatusComponent>(() => {});
 
 const gameId = Array.isArray(id) ? id[0] : id;
killedBy: Game Page Game Status Containers should render playing game when game fetching status is success and game status is playing.
statusReason: expected false to be truthy
