[Killed] ObjectLiteral
pages/game-lobby.vue:50:10
 
 useHead({
   title: t("pages.gameLobby.startGame"),
-  meta: [{ name: "description", content: t("pages.gameLobby.seoDescription") }],
+  meta: [{}],
 });
 
killedBy: Game Lobby Page should set head title and meta tags when rendered.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once with Array [
  Object {
    "meta": Array [
      Object {
        "content": "pages.gameLobby.seoDescription",
        "name": "description",

[Killed] BlockStatement
pages/game-lobby.vue:53:64
   meta: [{ name: "description", content: t("pages.gameLobby.seoDescription") }],
 });
 
-function pickRoleForPlayer(player?: CreateGamePlayerDto): void {
-  if (!gameLobbyRolePicker.value) {
-    throw createError("Game Lobby Role Picker is not defined");
-  }
-  if (!player) {
-    return;
-  }
-  gameLobbyRolePicker.value.openToPickRoleForPlayer(player);
-}
+function pickRoleForPlayer(player?: CreateGamePlayerDto): void {}
 
 function openGameOptionsHub(): void {
killedBy: Game Lobby Page Game Lobby Role Picker should open role picker modal when game lobby players party emits pick role for player event.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
pages/game-lobby.vue:54:35
 });
 
 function pickRoleForPlayer(player?: CreateGamePlayerDto): void {
-  if (!gameLobbyRolePicker.value) {
-    throw createError("Game Lobby Role Picker is not defined");
-  }
+  if (!gameLobbyRolePicker.value) {}
   if (!player) {
     return;
killedBy: Game Lobby Page Game Lobby Role Picker should throw error when game lobby players party emits pick role for player event but the role picker is not found in refs.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby.vue:54:7
 });
 
 function pickRoleForPlayer(player?: CreateGamePlayerDto): void {
-  if (!gameLobbyRolePicker.value) {
+  if (false) {
     throw createError("Game Lobby Role Picker is not defined");
   }
killedBy: Game Lobby Page Game Lobby Role Picker should throw error when game lobby players party emits pick role for player event but the role picker is not found in refs.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby.vue:57:7
   if (!gameLobbyRolePicker.value) {
     throw createError("Game Lobby Role Picker is not defined");
   }
-  if (!player) {
+  if (false) {
     return;
   }
killedBy: Game Lobby Page Game Lobby Role Picker should not open role picker modal when game lobby players party emits pick role for player event with no player.
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      undefined,

[Killed] BooleanLiteral
pages/game-lobby.vue:57:7
   if (!gameLobbyRolePicker.value) {
     throw createError("Game Lobby Role Picker is not defined");
   }
-  if (!player) {
+  if (player) {
     return;
   }
killedBy: Game Lobby Page Game Lobby Role Picker should open role picker modal when game lobby players party emits pick role for player event.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
pages/game-lobby.vue:63:37
   gameLobbyRolePicker.value.openToPickRoleForPlayer(player);
 }
 
-function openGameOptionsHub(): void {
-  if (!gameLobbyOptionsHub.value) {
-    throw createError("Game Lobby Options Hub is not defined");
-  }
-  gameLobbyOptionsHub.value.open();
-}
+function openGameOptionsHub(): void {}
 
 resetCreateGameDto();
killedBy: Game Lobby Page Game Lobby Options Hub should open game lobby options hub when game lobby players party emits open options hub event.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby.vue:64:7
 }
 
 function openGameOptionsHub(): void {
-  if (!gameLobbyOptionsHub.value) {
+  if (false) {
     throw createError("Game Lobby Options Hub is not defined");
   }
killedBy: Game Lobby Page Game Lobby Options Hub should throw error when game lobby header emits game options button click event but the options hub is not found in refs.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ConditionalExpression
pages/game-lobby.vue:64:7
 }
 
 function openGameOptionsHub(): void {
-  if (!gameLobbyOptionsHub.value) {
+  if (true) {
     throw createError("Game Lobby Options Hub is not defined");
   }
killedBy: Game Lobby Page Game Lobby Options Hub should open game lobby options hub when game lobby players party emits open options hub event.
statusReason: Mocked error
