[Killed] BlockStatement
stores/game/create-game-dto/useCreateGameDtoStore.ts:22:70
 
   const createGameDto = ref<CreateGameDto>(CreateGameDto.create(defaultCreateGameDto));
 
-  function setCreateGameDto(createGameDtoValue: CreateGameDto): void {
-    createGameDto.value = CreateGameDto.create(createGameDtoValue);
-  }
+  function setCreateGameDto(createGameDtoValue: CreateGameDto): void {}
 
   function resetCreateGameDto(): void {
killedBy: Create Game Dto Store setCreateGameDto should set createGameDto when called.
statusReason: expected _CreateGameDto{ players: [], …(2) } to strictly equal _CreateGameDto{ …(3) }

[Killed] BlockStatement
stores/game/create-game-dto/useCreateGameDtoStore.ts:26:39
     createGameDto.value = CreateGameDto.create(createGameDtoValue);
   }
 
-  function resetCreateGameDto(): void {
-    createGameDto.value = CreateGameDto.create(defaultCreateGameDto);
-  }
+  function resetCreateGameDto(): void {}
 
   function addPlayerToCreateGameDto(player: CreateGamePlayerDto): void {
killedBy: Create Game Dto Store resetCreateGameDto should reset create game dto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ players: [], …(2) }

[Killed] BlockStatement
stores/game/create-game-dto/useCreateGameDtoStore.ts:30:72
     createGameDto.value = CreateGameDto.create(defaultCreateGameDto);
   }
 
-  function addPlayerToCreateGameDto(player: CreateGamePlayerDto): void {
-    createGameDto.value.players.push(CreateGamePlayerDto.create(player));
-  }
+  function addPlayerToCreateGameDto(player: CreateGamePlayerDto): void {}
 
   function updatePlayerInCreateGameDto(player: CreateGamePlayerDto): void {
killedBy: Create Game Dto Store addPlayerToCreateGameDto should add player to createGameDto when called.
statusReason: expected _CreateGameDto{ players: [], …(2) } to strictly equal _CreateGameDto{ …(3) }

[Killed] BlockStatement
stores/game/create-game-dto/useCreateGameDtoStore.ts:34:75
     createGameDto.value.players.push(CreateGamePlayerDto.create(player));
   }
 
-  function updatePlayerInCreateGameDto(player: CreateGamePlayerDto): void {
-    const playerIndex = createGameDto.value.players.findIndex(({ name }) => name === player.name);
-    if (playerIndex !== -1) {
-      createGameDto.value.players.splice(playerIndex, 1, CreateGamePlayerDto.create(player));
-    }
-  }
+  function updatePlayerInCreateGameDto(player: CreateGamePlayerDto): void {}
 
   function setPlayersToCreateGameDto(players: CreateGamePlayerDto[]): void {
killedBy: Create Game Dto Store updatePlayerInCreateGameDto should update player in createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] EqualityOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:35:77
   }
 
   function updatePlayerInCreateGameDto(player: CreateGamePlayerDto): void {
-    const playerIndex = createGameDto.value.players.findIndex(({ name }) => name === player.name);
+    const playerIndex = createGameDto.value.players.findIndex(({ name }) => name !== player.name);
     if (playerIndex !== -1) {
       createGameDto.value.players.splice(playerIndex, 1, CreateGamePlayerDto.create(player));
killedBy: Create Game Dto Store updatePlayerInCreateGameDto should update player in createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] ConditionalExpression
stores/game/create-game-dto/useCreateGameDtoStore.ts:35:77
   }
 
   function updatePlayerInCreateGameDto(player: CreateGamePlayerDto): void {
-    const playerIndex = createGameDto.value.players.findIndex(({ name }) => name === player.name);
+    const playerIndex = createGameDto.value.players.findIndex(({ name }) => false);
     if (playerIndex !== -1) {
       createGameDto.value.players.splice(playerIndex, 1, CreateGamePlayerDto.create(player));
killedBy: Create Game Dto Store updatePlayerInCreateGameDto should update player in createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] ConditionalExpression
stores/game/create-game-dto/useCreateGameDtoStore.ts:36:9
 
   function updatePlayerInCreateGameDto(player: CreateGamePlayerDto): void {
     const playerIndex = createGameDto.value.players.findIndex(({ name }) => name === player.name);
-    if (playerIndex !== -1) {
+    if (true) {
       createGameDto.value.players.splice(playerIndex, 1, CreateGamePlayerDto.create(player));
     }
killedBy: Create Game Dto Store updatePlayerInCreateGameDto should not update player in createGameDto when player not found.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] UnaryOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:36:25
 
   function updatePlayerInCreateGameDto(player: CreateGamePlayerDto): void {
     const playerIndex = createGameDto.value.players.findIndex(({ name }) => name === player.name);
-    if (playerIndex !== -1) {
+    if (playerIndex !== +1) {
       createGameDto.value.players.splice(playerIndex, 1, CreateGamePlayerDto.create(player));
     }
killedBy: Create Game Dto Store updatePlayerInCreateGameDto should update player in createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] BlockStatement
stores/game/create-game-dto/useCreateGameDtoStore.ts:41:76
     }
   }
 
-  function setPlayersToCreateGameDto(players: CreateGamePlayerDto[]): void {
-    createGameDto.value.players = players.map(player => CreateGamePlayerDto.create(player));
-  }
+  function setPlayersToCreateGameDto(players: CreateGamePlayerDto[]): void {}
 
   function removePlayerFromCreateGameDto(playerName: string): void {
killedBy: Create Game Dto Store setPlayersToCreateGameDto should set players to createGameDto when called.
statusReason: expected [] to strictly equal [ _CreateGamePlayerDto{ …(4) }, …(2) ]

[Killed] BlockStatement
stores/game/create-game-dto/useCreateGameDtoStore.ts:45:68
     createGameDto.value.players = players.map(player => CreateGamePlayerDto.create(player));
   }
 
-  function removePlayerFromCreateGameDto(playerName: string): void {
-    const playerIndex = createGameDto.value.players.findIndex(player => player.name === playerName);
-    if (playerIndex !== -1) {
-      createGameDto.value.players = createGameDto.value.players.toSpliced(playerIndex, 1);
-    }
-  }
+  function removePlayerFromCreateGameDto(playerName: string): void {}
 
   function getPlayersWithRoleNameInCreateGameDto(roleName: RoleName): CreateGamePlayerDto[] {
killedBy: Create Game Dto Store removePlayerFromCreateGameDto should remove player from createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] EqualityOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:46:73
   }
 
   function removePlayerFromCreateGameDto(playerName: string): void {
-    const playerIndex = createGameDto.value.players.findIndex(player => player.name === playerName);
+    const playerIndex = createGameDto.value.players.findIndex(player => player.name !== playerName);
     if (playerIndex !== -1) {
       createGameDto.value.players = createGameDto.value.players.toSpliced(playerIndex, 1);
killedBy: Create Game Dto Store removePlayerFromCreateGameDto should remove player from createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] ConditionalExpression
stores/game/create-game-dto/useCreateGameDtoStore.ts:46:73
   }
 
   function removePlayerFromCreateGameDto(playerName: string): void {
-    const playerIndex = createGameDto.value.players.findIndex(player => player.name === playerName);
+    const playerIndex = createGameDto.value.players.findIndex(player => false);
     if (playerIndex !== -1) {
       createGameDto.value.players = createGameDto.value.players.toSpliced(playerIndex, 1);
killedBy: Create Game Dto Store removePlayerFromCreateGameDto should remove player from createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] ConditionalExpression
stores/game/create-game-dto/useCreateGameDtoStore.ts:47:9
 
   function removePlayerFromCreateGameDto(playerName: string): void {
     const playerIndex = createGameDto.value.players.findIndex(player => player.name === playerName);
-    if (playerIndex !== -1) {
+    if (false) {
       createGameDto.value.players = createGameDto.value.players.toSpliced(playerIndex, 1);
     }
killedBy: Create Game Dto Store removePlayerFromCreateGameDto should remove player from createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] UnaryOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:47:25
 
   function removePlayerFromCreateGameDto(playerName: string): void {
     const playerIndex = createGameDto.value.players.findIndex(player => player.name === playerName);
-    if (playerIndex !== -1) {
+    if (playerIndex !== +1) {
       createGameDto.value.players = createGameDto.value.players.toSpliced(playerIndex, 1);
     }
killedBy: Create Game Dto Store removePlayerFromCreateGameDto should remove player from createGameDto when called.
statusReason: expected _CreateGameDto{ …(3) } to strictly equal _CreateGameDto{ …(3) }

[Killed] ArrowFunction
stores/game/create-game-dto/useCreateGameDtoStore.ts:53:47
   }
 
   function getPlayersWithRoleNameInCreateGameDto(roleName: RoleName): CreateGamePlayerDto[] {
-    return createGameDto.value.players.filter(player => player.role.name === roleName);
+    return createGameDto.value.players.filter(() => undefined);
   }
 
killedBy: Create Game Dto Store getPlayersWithRoleNameInCreateGameDto should return players with role name in createGameDto when called.
statusReason: expected [] to strictly equal [ _CreateGamePlayerDto{ …(4) }, …(1) ]

[Killed] ConditionalExpression
stores/game/create-game-dto/useCreateGameDtoStore.ts:53:57
   }
 
   function getPlayersWithRoleNameInCreateGameDto(roleName: RoleName): CreateGamePlayerDto[] {
-    return createGameDto.value.players.filter(player => player.role.name === roleName);
+    return createGameDto.value.players.filter(player => false);
   }
 
killedBy: Create Game Dto Store getPlayersWithRoleNameInCreateGameDto should return players with role name in createGameDto when called.
statusReason: expected [] to strictly equal [ _CreateGamePlayerDto{ …(4) }, …(1) ]

[Killed] ConditionalExpression
stores/game/create-game-dto/useCreateGameDtoStore.ts:60:12
     const playersWithRoleName = getPlayersWithRoleNameInCreateGameDto(roleName);
     const role = getRoleWithNameInRoles(roleName);
 
-    return !!role && (role.minInGame === undefined || playersWithRoleName.length >= role.minInGame);
+    return true;
   }
 
killedBy: Create Game Dto Store isRoleMinReachedInCreateGameDto 'should return false when role min is …'
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
stores/game/create-game-dto/useCreateGameDtoStore.ts:60:12
     const playersWithRoleName = getPlayersWithRoleNameInCreateGameDto(roleName);
     const role = getRoleWithNameInRoles(roleName);
 
-    return !!role && (role.minInGame === undefined || playersWithRoleName.length >= role.minInGame);
+    return false;
   }
 
killedBy: Create Game Dto Store isRoleMinReachedInCreateGameDto 'should return true when role min is r…'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:67:22
     const playersWithRoleName = getPlayersWithRoleNameInCreateGameDto(roleName);
     const role = getRoleWithNameInRoles(roleName);
 
-    return !!role && playersWithRoleName.length >= role.maxInGame;
+    return !!role && playersWithRoleName.length > role.maxInGame;
   }
 
killedBy: Create Game Dto Store isRoleMaxReachedInCreateGameDto 'should return true when role max is r…'
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:67:22
     const playersWithRoleName = getPlayersWithRoleNameInCreateGameDto(roleName);
     const role = getRoleWithNameInRoles(roleName);
 
-    return !!role && playersWithRoleName.length >= role.maxInGame;
+    return !!role && playersWithRoleName.length < role.maxInGame;
   }
 
killedBy: Create Game Dto Store isRoleMaxReachedInCreateGameDto 'should return true when role max is r…'
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:76:23
     if (role?.minInGame === undefined) {
       return 0;
     }
-    const leftCount = role.minInGame - playersWithRoleName.length;
+    const leftCount = role.minInGame + playersWithRoleName.length;
 
     return leftCount <= -1 ? 0 : leftCount;
killedBy: Create Game Dto Store getRoleLeftCountToReachMinInCreateGameDto 'should return 0 when role min is reac…'
statusReason: expected 2 to be +0 // Object.is equality

[Killed] UnaryOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:78:25
     }
     const leftCount = role.minInGame - playersWithRoleName.length;
 
-    return leftCount <= -1 ? 0 : leftCount;
+    return leftCount <= +1 ? 0 : leftCount;
   }
   return {
killedBy: Create Game Dto Store getRoleLeftCountToReachMinInCreateGameDto 'should return 1 when role min is not …'
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
stores/game/create-game-dto/useCreateGameDtoStore.ts:78:12
     }
     const leftCount = role.minInGame - playersWithRoleName.length;
 
-    return leftCount <= -1 ? 0 : leftCount;
+    return leftCount > -1 ? 0 : leftCount;
   }
   return {
killedBy: Create Game Dto Store getRoleLeftCountToReachMinInCreateGameDto 'should return 0 when role min is reac…'
statusReason: expected -1 to be +0 // Object.is equality
