[Killed] BlockStatement
stores/game/game-history-record/useGameHistoryRecordsStore.ts:14:79
   const gameHistoryRecords = ref<GameHistoryRecord[]>([]);
   const fetchingGameHistoryRecordsStatus = ref<AsyncDataRequestStatus>("idle");
 
-  async function fetchAndSetGameHistoryRecords(gameId: string): Promise<void> {
-    fetchingGameHistoryRecordsStatus.value = "pending";
-    const fetchedGameHistoryRecords = await getGameHistoryRecords(gameId);
-    if (!fetchedGameHistoryRecords) {
-      fetchingGameHistoryRecordsStatus.value = "error";
-
-      return;
-    }
-    gameHistoryRecords.value = fetchedGameHistoryRecords;
-    fetchingGameHistoryRecordsStatus.value = "success";
-  }
+  async function fetchAndSetGameHistoryRecords(gameId: string): Promise<void> {}
   return {
     gameHistoryRecords,
killedBy: Game History Records Store fetchAndSetGameHistoryRecords should fetch game history records when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
