[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:13:76
 const useMakeGamePlayDtoStore = defineStore(StoreIds.MAKE_GAME_PLAY_DTO, () => {
   const makeGamePlayDto = ref<MakeGamePlayDto>(MakeGamePlayDto.create({}));
 
-  function setMakeGamePlayDto(makeGamePlayDtoValue: MakeGamePlayDto): void {
-    makeGamePlayDto.value = MakeGamePlayDto.create(makeGamePlayDtoValue);
-  }
+  function setMakeGamePlayDto(makeGamePlayDtoValue: MakeGamePlayDto): void {}
 
   function resetMakeGamePlayDto(): void {
killedBy: Make Game Play Dto Store setMakeGamePlayDto should set makeGamePlayDto when called.
statusReason: expected _MakeGamePlayDto{ …(5) } to strictly equal _MakeGamePlayDto{ targets: [], …(4) }

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:17:41
     makeGamePlayDto.value = MakeGamePlayDto.create(makeGamePlayDtoValue);
   }
 
-  function resetMakeGamePlayDto(): void {
-    makeGamePlayDto.value = MakeGamePlayDto.create({});
-  }
+  function resetMakeGamePlayDto(): void {}
 
   function addMakeGamePlayTargetDto(target: MakeGamePlayTargetDto): void {
killedBy: Make Game Play Dto Store resetMakeGamePlayDto should reset make game play dto when called.
statusReason: expected _MakeGamePlayDto{ targets: [], …(4) } to strictly equal _MakeGamePlayDto{ …(5) }

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:21:74
     makeGamePlayDto.value = MakeGamePlayDto.create({});
   }
 
-  function addMakeGamePlayTargetDto(target: MakeGamePlayTargetDto): void {
-    if (!makeGamePlayDto.value.targets) {
-      makeGamePlayDto.value.targets = [];
-    }
-    makeGamePlayDto.value.targets.push(MakeGamePlayTargetDto.create(target));
-  }
+  function addMakeGamePlayTargetDto(target: MakeGamePlayTargetDto): void {}
 
   function removeMakeGamePlayTargetDto(targetId: string): void {
killedBy: Make Game Play Dto Store addMakeGamePlayTargetDto should add target to makeGamePlayDto when targets are undefined.
statusReason: expected undefined to strictly equal [ _MakeGamePlayTargetDto{ …(2) } ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:22:9
   }
 
   function addMakeGamePlayTargetDto(target: MakeGamePlayTargetDto): void {
-    if (!makeGamePlayDto.value.targets) {
+    if (true) {
       makeGamePlayDto.value.targets = [];
     }
killedBy: Make Game Play Dto Store addMakeGamePlayTargetDto should add target to makeGamePlayDto when targets are defined.
statusReason: expected [ _MakeGamePlayTargetDto{ …(2) } ] to strictly equal [ Array(2) ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:28:64
     makeGamePlayDto.value.targets.push(MakeGamePlayTargetDto.create(target));
   }
 
-  function removeMakeGamePlayTargetDto(targetId: string): void {
-    if (!makeGamePlayDto.value.targets) {
-      return;
-    }
-    const targetIndex = makeGamePlayDto.value.targets.findIndex(target => target.playerId === targetId);
-    if (targetIndex !== -1) {
-      makeGamePlayDto.value.targets = makeGamePlayDto.value.targets.toSpliced(targetIndex, 1);
-    }
-    if (makeGamePlayDto.value.targets.length === 0) {
-      makeGamePlayDto.value.targets = undefined;
-    }
-  }
+  function removeMakeGamePlayTargetDto(targetId: string): void {}
 
   function removeFirstMakeGamePlayTargetDto(): void {
killedBy: Make Game Play Dto Store removeMakeGamePlayTargetDto should remove target from makeGamePlayDto when target exists.
statusReason: expected [ Array(3) ] to strictly equal [ Array(2) ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:32:75
     if (!makeGamePlayDto.value.targets) {
       return;
     }
-    const targetIndex = makeGamePlayDto.value.targets.findIndex(target => target.playerId === targetId);
+    const targetIndex = makeGamePlayDto.value.targets.findIndex(target => true);
     if (targetIndex !== -1) {
       makeGamePlayDto.value.targets = makeGamePlayDto.value.targets.toSpliced(targetIndex, 1);
killedBy: Make Game Play Dto Store removeMakeGamePlayTargetDto should not remove target from makeGamePlayDto when target does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayTargetDto{ …(2) } ]

[Killed] ArrowFunction
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:32:65
     if (!makeGamePlayDto.value.targets) {
       return;
     }
-    const targetIndex = makeGamePlayDto.value.targets.findIndex(target => target.playerId === targetId);
+    const targetIndex = makeGamePlayDto.value.targets.findIndex(() => undefined);
     if (targetIndex !== -1) {
       makeGamePlayDto.value.targets = makeGamePlayDto.value.targets.toSpliced(targetIndex, 1);
killedBy: Make Game Play Dto Store removeMakeGamePlayTargetDto should remove target from makeGamePlayDto when target exists.
statusReason: expected [ Array(3) ] to strictly equal [ Array(2) ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:33:29
       return;
     }
     const targetIndex = makeGamePlayDto.value.targets.findIndex(target => target.playerId === targetId);
-    if (targetIndex !== -1) {
-      makeGamePlayDto.value.targets = makeGamePlayDto.value.targets.toSpliced(targetIndex, 1);
-    }
+    if (targetIndex !== -1) {}
     if (makeGamePlayDto.value.targets.length === 0) {
       makeGamePlayDto.value.targets = undefined;
killedBy: Make Game Play Dto Store removeMakeGamePlayTargetDto should remove target from makeGamePlayDto when target exists.
statusReason: expected [ Array(3) ] to strictly equal [ Array(2) ]

[Killed] UnaryOperator
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:33:25
       return;
     }
     const targetIndex = makeGamePlayDto.value.targets.findIndex(target => target.playerId === targetId);
-    if (targetIndex !== -1) {
+    if (targetIndex !== +1) {
       makeGamePlayDto.value.targets = makeGamePlayDto.value.targets.toSpliced(targetIndex, 1);
     }
killedBy: Make Game Play Dto Store removeMakeGamePlayTargetDto should not remove target from makeGamePlayDto when target does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayTargetDto{ …(2) } ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:36:53
     if (targetIndex !== -1) {
       makeGamePlayDto.value.targets = makeGamePlayDto.value.targets.toSpliced(targetIndex, 1);
     }
-    if (makeGamePlayDto.value.targets.length === 0) {
-      makeGamePlayDto.value.targets = undefined;
-    }
+    if (makeGamePlayDto.value.targets.length === 0) {}
   }
 
killedBy: Make Game Play Dto Store removeMakeGamePlayTargetDto should remove target from makeGamePlayDto when target exists and set it as undefined because there is no targets left.
statusReason: expected [] to be undefined

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:36:9
     if (targetIndex !== -1) {
       makeGamePlayDto.value.targets = makeGamePlayDto.value.targets.toSpliced(targetIndex, 1);
     }
-    if (makeGamePlayDto.value.targets.length === 0) {
+    if (true) {
       makeGamePlayDto.value.targets = undefined;
     }
killedBy: Make Game Play Dto Store removeMakeGamePlayTargetDto should not remove target from makeGamePlayDto when target does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayTargetDto{ …(2) } ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:41:53
     }
   }
 
-  function removeFirstMakeGamePlayTargetDto(): void {
-    if (!makeGamePlayDto.value.targets || makeGamePlayDto.value.targets.length === 0) {
-      return;
-    }
-    const firstTarget = makeGamePlayDto.value.targets[0];
-    removeMakeGamePlayTargetDto(firstTarget.playerId);
-  }
+  function removeFirstMakeGamePlayTargetDto(): void {}
 
   function removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion: WitchPotion): void {
killedBy: Make Game Play Dto Store removeFirstMakeGamePlayTargetDto should remove first target from makeGamePlayDto when there is targets.
statusReason: expected [ Array(3) ] to strictly equal [ Array(2) ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:42:43
   }
 
   function removeFirstMakeGamePlayTargetDto(): void {
-    if (!makeGamePlayDto.value.targets || makeGamePlayDto.value.targets.length === 0) {
+    if (!makeGamePlayDto.value.targets || false) {
       return;
     }
killedBy: Make Game Play Dto Store removeFirstMakeGamePlayTargetDto should not remove first target from makeGamePlayDto when there is no targets.
statusReason: Cannot read properties of undefined (reading 'playerId')

[Killed] EqualityOperator
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:42:43
   }
 
   function removeFirstMakeGamePlayTargetDto(): void {
-    if (!makeGamePlayDto.value.targets || makeGamePlayDto.value.targets.length === 0) {
+    if (!makeGamePlayDto.value.targets || makeGamePlayDto.value.targets.length !== 0) {
       return;
     }
killedBy: Make Game Play Dto Store removeFirstMakeGamePlayTargetDto should not remove first target from makeGamePlayDto when there is no targets.
statusReason: Cannot read properties of undefined (reading 'playerId')

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:49:87
     removeMakeGamePlayTargetDto(firstTarget.playerId);
   }
 
-  function removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion: WitchPotion): void {
-    const firstDrankPotionTarget = makeGamePlayDto.value.targets?.find(target => target.drankPotion === drankPotion);
-    if (firstDrankPotionTarget) {
-      removeMakeGamePlayTargetDto(firstDrankPotionTarget.playerId);
-    }
-  }
+  function removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion: WitchPotion): void {}
 
   function addMakeGamePlayVoteDto(vote: MakeGamePlayVoteDto): void {
killedBy: Make Game Play Dto Store removeFirstMakeGamePlayTargetDtoWithPotion should remove first target from makeGamePlayDto when there is target with potion.
statusReason: expected [ Array(3) ] to strictly equal [ Array(2) ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:50:82
   }
 
   function removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion: WitchPotion): void {
-    const firstDrankPotionTarget = makeGamePlayDto.value.targets?.find(target => target.drankPotion === drankPotion);
+    const firstDrankPotionTarget = makeGamePlayDto.value.targets?.find(target => false);
     if (firstDrankPotionTarget) {
       removeMakeGamePlayTargetDto(firstDrankPotionTarget.playerId);
killedBy: Make Game Play Dto Store removeFirstMakeGamePlayTargetDtoWithPotion should remove first target from makeGamePlayDto when there is target with potion.
statusReason: expected [ Array(3) ] to strictly equal [ Array(2) ]

[Killed] EqualityOperator
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:50:82
   }
 
   function removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion: WitchPotion): void {
-    const firstDrankPotionTarget = makeGamePlayDto.value.targets?.find(target => target.drankPotion === drankPotion);
+    const firstDrankPotionTarget = makeGamePlayDto.value.targets?.find(target => target.drankPotion !== drankPotion);
     if (firstDrankPotionTarget) {
       removeMakeGamePlayTargetDto(firstDrankPotionTarget.playerId);
killedBy: Make Game Play Dto Store removeFirstMakeGamePlayTargetDtoWithPotion should not remove first target from makeGamePlayDto when there is no target with potion.
statusReason: expected [ Array(2) ] to strictly equal [ Array(3) ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:51:33
 
   function removeFirstMakeGamePlayTargetDtoWithPotion(drankPotion: WitchPotion): void {
     const firstDrankPotionTarget = makeGamePlayDto.value.targets?.find(target => target.drankPotion === drankPotion);
-    if (firstDrankPotionTarget) {
-      removeMakeGamePlayTargetDto(firstDrankPotionTarget.playerId);
-    }
+    if (firstDrankPotionTarget) {}
   }
 
killedBy: Make Game Play Dto Store removeFirstMakeGamePlayTargetDtoWithPotion should remove first target from makeGamePlayDto when there is target with potion.
statusReason: expected [ Array(3) ] to strictly equal [ Array(2) ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:56:68
     }
   }
 
-  function addMakeGamePlayVoteDto(vote: MakeGamePlayVoteDto): void {
-    if (!makeGamePlayDto.value.votes) {
-      makeGamePlayDto.value.votes = [];
-    }
-    makeGamePlayDto.value.votes.push(MakeGamePlayVoteDto.create(vote));
-  }
+  function addMakeGamePlayVoteDto(vote: MakeGamePlayVoteDto): void {}
 
   function removeMakeGamePlayVoteDto(sourceId: string): void {
killedBy: Make Game Play Dto Store addMakeGamePlayVoteDto should add vote to makeGamePlayDto when votes are undefined.
statusReason: expected undefined to strictly equal [ _MakeGamePlayVoteDto{ …(2) } ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:57:9
   }
 
   function addMakeGamePlayVoteDto(vote: MakeGamePlayVoteDto): void {
-    if (!makeGamePlayDto.value.votes) {
+    if (true) {
       makeGamePlayDto.value.votes = [];
     }
killedBy: Make Game Play Dto Store addMakeGamePlayVoteDto should add vote to makeGamePlayDto when votes are defined.
statusReason: expected [ _MakeGamePlayVoteDto{ …(2) } ] to strictly equal [ _MakeGamePlayVoteDto{ …(2) }, …(1) ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:63:62
     makeGamePlayDto.value.votes.push(MakeGamePlayVoteDto.create(vote));
   }
 
-  function removeMakeGamePlayVoteDto(sourceId: string): void {
-    if (!makeGamePlayDto.value.votes) {
-      return;
-    }
-    const voteIndex = makeGamePlayDto.value.votes.findIndex(vote => vote.sourceId === sourceId);
-    if (voteIndex !== -1) {
-      makeGamePlayDto.value.votes = makeGamePlayDto.value.votes.toSpliced(voteIndex, 1);
-    }
-    if (makeGamePlayDto.value.votes.length === 0) {
-      makeGamePlayDto.value.votes = undefined;
-    }
-  }
+  function removeMakeGamePlayVoteDto(sourceId: string): void {}
 
   function setDoesJudgeRequestAnotherVote(doesJudgeRequestAnotherVote: boolean | undefined): void {
killedBy: Make Game Play Dto Store removeMakeGamePlayVoteDto should remove vote from makeGamePlayDto when vote exists.
statusReason: expected [ _MakeGamePlayVoteDto{ …(2) }, …(2) ] to strictly equal [ _MakeGamePlayVoteDto{ …(2) }, …(1) ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:67:69
     if (!makeGamePlayDto.value.votes) {
       return;
     }
-    const voteIndex = makeGamePlayDto.value.votes.findIndex(vote => vote.sourceId === sourceId);
+    const voteIndex = makeGamePlayDto.value.votes.findIndex(vote => true);
     if (voteIndex !== -1) {
       makeGamePlayDto.value.votes = makeGamePlayDto.value.votes.toSpliced(voteIndex, 1);
killedBy: Make Game Play Dto Store removeMakeGamePlayVoteDto should not remove vote from makeGamePlayDto when vote does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayVoteDto{ …(2) } ]

[Killed] EqualityOperator
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:67:69
     if (!makeGamePlayDto.value.votes) {
       return;
     }
-    const voteIndex = makeGamePlayDto.value.votes.findIndex(vote => vote.sourceId === sourceId);
+    const voteIndex = makeGamePlayDto.value.votes.findIndex(vote => vote.sourceId !== sourceId);
     if (voteIndex !== -1) {
       makeGamePlayDto.value.votes = makeGamePlayDto.value.votes.toSpliced(voteIndex, 1);
killedBy: Make Game Play Dto Store removeMakeGamePlayVoteDto should not remove vote from makeGamePlayDto when vote does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayVoteDto{ …(2) } ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:68:27
       return;
     }
     const voteIndex = makeGamePlayDto.value.votes.findIndex(vote => vote.sourceId === sourceId);
-    if (voteIndex !== -1) {
-      makeGamePlayDto.value.votes = makeGamePlayDto.value.votes.toSpliced(voteIndex, 1);
-    }
+    if (voteIndex !== -1) {}
     if (makeGamePlayDto.value.votes.length === 0) {
       makeGamePlayDto.value.votes = undefined;
killedBy: Make Game Play Dto Store removeMakeGamePlayVoteDto should remove vote from makeGamePlayDto when vote exists.
statusReason: expected [ _MakeGamePlayVoteDto{ …(2) }, …(2) ] to strictly equal [ _MakeGamePlayVoteDto{ …(2) }, …(1) ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:68:9
       return;
     }
     const voteIndex = makeGamePlayDto.value.votes.findIndex(vote => vote.sourceId === sourceId);
-    if (voteIndex !== -1) {
+    if (true) {
       makeGamePlayDto.value.votes = makeGamePlayDto.value.votes.toSpliced(voteIndex, 1);
     }
killedBy: Make Game Play Dto Store removeMakeGamePlayVoteDto should not remove vote from makeGamePlayDto when vote does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayVoteDto{ …(2) } ]

[Killed] EqualityOperator
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:71:9
     if (voteIndex !== -1) {
       makeGamePlayDto.value.votes = makeGamePlayDto.value.votes.toSpliced(voteIndex, 1);
     }
-    if (makeGamePlayDto.value.votes.length === 0) {
+    if (makeGamePlayDto.value.votes.length !== 0) {
       makeGamePlayDto.value.votes = undefined;
     }
killedBy: Make Game Play Dto Store removeMakeGamePlayVoteDto should not remove vote from makeGamePlayDto when vote does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayVoteDto{ …(2) } ]

[Killed] ConditionalExpression
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:71:9
     if (voteIndex !== -1) {
       makeGamePlayDto.value.votes = makeGamePlayDto.value.votes.toSpliced(voteIndex, 1);
     }
-    if (makeGamePlayDto.value.votes.length === 0) {
+    if (true) {
       makeGamePlayDto.value.votes = undefined;
     }
killedBy: Make Game Play Dto Store removeMakeGamePlayVoteDto should not remove vote from makeGamePlayDto when vote does not exist.
statusReason: expected undefined to strictly equal [ _MakeGamePlayVoteDto{ …(2) } ]

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:76:99
     }
   }
 
-  function setDoesJudgeRequestAnotherVote(doesJudgeRequestAnotherVote: boolean | undefined): void {
-    makeGamePlayDto.value.doesJudgeRequestAnotherVote = doesJudgeRequestAnotherVote;
-  }
+  function setDoesJudgeRequestAnotherVote(doesJudgeRequestAnotherVote: boolean | undefined): void {}
 
   function setChosenCardId(chosenCardId: string | undefined): void {
killedBy: Make Game Play Dto Store setDoesJudgeRequestAnotherVote should set doesJudgeRequestAnotherVote when called.
statusReason: expected undefined to be truthy

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:80:68
     makeGamePlayDto.value.doesJudgeRequestAnotherVote = doesJudgeRequestAnotherVote;
   }
 
-  function setChosenCardId(chosenCardId: string | undefined): void {
-    makeGamePlayDto.value.chosenCardId = chosenCardId;
-  }
+  function setChosenCardId(chosenCardId: string | undefined): void {}
 
   function setChosenSide(chosenSide: RoleSide | undefined): void {
killedBy: Make Game Play Dto Store setChosenCardId should set chosenCardId when called.
statusReason: expected undefined to be 'cardId' // Object.is equality

[Killed] BlockStatement
stores/game/make-game-play-dto/useMakeGamePlayDtoStore.ts:84:66
     makeGamePlayDto.value.chosenCardId = chosenCardId;
   }
 
-  function setChosenSide(chosenSide: RoleSide | undefined): void {
-    makeGamePlayDto.value.chosenSide = chosenSide;
-  }
+  function setChosenSide(chosenSide: RoleSide | undefined): void {}
   return {
     makeGamePlayDto,
killedBy: Make Game Play Dto Store setChosenSide should set chosenSide when called.
statusReason: expected undefined to be 'werewolves' // Object.is equality
