[Killed] BlockStatement
stores/game/useGameStore.ts:21:30
   const cancelingGameStatus = ref<AsyncDataRequestStatus>("idle");
   const makingGamePlayStatus = ref<AsyncDataRequestStatus>("idle");
 
-  function resetGame(): void {
-    game.value = new Game();
-  }
+  function resetGame(): void {}
 
   async function fetchAndSetGame(gameId: string): Promise<void> {
killedBy: Game Store resetGame should reset game when called.
statusReason: expected _Game{ …(12) } to strictly equal _Game{ _id: undefined, …(11) }

[Killed] BlockStatement
stores/game/useGameStore.ts:25:65
     game.value = new Game();
   }
 
-  async function fetchAndSetGame(gameId: string): Promise<void> {
-    fetchingGameStatus.value = "pending";
-    const fetchedGame = await fetchGameFromApi(gameId);
-    if (!fetchedGame) {
-      fetchingGameStatus.value = "error";
-
-      return;
-    }
-    game.value = fetchedGame;
-    fetchingGameStatus.value = "success";
-  }
+  async function fetchAndSetGame(gameId: string): Promise<void> {}
 
   async function cancelGame(): Promise<void> {
killedBy: Game Store fetchAndSetGame should fetch game when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
stores/game/useGameStore.ts:37:46
     fetchingGameStatus.value = "success";
   }
 
-  async function cancelGame(): Promise<void> {
-    cancelingGameStatus.value = "pending";
-    const canceledGame = await cancelGameFromApi(game.value._id);
-    if (!canceledGame) {
-      fetchingGameStatus.value = "error";
-
-      return;
-    }
-    game.value = canceledGame;
-    cancelingGameStatus.value = "success";
-  }
+  async function cancelGame(): Promise<void> {}
 
   async function makeGamePlay(makeGamePlayDto: MakeGamePlayDto): Promise<void> {
killedBy: Game Store cancelGame should cancel game when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] BlockStatement
stores/game/useGameStore.ts:49:80
     cancelingGameStatus.value = "success";
   }
 
-  async function makeGamePlay(makeGamePlayDto: MakeGamePlayDto): Promise<void> {
-    makingGamePlayStatus.value = "pending";
-    const playedGame = await makeGamePlayFromApi(game.value._id, makeGamePlayDto);
-    if (!playedGame) {
-      fetchingGameStatus.value = "error";
-
-      return;
-    }
-    game.value = playedGame;
-    makingGamePlayStatus.value = "success";
-  }
+  async function makeGamePlay(makeGamePlayDto: MakeGamePlayDto): Promise<void> {}
   return {
     game,
killedBy: Game Store makeGamePlay should make game play when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times
