[Killed] BlockStatement
stores/role/useRolesStore.ts:16:52
   const fetchingRoleStatus = ref<AsyncDataRequestStatus>("idle");
   const roles = ref<Role[] | null>(null);
 
-  async function fetchAndSetRoles(): Promise<void> {
-    fetchingRoleStatus.value = "pending";
-    roles.value = await fetchRoles();
-    fetchingRoleStatus.value = "success";
-  }
+  async function fetchAndSetRoles(): Promise<void> {}
 
   function getRoleWithNameInRoles(roleName: RoleName): Role | undefined {
killedBy: Roles Store fetchAndSetRoles should fetch roles when called.
statusReason: expect(received).toHaveBeenCalledExactlyOnceWith(expected)

Expected mock function to have been called exactly once, but it was called 0 times

[Killed] ArrowFunction
stores/role/useRolesStore.ts:23:30
   }
 
   function getRoleWithNameInRoles(roleName: RoleName): Role | undefined {
-    return roles.value?.find(role => role.name === roleName);
+    return roles.value?.find(() => undefined);
   }
   return {
killedBy: Create Game Dto Store isRoleMinReachedInCreateGameDto 'should return true when role min is r…'
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
stores/role/useRolesStore.ts:23:38
   }
 
   function getRoleWithNameInRoles(roleName: RoleName): Role | undefined {
-    return roles.value?.find(role => role.name === roleName);
+    return roles.value?.find(role => true);
   }
   return {
killedBy: Create Game Dto Store isRoleMinReachedInCreateGameDto 'should return false when role min is …'
statusReason: expected true to be false // Object.is equality
