[Killed] ArrowFunction
stores/game/game-event/useGameEventsStore.ts:10:60
 const useGameEventsStore = defineStore(StoreIds.GAME_EVENTS, () => {
   const gameEvents = ref<GameEvent[]>([]);
   const currentGameEventIndex = ref<number>(0);
-  const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
+  const currentGameEvent = computed<GameEvent | undefined>(() => undefined);
   const canGoToNextGameEvent = computed<boolean>(() => currentGameEventIndex.value < gameEvents.value.length - 1);
   const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
killedBy: Game Events Store nextGameEvent should go to the next game event when called.
statusReason: expected undefined to strictly equal _GameEvent{ type: 'game-starts' }

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:11:56
   const gameEvents = ref<GameEvent[]>([]);
   const currentGameEventIndex = ref<number>(0);
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
-  const canGoToNextGameEvent = computed<boolean>(() => currentGameEventIndex.value < gameEvents.value.length - 1);
+  const canGoToNextGameEvent = computed<boolean>(() => true);
   const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
 
killedBy: Game Events Store should have initial state when created.
statusReason: expected true to be falsy

[Killed] EqualityOperator
stores/game/game-event/useGameEventsStore.ts:11:56
   const gameEvents = ref<GameEvent[]>([]);
   const currentGameEventIndex = ref<number>(0);
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
-  const canGoToNextGameEvent = computed<boolean>(() => currentGameEventIndex.value < gameEvents.value.length - 1);
+  const canGoToNextGameEvent = computed<boolean>(() => currentGameEventIndex.value >= gameEvents.value.length - 1);
   const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
 
killedBy: Game Events Store should have initial state when created.
statusReason: expected true to be falsy

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:12:60
   const currentGameEventIndex = ref<number>(0);
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
   const canGoToNextGameEvent = computed<boolean>(() => currentGameEventIndex.value < gameEvents.value.length - 1);
-  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
+  const canGoToPreviousGameEvent = computed<boolean>(() => false);
 
   function resetGameEvents(): void {
killedBy: Game Events Store canGoToPreviousGameEvent should return true when can go to previous game event.
statusReason: expected false to be truthy

[Killed] EqualityOperator
stores/game/game-event/useGameEventsStore.ts:12:60
   const currentGameEventIndex = ref<number>(0);
   const currentGameEvent = computed<GameEvent | undefined>(() => gameEvents.value[currentGameEventIndex.value]);
   const canGoToNextGameEvent = computed<boolean>(() => currentGameEventIndex.value < gameEvents.value.length - 1);
-  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
+  const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value <= 0);
 
   function resetGameEvents(): void {
killedBy: Game Events Store should have initial state when created.
statusReason: expected true to be falsy

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:14:36
   const canGoToNextGameEvent = computed<boolean>(() => currentGameEventIndex.value < gameEvents.value.length - 1);
   const canGoToPreviousGameEvent = computed<boolean>(() => currentGameEventIndex.value > 0);
 
-  function resetGameEvents(): void {
-    gameEvents.value = [];
-    currentGameEventIndex.value = 0;
-  }
+  function resetGameEvents(): void {}
 
   function generateAndSetGameEventsFromGame(game: Game): void {
killedBy: Game Events Store resetGameEvents should reset game events when called.
statusReason: expected [ …(3) ] to strictly equal []

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:19:63
     currentGameEventIndex.value = 0;
   }
 
-  function generateAndSetGameEventsFromGame(game: Game): void {
-    resetGameEvents();
-    if (game.tick === 1) {
-      gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    } else if (game.phase.tick === 1) {
-      const gameEventStartingPhaseType: GameEventType = game.phase.name === "day" ? "day-rises" : "night-falls";
-      gameEvents.value.push(GameEvent.create({ type: gameEventStartingPhaseType }));
-    }
-    gameEvents.value.push(GameEvent.create({ type: "turn-starts" }));
-  }
+  function generateAndSetGameEventsFromGame(game: Game): void {}
 
   function nextGameEvent(): void {
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate game starts and turn …'
statusReason: expected [] to strictly equal [ …(2) ]

[Killed] EqualityOperator
stores/game/game-event/useGameEventsStore.ts:21:9
 
   function generateAndSetGameEventsFromGame(game: Game): void {
     resetGameEvents();
-    if (game.tick === 1) {
+    if (game.tick !== 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     } else if (game.phase.tick === 1) {
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate game starts and turn …'
statusReason: expected [ _GameEvent{ type: 'turn-starts' } ] to strictly equal [ …(2) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:21:9
 
   function generateAndSetGameEventsFromGame(game: Game): void {
     resetGameEvents();
-    if (game.tick === 1) {
+    if (true) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     } else if (game.phase.tick === 1) {
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate day rises and turn st…'
statusReason: expected [ …(2) ] to strictly equal [ …(2) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:23:16
     resetGameEvents();
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    } else if (game.phase.tick === 1) {
+    } else if (false) {
       const gameEventStartingPhaseType: GameEventType = game.phase.name === "day" ? "day-rises" : "night-falls";
       gameEvents.value.push(GameEvent.create({ type: gameEventStartingPhaseType }));
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate day rises and turn st…'
statusReason: expected [ _GameEvent{ type: 'turn-starts' } ] to strictly equal [ …(2) ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:23:39
     resetGameEvents();
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
-    } else if (game.phase.tick === 1) {
-      const gameEventStartingPhaseType: GameEventType = game.phase.name === "day" ? "day-rises" : "night-falls";
-      gameEvents.value.push(GameEvent.create({ type: gameEventStartingPhaseType }));
-    }
+    } else if (game.phase.tick === 1) {}
     gameEvents.value.push(GameEvent.create({ type: "turn-starts" }));
   }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate day rises and turn st…'
statusReason: expected [ _GameEvent{ type: 'turn-starts' } ] to strictly equal [ …(2) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:24:57
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     } else if (game.phase.tick === 1) {
-      const gameEventStartingPhaseType: GameEventType = game.phase.name === "day" ? "day-rises" : "night-falls";
+      const gameEventStartingPhaseType: GameEventType = true ? "day-rises" : "night-falls";
       gameEvents.value.push(GameEvent.create({ type: gameEventStartingPhaseType }));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate night falls and turn …'
statusReason: expected [ …(2) ] to strictly equal [ …(2) ]

[Killed] ConditionalExpression
stores/game/game-event/useGameEventsStore.ts:24:57
     if (game.tick === 1) {
       gameEvents.value.push(GameEvent.create({ type: "game-starts" }));
     } else if (game.phase.tick === 1) {
-      const gameEventStartingPhaseType: GameEventType = game.phase.name === "day" ? "day-rises" : "night-falls";
+      const gameEventStartingPhaseType: GameEventType = false ? "day-rises" : "night-falls";
       gameEvents.value.push(GameEvent.create({ type: gameEventStartingPhaseType }));
     }
killedBy: Game Events Store generateAndSetGameEventsFromGame 'should generate day rises and turn st…'
statusReason: expected [ …(2) ] to strictly equal [ …(2) ]

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:30:34
     gameEvents.value.push(GameEvent.create({ type: "turn-starts" }));
   }
 
-  function nextGameEvent(): void {
-    currentGameEventIndex.value += 1;
-  }
+  function nextGameEvent(): void {}
 
   function previousGameEvent(): void {
killedBy: Game Events Store canGoToNextGameEvent should return false when cannot go to next game event.
statusReason: expected true to be falsy

[Killed] AssignmentOperator
stores/game/game-event/useGameEventsStore.ts:31:5
   }
 
   function nextGameEvent(): void {
-    currentGameEventIndex.value += 1;
+    currentGameEventIndex.value -= 1;
   }
 
killedBy: Game Events Store canGoToNextGameEvent should return false when cannot go to next game event.
statusReason: expected true to be falsy

[Killed] BlockStatement
stores/game/game-event/useGameEventsStore.ts:34:38
     currentGameEventIndex.value += 1;
   }
 
-  function previousGameEvent(): void {
-    currentGameEventIndex.value -= 1;
-  }
+  function previousGameEvent(): void {}
   return {
     gameEvents,
killedBy: Game Events Store previousGameEvent should go to the previous game event when called.
statusReason: expected _GameEvent{ type: 'game-starts' } to strictly equal _GameEvent{ type: 'night-falls' }

[Killed] AssignmentOperator
stores/game/game-event/useGameEventsStore.ts:35:5
   }
 
   function previousGameEvent(): void {
-    currentGameEventIndex.value -= 1;
+    currentGameEventIndex.value += 1;
   }
   return {
killedBy: Game Events Store previousGameEvent should go to the previous game event when called.
statusReason: expected undefined to strictly equal _GameEvent{ type: 'day-rises' }
